{
  "hash": "fc9d4b0ddd451f90c211072dc58c7e6b028a743f",
  "title": "Paleo Pumpkin and Carrot Muffins.",
  "image": "http://38.media.tumblr.com/015f4d1aa09b595755eaa62295d4f6d2/tumblr_inline_nei63wBHKj1qdei8m.jpg",
  "href": "http://nomnompaleo.com/post/101828602863/paleo-pumpkin-and-carrot-muffins",
  "extension": "Chrome",
  "firstAdded": "2016-02-06T12:55:36.286000",
  "users": [
    null
  ],
  "keywords": [
    "eggs",
    "room",
    "medium",
    "squeezed",
    "juice",
    "final",
    "volume",
    "carrots",
    "almond",
    "flour",
    "leveled",
    "pumpkin",
    "spice",
    "blend",
    "baking",
    "soda",
    "cream",
    "tartar",
    "cinnamon",
    "salt",
    "canned",
    "local",
    "honey",
    "butter",
    "coconut",
    "oil",
    "bit",
    "extra",
    "greasing",
    "muffin",
    "tin",
    "using",
    "paper",
    "liners",
    "almonds",
    "seeds"
  ],
  "directions": [
    "0",
    "Steps:",
    "Heat oven to 350°F with the rack in the middle position, and take your eggs out of the fridge. It’s important that your eggs are at room temperature when you start blending the liquid ingredients, or things’ll get chunky.",
    "Line a muffin tin with paper liners.",
    "Confession: Even when I make sure the muffin cups are coated with coconut oil or ghee, my muffins tend to stick. If you don’t want to use paper liners, you can use silicone ones, or just grease the living $%!# out of the cups and fall to your knees and pray that the muffins release.",
    "Next, grate your peeled carrots by hand or in a food processor…",
    "…and place the shredded carrots in a doubled piece of cheese cloth or clean dish towel. (Trust me: paper towels will tear.)",
    "Gather up the sides of the cloth and wring out the excess carrot juice…",
    "…and set the carrot shreds aside.",
    "In a large bowl, whisk together the almond flour, five spice powder, baking soda, cream of tartar, ground cinnamon, and sea salt.",
    "In a separate bowl, whisk the eggs well.",
    "Mix in the pumpkin, honey, almond butter, and melted coconut oil.",
    "Again, make sure these ingredients are at room temperature, or the coconut oil will harden and clump up. Not the worst thing in the world, but definitely annoying when your goal is a smooth batter.",
    "Add the wet ingredients to the dry…",
    "…and stir until combined.",
    "Fold in the grated carrots.",
    "Scoop the batter evenly into the muffin tins, filling them about ¾ full.",
    "Sprinkle sliced almonds and toasted pumpkin seeds on top before placing the muffins in the oven.",
    "Bake for about 30 minutes, rotating the muffin tin 180° halfway through the cooking process.",
    "The muffins are done when a toothpick inserted into the middle comes out clean and the tops feel springy to the touch.",
    "Cool the tray on a rack for about 5 minutes…",
    "…and then pop the muffins out and completely cool them directly on the rack.",
    "Final step: EAT.",
    "Store any uneaten muffins in an airtight container in the refrigerator for up to four days. They freeze beautifully, too! I try to let chilled muffins come up to room temperature before taking a bite, but to be honest, I sometimes usually can’t wait that long. Thankfully, they also taste great right out of the fridge.",
    "These muffins are perfect for autumn, so stock up on the ingredients and whip up a batch. Thanksgiving’s just around the corner!"
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "3 large eggs at room temperature",
    "4 medium carrots, grated and squeezed of juice (final volume: 1½ cups shredded carrots)",
    "1½ cups almond flour, spooned and leveled",
    "1½ teaspoons five spice powder (if you must, you can substitute pumpkin spice blend)",
    "1 teaspoons baking soda",
    "½ teaspoon cream of tartar",
    "½ teaspoon ground cinnamon",
    "⅛ teaspoon fine sea salt",
    "¾ cup canned pumpkin purée",
    "½ cup local honey",
    "2 tablespoons almond butter",
    "1 teaspoon melted coconut oil, and a bit extra for greasing the muffin tin if not using paper liners",
    "1 tablespoon sliced almonds",
    "1 tablespoon toasted pumpkin seeds"
  ],
  "__v": 1
}