{
  "hash": "f0e1056f6a9acda8dec1ecb4a45f33b24f5ab1b6",
  "title": "Crispy Ginger BeefCrispy Thai Beef Salad With Ginger-Lime Dressing",
  "image": "http://img.sndimg.com/food/image/upload/w_555,h_416,c_fit,fl_progressive,q_95/v1/img/recipes/10/70/72/picObl9Q6.jpg",
  "href": "http://www.food.com/recipe/crispy-ginger-beef-107072",
  "extension": "Chrome",
  "firstAdded": "2015-03-28T15:29:56.016000",
  "users": [
    null
  ],
  "keywords": [
    "flank",
    "steaks",
    "sirloin",
    "steak",
    "narrow",
    "strips",
    "cornstarch",
    "water",
    "eggs",
    "carrot",
    "julienned",
    "green",
    "onions",
    "ginger",
    "garlic",
    "canola",
    "oil",
    "soy",
    "rice",
    "vinegar",
    "sesame",
    "sugar",
    "red",
    "pepper"
  ],
  "directions": [
    "0",
    "Place cornstarch in a large bowl.",
    "Add water gradually while whisking.",
    "Beat eggs into cornstarch mixture.",
    "Toss in beef and stir to coat.",
    "Pour 1 inch of oil into wok, heat until boiling hot, but not smoking.",
    "Add a quarter of the beef to the oil.",
    "Seperate with a fork and cook, stirring frequently, until crispy, Remove, drain on paper towel and set aside.",
    "Repeat until all the beef is cooked.",
    "Drain off all oil except for about 1 tablespoons and add carrots, onion, ginger, and garlic in that order.",
    "Stir fry briefly over high heat.",
    "Combine last 5 ingredients and add to vegetable mixture.",
    "Bring to a boil and then add beef.",
    "Heat thorough and serve immediately.",
    "To make the dressing, whisk together the lime juice, fish sauce, brown sugar, ginger and sriracha in a small bowl.",
    "Put the beef in a large bowl and drizzle with 1 tablespoons of the dressing; toss until coated evenly. Spray a nonstick spray on a grill pan or nonstick skillet and set over medium-high heat. Place some of the slices of beel on the grill pan and cook, turning occasionally, until browned and crispy along the edges, about 10 minutes. Repeat with remaining beef, transferring it to a large plate.",
    "Layer the cabbage, onion, carrots, and mint on a platter; top with the steak and sprinkle with the cilantro and peanuts. Drizzle with remaining sauce."
  ],
  "ingredients": [
    "0",
    "1 lb flank steaks or 1 lb sirloin steak, sliced into narrow strips",
    "3⁄4 cup cornstarch",
    "1⁄2 cup water",
    "2 eggs",
    "1 large carrot, julienned",
    "3 green onions, chopped",
    "1⁄4 cup fresh ginger, minced",
    "5 garlic cloves, minced",
    "canola oil",
    "3 tablespoons soy sauce",
    "4 tablespoons rice vinegar",
    "1 tablespoon sesame oil",
    "1⁄2 cup sugar",
    "3 teaspoons crushed red pepper flakes, to taste"
  ],
  "__v": 3
}