{
  "hash": "898b13e93997f90329aa361065d419ddf03eabf5",
  "title": "Vegetarian Sweet Potato Chili",
  "image": "",
  "href": "https://cookieandkate.com/2011/sweet-potato-chili-recipe/",
  "extension": "Chrome",
  "firstAdded": "2019-01-04T17:42:52.235000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "In a 4-to-6 quart Dutch oven or stockpot over medium heat, warm the olive oil until shimmering. Add the chopped vegetables (onion, peppers and sweet potatoes) and a sprinkle of salt and pepper. Cook, stirring occasionally, until the onions start turning translucent, about 3 to 5 minutes.",
    "Reduce the heat to medium-low. Add the garlic and spices (chili powder, cumin, cayenne, cocoa powder, cinnamon, and another dash of salt and pepper) and liquid ingredients (tomatoes, beans and broth), and stir. Bring the mixture to a gentle simmer. Cover and cook, stirring occasionally and reducing heat as necessary to maintain a gentle simmer, until the sweet potatoes are tender and the chili has reduced to a heartier consistency, about 45 minutes to 1 hour.",
    "If you would like an even thicker consistency, use a potato masher to mash the chili until the texture suits your preferences. Season chili with salt and pepper to taste. Divide the chili into individual bowls, garnish as desired and serve."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1 tablespoon olive oil",
    "1 medium red onion, chopped",
    "1 green bell pepper, chopped",
    "1 red bell pepper, chopped",
    "1 medium sweet potato, peeled and cut into 1⁄2-inch cubes",
    "Salt and freshly ground black pepper",
    "4 garlic cloves, pressed or minced, or 1 heaping tablespoon of minced garlic",
    "1 tablespoon chili powder",
    "1 teaspoon ground cumin",
    "1 teaspoon cayenne pepper (more or less, depending on how spicy you like your chili)",
    "2 teaspoons unsweetened cocoa powder",
    "¼ teaspoon ground cinnamon",
    "1 large can (28 ounces) diced tomatoes, with their juices*",
    "1 can (15 ounces) black beans, rinsed and drained, or 1 ½ cups cooked black beans",
    "1 can (15 ounces) kidney beans, rinsed and drained, or 1 ½ cups cooked kidney beans",
    "2 cups vegetable broth",
    "Suggested garnishes: sour cream, grated cheese, thinly sliced green onions and/or chopped cilantro"
  ],
  "__v": 1
}