{
  "hash": "9a06f42c9176e38b28ff2f54ae91619e1d101def",
  "title": "Caramel Apple Cinnamon Rolls",
  "image": "http://2jdrz2dngiz2lydmrg17fj1ee6.wpengine.netdna-cdn.com/wp-content/uploads/2013/09/caramel-apple-cinnamon-roll-recipe-easy.jpg",
  "href": "http://www.momontimeout.com/2013/09/caramel-apple-cinnamon-rolls/",
  "firstAdded": "2014-12-21T16:49:33.010000",
  "users": [
    null
  ],
  "keywords": [
    "active",
    "dry",
    "yeast",
    "milk",
    "eggs",
    "sugar",
    "divided",
    "salt",
    "flour",
    "unsalted",
    "butter",
    "brown",
    "tbls",
    "cinnamon",
    "apple",
    "granny",
    "smith",
    "preferred",
    "lemon",
    "juice",
    "caramel",
    "bits",
    "whipping",
    "cream",
    "vanilla"
  ],
  "directions": [
    "0",
    "Mix together 2 tsp sugar, warm milk, and yeast in a mixer bowl. Let stand for five minutes.",
    "Beat eggs, sugar, and salt until well combined.",
    "Add egg mixture to yeast mixture and whisk to combine.",
    "Add 1 cup of flour and continue mixing until smooth.",
    "Pour in the melted butter and mix well.",
    "Continue adding remaining flour 1/2 cup at a time until dough is stiff.",
    "Knead dough 20 times on a lightly floured surface.",
    "Move the dough to a greased bowl and cover with a towel or plastic wrap. Place in a warm area and let rise until doubled in size. Approximately 1 hour.",
    "Meanwhile, combine the sugar and cinnamon for the filling.",
    "Toss the apples with the lemon juice in a small bowl.",
    "Add 1 Tbls of the sugar/cinnamon mixture to the apples and stir to combine.",
    "Once dough has risen, lightly flour a large cutting board. Punch down down and roll out to approximately 12 x 16 inches.",
    "Spread on the melted butter and sprinkle the sugar and cinnamon mixture. Next sprinkle on the apples.",
    "Melt the caramel bits and milk in the microwave in 30 second intervals until fully melted. (Follow package directions.)",
    "Drizzle on top of apples.",
    "Starting on a long side, roll up the dough up into a cylinder and pinch the edge to close. Cut the cylinder in half and then cut each half into six rolls for a total of 12 rolls.",
    "Butter a 9 x 13 baking dish (or two 8x8 dishes) and place rolls leaving a little room around each roll to allow for rising. Let the rolls rise for another hour or so and place in the refrigerator.",
    "{If baking now - do NOT put in refrigerator.}",
    "Remove from refrigerator and let rolls come to room temperature in a warm area.",
    "Preheat oven to 375 degrees. Bake rolls for 20-25 minutes until golden brown in color.",
    "While rolls are baking, prepare the caramel icing:",
    "Melt butter in a saucepan over low heat. Add the brown sugar and salt and stir until combined. Continue cooking over low heat for another 5 minutes or until sugar is dissolved, stirring constantly. Add the heavy whipping cream and stir to combine.",
    "Remove from heat and add vanilla.",
    "Whisk in the powdered sugar until nice and smooth.",
    "Remove rolls from oven and pour on icing immediately. Let cool slightly and serve."
  ],
  "ingredients": [
    "0",
    "4 1/2 tsp OR 2 packages of active dry yeast",
    "1/2 cup warm milk",
    "3 eggs",
    "2 teaspoons + 1/2 c sugar, divided",
    "1 1/2 tsp salt",
    "3-4 cups AP flour",
    "1/2 c unsalted butter, melted",
    "1/2 c butter, melted",
    "3/4 c brown sugar",
    "1/2 c sugar",
    "1 Tbls ground cinnamon",
    "1 1/2 c finely chopped apple (Granny Smith preferred)",
    "1 Tbls fresh lemon juice",
    "1 cup caramel bits",
    "1 Tbls milk",
    "1/2 cup butter",
    "1 cup brown sugar",
    "1/2 tsp salt",
    "1/3 cup heavy whipping cream",
    "2 tsp vanilla",
    "1 1/3 cups powdered sugar"
  ],
  "__v": 1
}