{
  "hash": "a03022ed542e5036e5f529f40e39b9003813169a",
  "title": "WEIGHT LOSS WONDER SOUP",
  "image": "https://homemadehooplah.com/wp-content/uploads/2016/03/weight-loss-wonder-soup-1-155x155.jpg",
  "href": "https://homemadehooplah.com/weight-loss-wonder-soup/",
  "extension": "Chrome",
  "firstAdded": "2018-08-15T05:55:01.452000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Start off by cutting up all the vegetables and separating them into three large bowls: onion and green pepper in the first bowl, tomatoes and celery in the second bowl, and cabbage in the last bowl.",
    "In a large skillet, heat olive oil over medium-high heat. Add onions and green peppers to pan, tossing to coat. Sautee veggies until water has cooked out and onions begin to brown. The length of time this takes will depend on your cooking unit and the size of your pan, but for me, it took about 35 minutes. Turn the veggies every 3 to 5 minutes while cooking to prevent sticking and to check the color. Once cooked, remove pan from heat.",
    "In a 12 quart stockpot, add the cabbage and water. Next, add the tomatoes and celery. Finish by adding the cooked onions and green peppers on top. Ingredients will likely be to be brim of the pot - this is okay. Do not stir soup yet.",
    "Heat the soup over medium-high until water begins to boil. By this point, the veggies should have cooked down some, giving you room to stir. Once veggies are mixed, reduce heat so soup is simmering and cook for 50-60 minutes, stirring occasionally.",
    "If desired, serve soup immediately. Store excess soup in a sealed container in the refrigerator for up to 5 days."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1/2 tsp olive oil optional",
    "4 large onions finely chopped (6-8 coups)",
    "2 green peppers diced (2-3 cups)",
    "3 large tomatoes roughly chopped (3-4 cups)",
    "1 bunch celery diced (3-4 cups)",
    "1 small cabbage chopped (10-12 cups)",
    "3 cup water or up to 5 cups for a more watery soup",
    "US Customary - Metric"
  ],
  "__v": 1
}