{
  "hash": "b8da919b4322881282264cbc78cccff987f7a048",
  "title": "Cheese, Onion and Potato Pie",
  "image": "http://www.lavenderandlovage.com/wp-content/uploads/2013/03/DSC_0065-600x423.jpg",
  "href": "http://www.lavenderandlovage.com/2013/03/say-cheese-cheese-onion-and-potato-pie-recipe-for-british-pie-week.html",
  "extension": "",
  "firstAdded": "2017-02-16T13:09:35.265000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Step 1\tPre-heat oven to 200C//Gas Mark 6. Grease a 20cm/8\" pie dish/tin.",
    "Step 2\tMix the grated cheese, grated onion, cream cheese, English mustard powder and cold mashed potato together, and make sure they are well combined. Add salt and freshly ground black pepper to taste and set to one side.",
    "Step 3\tRoll out three quarters of the pastry on a lightly floured surface, until it’s large enough to line the pie dish/tin, with a little excess that hangs over the edges.",
    "Step 4\tSpoon the cheese and potato filling into the lined pie dish.",
    "Step 5\tRoll the remaining pastry so it sits over the filling. Brush the edges of the pastry with the beaten egg, and then lay the pastry over the top. Nip the edges together and trim with a knife. Crimp the sides with your fingers or with a fork, and brush the top of the pie with some beaten egg.",
    "Step 6\tCut out decorative leaves, with any leftover pastry, or cut out the words \"say cheese\"! Brush with more egg and then place the pie on a baking sheet, and bake it for 30 to 35 minutes, or until golden brown. Leave the pie to rest for 5 minutes or so, and then cut it in slices to serve."
  ],
  "ingredients": [
    "0",
    "225g (8ozs) home-made shortcrust pastry (made with 225g flour and 115g fats)",
    "200g mature Cheddar cheese (grated)",
    "2 onions (peeled and grated)",
    "4 tablespoons cream cheese",
    "1 teaspoon English mustard powder",
    "6 to 8 tablespoons cold cooked mashed potatoes (or about 4 large potatoes, peeled, boiled and mashed)",
    "salt and freshly ground black pepper",
    "1 free-range egg (beaten)"
  ],
  "__v": 1
}