{
  "__v": 1,
  "directions": [
    "0",
    "Split the vanilla pod and scrape out the seeds with the tip of a small knife. Put the seeds in a pan with the pod, cream, milk and sugar, then gently bring to the boil, stirring until the sugar dissolves. Turn off the heat and leave for 10 minutes to infuse.",
    "Meanwhile, soak the gelatine leaves in a small bowl of cold water for 5 minutes. Squeeze out the excess water, then add the leaves to the hot cream mixture, stirring until dissolved.",
    "Rinse 6 x 150ml pudding moulds or ramekins with cold water and pour the pannacotta mixture in while the moulds are wet. Leave to cool, then chill for 3-4 hours until set.",
    "Meanwhile, make the lemon and rose petal syrup. Put the lemon juice, sugar, rosewater and 75ml water in a small pan. Bring to the boil, stirring until the sugar dissolves. Simmer until syrupy, then remove from the heat. Finely chop six of the outer rose petals and stir into the syrup. Leave to cool, then chill until ready to serve.",
    "Turn out each pannacotta onto a small plate (dip the bases of the moulds/ramekins in hot water for 5 seconds or so, if they stick). Spoon over the syrup and scatter with reserved rose petals."
  ],
  "firstAdded": "2014-06-26T11:37:07.738000",
  "hash": "08495a68dd3c834de957b857bf9855f52a3e0b51",
  "href": "http://www.deliciousmagazine.co.uk/recipes/the-perfect-pannacotta-recipe",
  "image": "http://www.deliciousmagazine.co.uk/images/recipes/5779/5779_1_296.jpg",
  "ingredients": [
    "0",
    "1 vanilla pod",
    "600ml double cream",
    "200ml whole milk",
    "175g caster sugar",
    "4 gelatine leaves (we like Costa)",
    "For the lemon and rose petal syrup:",
    "Juice of 2 small lemons (about 70ml)",
    "75g caster sugar",
    "2 tsp rosewater",
    "Petals from 1 organic pink rose"
  ],
  "keywords": [
    "vanilla",
    "pod",
    "double",
    "cream",
    "milk",
    "caster",
    "sugar",
    "gelatine",
    "leaves",
    "costa",
    "lemon",
    "rose",
    "petal",
    "syrup",
    "juice",
    "lemons",
    "rosewater",
    "petals",
    "organic",
    "pink"
  ],
  "title": "The perfect pannacotta recipe",
  "users": [
    null
  ]
}