{
  "hash": "7478525b61f87469f2968df64dd773bd522e2f88",
  "title": "Mexican Chocolate Churro Rounds",
  "image": "https://images.food52.com/hf7pxA1Jg1Genz6FUJKwX7VB_g4=/753x502/0a885890-7eb3-4d06-9abf-c827b99e28a2--2015-0715_churros_mark-weinberg_481.jpg",
  "href": "https://food52.com/recipes/37177-mexican-chocolate-churro-rounds",
  "extension": "Chrome",
  "firstAdded": "2018-01-02T17:08:38.584000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add the water, brown sugar, and butter to a pot. Bring to a boil over medium heat and then dump in the flour. Keep the pot on the heat and use a wooden spoon to stir quickly. Flour will clump together in pockets, so don’t be gentle!",
    "Remove the pot from the heat and allow it to cool slightly. Add the egg, vanilla, salt, and nutmeg and mix well. Allow to cool completely.",
    "Heat about 1/2 inch of oil in a deep saucepan until hot (flick a little droplet of water in there to see if it sizzles).",
    "Roll a few tablespoon-sized scoops of batter into balls (you might need to use a bit of additional flour if the batter is sticky). Flatten each ball between your hands, or with a flat spatula, until about 1/4-inch thick. Craggy edges are a-okay.",
    "Drop the flat rounds into the oil. Working in batches, fry rounds until browning and crisp, about 1 to 2 minutes per side. Don’t overcrowd the pan, but they don’t need a ton of room (I fried 3 at a time). Remove from oil and drain on a paper towel.",
    "Complete until all the dough is used, shaping and frying as you go.",
    "Whisk sugar, cinnamon, cayenne, and cocoa together in a shallow boll. While the fried dough is still hot, drop each fried puck all around in the bowl, shaking and turning to coat both sides with the spiced sugar. Yessss."
  ],
  "ingredients": [
    "0",
    "1 cup water",
    "2 tablespoons brown sugar",
    "1/3 cup butter",
    "1 cup flour, plus more as needed",
    "1 egg",
    "1 teaspoon vanilla extract",
    "pinch salt",
    "pinch nutmeg",
    "canola or vegetable oil, for frying",
    "1/4 cup sugar",
    "1/2 teaspoon cinnamon",
    "small shake of cayenne (a little goes a long way)",
    "regular shake of unsweetened cocoa powder (1/2 to 1 teaspoon)"
  ],
  "__v": 1
}