{
  "hash": "ec24e5c2651f11a0f8ef2361c56971e9681075e4",
  "title": "Crispy Hash Browns",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2008/04/crispy-hash-browns-vertical-a2-600-600x814.jpg",
  "href": "http://www.simplyrecipes.com/recipes/crispy_hash_browns/",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T21:58:02.793000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "canola",
    "rice",
    "bran",
    "oil",
    "russet",
    "baking",
    "potatoes",
    "salt",
    "pepper",
    "frying",
    "pan",
    "diameter",
    "potato",
    "ricer"
  ],
  "directions": [
    "0",
    "1 Peel the potatoes and grate them using the large holes of a box grater.",
    "2 Squeeze out as much moisture as you can from the grated potatoes. An easy way do this with a potato ricer, using it much like you would a garlic press, except you don't force the potatoes through the ricer. You just press out the moisture. Work in batches and only fill the ricer half-way with the raw grated potatoes.",
    "If you don't have a ricer, wrap the raw grated potatoes in a clean kitchen tea-towel and squeeze it until you have squeezed out as much moisture as you can. Work in batches to make it more manageable. Note that the potatoes can sometimes stain a cloth towel, so use one that you don't mind showing a bit of wear. You can also use sturdy paper towels to squeeze out the moisture, though they don't work as well as cloth or a ricer.",
    "3 Heat 3 Tbsp of oil in a large frying pan on medium high heat. When the oil in the pan heats up to the point of shimmering, but not smoking, add the grated potatoes, spreading them out along the bottom of the pan. The potatoes should not be too thick in any one place, a 1/4-inch to a 1/2-inch thick. Sprinkle some salt and pepper on the potatoes.",
    "After a few minutes, lift up one edge of the potatoes and see how done they are. If they have fried to a golden brown they are ready to flip. Use a large metal spatula (or two spatulas) to flip the potatoes over all at once, or divide the large potato cake into halves or quarters and flip. Continue to cook until they are golden brown on the bottom."
  ],
  "ingredients": [
    "0",
    "3 Tbsp olive oil, canola oil, or rice bran oil",
    "1 lb Russet baking potatoes",
    "Salt and pepper",
    "Large frying pan (at least a 9\" diameter bottom)",
    "Potato ricer"
  ],
  "__v": 1
}