{
  "hash": "bceb21f063583dd56d18a24c4a54a6c11b46930a",
  "title": "HAM AND CHEESE SLIDERS",
  "image": "",
  "href": "https://www.averiecooks.com/2016/08/ham-cheese-sliders.html",
  "extension": "Chrome",
  "firstAdded": "2017-05-22T17:55:09.711000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS:",
    "Preheat oven to 350F. Line a 9x9-inch or 9x13-inch pan with aluminum foil, spray with cooking spray; set aside.",
    "Using a large serrated knife, slice the rolls in half so you have a 'slab' of tops and a 'slab' of bottoms; don't pull the rolls apart and slice individually because you want to keep them connected. Place the bottom 'slab' of rolls in prepared pan.",
    "Evenly layer about half of the ham over the rolls.",
    "Evenly layer the cheese.",
    "Evenly layer the remaining ham.",
    "Add the top 'slab' of rolls; set aside.",
    "To a medium microwave-safe bowl, add the butter and heat on high power to melt, about 1 minute.",
    "Add the mustard, poppy seeds, onion, Worcestershire sauce, salt, pepper, and whisk to combine.",
    "Evenly and slowly pour the butter mixture over the rolls. Use a spatula to spread the mixture over the tops. Some of the mixture will pool at the base of the rolls.",
    "Cover with aluminum foil and allow rolls to stand at room temp for about 5 to 10 minutes.",
    "Bake covered for about 20 minutes or until cheese has melted.",
    "Uncover and cook for about 3 to 5 minutes, or until as done as desired. Baking time will vary based on the size of pan used, climate and oven variances, etc. Bake until as done as desired; watch to make sure they don't burn since all ovens and ingredients vary. Slice into individual sliders and serve immediately. Sliders are best warm and fresh."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "one 12-count package Hawaiian sweet rolls, sliced in half (see directions for more details)",
    "3/4 pound cooked deli ham, thinly sliced",
    "3/4 pound Swiss cheese, thinly sliced",
    "1/2 cup (1 stick) unsalted butter, melted",
    "1 tablespoon dijon mustard",
    "1 tablespoon poppy seeds",
    "2 teaspoons dried minced onion",
    "2 teaspoons Worcesteshire sauce",
    "1/4 teaspoon salt, or to taste",
    "1/4 teaspoon pepper, or to taste"
  ],
  "__v": 1
}