{
  "hash": "0b94b171922e5d8aabc52e6da98f14861ee8c5ae",
  "title": "Mozzarella Stick Stuffed Crust Pizza",
  "image": "",
  "href": "http://www.foodnetwork.com/recipes/food-network-kitchen/mozzarella-stick-stuffed-crust-pizza-3686808",
  "extension": "Chrome",
  "firstAdded": "2017-09-28T23:44:21.249000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Special equipment: a metal 8-by-8-inch baking pan",
    "Make with pasta.",
    "For the pizza: Put the pizza dough in a large bowl and coat with the oil. Cover the bowl with plastic wrap and let it sit in a warm place until slightly puffy and at room temperature, about 30 minutes.",
    "Spread the butter all over the inside of a metal 8-by-8-inch baking pan and put the dough in the middle. Starting from the middle of the dough, and using your fingertips, push the dough out to the corners of the pan and all the way up the sides.",
    "Make a pepperoni border (slightly overlapping the meat) around the bottom edge of the dough (about 8 pepperonis per side). Put 1 cheese stick on top of the pepperoni on each side, then fold down the dough from the edges of the pan to cover them. Push the dough with the pepperoni and cheese inside back tightly against the sides of the pan. Seal the dough around the pepperoni and cheese by pressing and pinching the dough together. You now have a stuffed crust. Cover the dough in the bottom of the pan (but not the crust) with the remaining pepperoni.",
    "Pull each of the remaining 4 cheese sticks into 4 long pieces. Put half the cheese pieces evenly on top of the crust along the edges of the dough so that they are touching the sides of the pan. Put the remaining cheese pieces over the pepperoni in the middle. Sprinkle the entire pizza with Parmesan. Cover with plastic wrap and keep in a warm place until puffy, about 30 minutes.",
    "Position an oven rack in the bottom third of the oven, put a baking sheet on the rack and preheat the oven to 500 degrees F. Put the pizza on the preheated baking sheet and bake until edges are dark golden and the cheese is melted and bubbling, 15 to 20 minutes.",
    "Meanwhile, make the meat sauce: Heat the oil in a small saucepan over medium-high heat until shimmering. Add the sausage and cook, breaking it up with a wooden spoon, until lightly browned, about 4 minutes. Add the garlic, bell pepper and onion and cook, stirring occasionally, until the moisture has evaporated from the pan and the onion is soft, about 3 minutes. Add the tomato paste, 3/4 cup water, a pinch each of red pepper flakes and salt and several grinds of black pepper. Bring to a simmer, reduce the heat to medium-low and cook, uncovered, stirring often, until thick, about 5 minutes.",
    "Remove the pizza from the oven and loosen the sides and bottoms from the pan with a metal spatula. Slide the pizza onto a cutting board and spoon the sauce in the center of the pizza. Sprinkle with more Parmesan and cut into squares for serving."
  ],
  "ingredients": [
    "0",
    "Pizza:",
    "1 pound refrigerated pizza dough",
    "2 tablespoons olive oil",
    "2 tablespoons unsalted butter, at room temperature",
    "60 slices pepperoni (from a 6-ounce package)",
    "8 mozzarella string cheese sticks (OR 4 sticks and shredded cheese)",
    "2 tablespoons grated Parmesan, plus more for serving",
    "Meat Sauce",
    "1 tablespoon olive oil",
    "1 sweet Italian sausage link, casing removed (about 1/4 pound)",
    "1 clove garlic, finely chopped",
    "Half a red bell pepper, finely chopped",
    "Half a small yellow onion, finely chopped",
    "1/4 cup tomato paste",
    "Pinch crushed red pepper flakes",
    "Kosher salt and freshly ground black pepper",
    "Note: Dairy (use non-meat ingredients), Meat (use non-dairy cheese)",
    "Pasta (1 box)"
  ],
  "__v": 4
}