{
  "hash": "8ded10534cdff6d5809127ca9ec73eece99a2157",
  "title": "Cinnamon Apple Pie with Raisins and Crumb Topping",
  "image": "",
  "href": "https://www.epicurious.com/recipes/food/views/cinnamon-apple-pie-with-raisins-and-crumb-topping-240118",
  "extension": "Chrome",
  "firstAdded": "2018-11-10T20:11:12.537000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For crust: Blend flour, sugar, salt, and baking powder in processor. Add butter; pulse until mixture resembles coarse meal. Mix 1/4 cup ice water and vinegar in small bowl; add to processor and pulse until moist clumps form, adding more ice water by teaspoonfuls if mixture is dry. Gather dough into ball; flatten into disk. Wrap in plastic and chill at least 1 hour. DO AHEAD: Can be made 1 day ahead. Keep chilled. Soften slightly at room temperature before rolling out. Roll out dough on floured work surface to 13-inch round. Transfer to 9-inch-diameter deep-dish glass pie dish. Fold edges under and crimp, forming crust sides 1/4 inch above rim of pie dish. Freeze crust 20 minutes.",
    "Blend flour, sugar, salt, and baking powder in processor. Add butter; pulse until mixture resembles coarse meal. Mix 1/4 cup ice water and vinegar in small bowl; add to processor and pulse until moist clumps form, adding more ice water by teaspoonfuls if mixture is dry. Gather dough into ball; flatten into disk. Wrap in plastic and chill at least 1 hour. DO AHEAD: Can be made 1 day ahead. Keep chilled. Soften slightly at room temperature before rolling out.",
    "Roll out dough on floured work surface to 13-inch round. Transfer to 9-inch-diameter deep-dish glass pie dish. Fold edges under and crimp, forming crust sides 1/4 inch above rim of pie dish. Freeze crust 20 minutes.",
    "For filling: Position rack in center of oven and preheat to 375°F. Mix brown sugar, flour, lemon peel, and cinnamon in large bowl. Add apple slices, raisins, and vanilla; toss until well coated. Transfer filling to unbaked crust, mounding filling slightly in center. Bake pie until apples begin to soften, about 40 minutes.",
    "Position rack in center of oven and preheat to 375°F. Mix brown sugar, flour, lemon peel, and cinnamon in large bowl. Add apple slices, raisins, and vanilla; toss until well coated. Transfer filling to unbaked crust, mounding filling slightly in center. Bake pie until apples begin to soften, about 40 minutes.",
    "Meanwhile, prepare crumb topping: Whisk flour, sugar, cinnamon, and salt in small bowl. Add butter and rub in with fingertips until mixture begins to clump together.",
    "Whisk flour, sugar, cinnamon, and salt in small bowl. Add butter and rub in with fingertips until mixture begins to clump together.",
    "Sprinkle topping evenly over hot pie. Continue to bake pie until apples are tender and topping is browned and crisp, tenting pie with sheet of foil if browning too quickly, about 50 minutes. Cool pie on rack at least 2 hours. DO AHEAD: Can be made 8 hours ahead. Let stand at room temperature. Cut pie into wedges and serve warm or at room temperature with whipped cream or vanilla ice cream.",
    "Sprinkle topping evenly over hot pie. Continue to bake pie until apples are tender and topping is browned and crisp, tenting pie with sheet of foil if browning too quickly, about 50 minutes. Cool pie on rack at least 2 hours. DO AHEAD: Can be made 8 hours ahead. Let stand at room temperature.",
    "Cut pie into wedges and serve warm or at room temperature with whipped cream or vanilla ice cream.",
    "GOOD TO KNOW: Don't skip that teaspoon of vinegar in the pie dough—it helps make the finished crust tender.",
    "Don't skip that teaspoon of vinegar in the pie dough—it helps make the finished crust tender."
  ],
  "ingredients": [
    "0",
    "Crust:1 1/2 cups all purpose flour1 tablespoon sugar1/2 teaspoon salt1/8 teaspoon baking powder1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes1/4 cup (or more) ice water1 teaspoon apple cider vinegar",
    "1 1/2 cups all purpose flour",
    "1 tablespoon sugar",
    "1/2 teaspoon salt",
    "1/8 teaspoon baking powder",
    "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
    "1/4 cup (or more) ice water",
    "1 teaspoon apple cider vinegar",
    "Filling:1 cup (packed) golden brown sugar3 tablespoons all purpose flour2 teaspoons finely grated lemon peel1 1/4 teaspoons ground cinnamon2 3/4 pounds Granny Smith apples (about 6 medium), peeled, halved, cored, cut into 1/8-inch-thick slices (about 8 cups)1 cup raisins2 teaspoons vanilla extract",
    "1 cup (packed) golden brown sugar",
    "3 tablespoons all purpose flour",
    "2 teaspoons finely grated lemon peel",
    "1 1/4 teaspoons ground cinnamon",
    "2 3/4 pounds Granny Smith apples (about 6 medium), peeled, halved, cored, cut into 1/8-inch-thick slices (about 8 cups)",
    "1 cup raisins",
    "2 teaspoons vanilla extract",
    "Crumb Topping:1 cup all purpose flour1/2 cup (packed) golden brown sugar1 teaspoon ground cinnamon1/8 teaspoon salt1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
    "1 cup all purpose flour",
    "1/2 cup (packed) golden brown sugar",
    "1 teaspoon ground cinnamon",
    "1/8 teaspoon salt",
    "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
    "Lightly sweetened whipped cream or vanilla ice cream",
    "Lightly sweetened whipped cream or vanilla ice cream"
  ],
  "__v": 1
}