{
  "hash": "3a9025d81e12153c04f99ee194f45288b43cf5cf",
  "title": "S'mores Ice Cream Cake Serves 10",
  "image": "",
  "href": "http://www.thekitchn.com/recipe-smores-ice-cream-cake-recipes-from-the-kitchn-207645",
  "extension": "Chrome",
  "firstAdded": "2017-08-18T02:52:45.679000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "3 cups chocolate ice cream, store-bought or homemade",
    "3 cups vanilla ice cream, store-bought or homemade",
    "12 whole graham crackers, broken into pieces for layering into the ice cream.",
    "To make the graham cracker crust: Combine all ingredients and press mixture into bottom and up the sides of an 8-inch springform pan. Transfer to oven and bake at 375°F for 7 to 9 minutes, or until crust deepens in color. Remove from oven and transfer to a wire rack to cool completely.",
    "To make the marshmallow topping: Place sugar and water into a saucepan with a candy thermometer attached to the side of the pan. Bring the mixture to a boil and cook until the syrup reaches 240°F; set aside.",
    "Place egg whites and cream of tartar in a stand mixer bowl fitted with a whisk attachment and beat on medium until soft peaks are formed. With the mixer still running, slowly drizzle syrup into egg mixture. Continue beating until stiff peaks form.",
    "Assembly: Using an ice cream scoop, randomly drop scoops of chocolate and vanilla ice cream over the graham cracker crust. Sprinkle and press in broken-up pieces of graham cracker. Continue to layer like this until the pan is filled. Transfer to freezer and chill until hardened, about two hours.",
    "Remove from freezer and spread marshmallow topping on top, then using a kitchen torch, toast marshmallow topping. Serve immediately.",
    "PRINT RECIPE",
    "SHOW NUTRITION",
    "MORE POSTS IN 50 THINGS YOU NEED TO EAT BY THE END OF SUMMER",
    "This Maine-Inspired Blueberry Milkshake Tastes Like Summer",
    "How To Make Sorbet with Any Fruit: The Video",
    "SHARE",
    "EMAIL",
    "KITCHNVIDEO OF THE DAY",
    "RECOMMENDED STORIES",
    "20 Ideas for Make-Ahead Lunches That Last the Week",
    "10 Cooks Share Their Favorite Things to Make in the Instant Pot",
    "Recipe: Zucchini-Chickpea Fritters with Red Onion Jam",
    "Make 46 Freezer Meals In 4 Hours",
    "Recommended by",
    "8 COMMENTS",
    "Brooklynnina",
    "3 years ago",
    "Oooooooh.... Haagen Dazs used to make a s'mores ice cream, and I just remembered how much I loved it. This cake looks awesome. I would almost consider making the \"laziest\" version of it, except I don't have a kitchen torch.",
    "FLAG",
    "REPLY",
    "Cyclokitty",
    "3 years ago",
    "I don't want to be a killjoy because home made ice cream is insanely delicious but it seems like a heck of a lot of work for what looks kind of like an ice box cake.",
    "I would use graham crackers, a pint of really delicious chocolate ice cream and another pint of vanilla ice cream, and a jar of fluff and assemble in a good sized pan. Freeze for a couple of hours, then hand a spoon to my partner, proceed demolishing.",
    "FLAG",
    "REPLY",
    "chocchic",
    "3 years ago",
    "I did note in the recipe that the jar of fluff wouldn't brown as well so if I were going to make the effort to make this would probably either make the marshmellow cream or use real marshmallows - what is missing to me in this recipe is chocolate - yeah I know there's chocolate ice cream but i would sneak a few dollops of hot fudge sauce into the layers of ice cream. Just sayin.....",
    "FLAG",
    "REPLY",
    "SHOW 5 MORE COMMENTS",
    "Join the Conversation!",
    "Enter your email to sign in or to create an account",
    "NEXT",
    "Need help? Click here.",
    "SPONSORED STORIES",
    "[Gallery] This Jet Can Swallow A 737 Whole Its So Huge",
    "HistoryInOrbit.com",
    "27 Highest Paying Jobs in 2017. Wow #13",
    "Life, Tailored",
    "The 20 Jobs That Have the Best Salaries",
    "Forbes",
    "When This Trucker Saw A Girl Behind The Curtain Of An RV, He Knew That Something Was Up",
    "Scribol",
    "Recommended by",
    "READ JUST ONE MORE",
    "Ready to cook?",
    "10 Sandwich-Free Lunch Ideas for Kids and Grownups Alike",
    "Creamy Corn & Basil Orzotto Is Summer Comfort Food",
    "You Should Pretty Much Always Buy Freezer Ziploc Bags",
    "3 Ideas for Turning Your Kitchen into a Command Center",
    "Pretzel Yogurt Bark Is Your New Favorite 4-Ingredient Snack",
    "10 Glorious Ways to Eat Your Weight in Melon",
    "The 5 Best Frozen Foods to Cook in Your Instant Pot",
    "This Easy Tomato Jam Is Like Garden-Fresh Ketchup",
    "10 Delicious Ways to Turn Tortillas into a Meal",
    "10 Wine Rules You Should Break Right Now",
    "Stop Leaving Plastic Water Bottles In Your Car",
    "Watch These Food Videos Inspired by Legendary Directors",
    "SUBMIT A STORY",
    "Got a tip, kitchen tour, or other story our readers should see?",
    "TELL US ABOUT IT!",
    "© 1994–2017 Apartment Therapy, LLC.",
    "ADVERTISE WITH US",
    "ABOUT",
    "CONTACT",
    "PRESS",
    "PRIVACY POLICY",
    "OUR TEAM",
    "JOBS",
    "SITE MAP",
    "Select Directions",
    "(note: you can drag this box around to make it easier to highlight the recipe)",
    "Please highlight the directions for this recipe and click \"Next\""
  ],
  "ingredients": [
    "0",
    "4 cups graham cracker crumbs",
    "1/2 cup sugar",
    "10 tablespoons unsalted butter, melted",
    "For the marshmallow topping:",
    "1 cup sugar",
    "1/2 cup water",
    "4 large egg whites",
    "1/2 teaspoon cream of tartar",
    "For assembly:",
    "3 cups chocolate ice cream, store-bought or homemade",
    "3 cups vanilla ice cream, store-bought or homemade"
  ],
  "__v": 1
}