{
  "hash": "92c66f0b5e5152dad1befb814b75f3f367dbf8d1",
  "title": "STICKY SESAME CAULIFLOWER WINGS",
  "image": "http://cf.jessicainthekitchen.com/wp-content/uploads/2016/01/These-Sticky-Spicy-Sesame-Cauliflower-Wings-are-the-best-veggie-wings-Ive-ever-had-Loaded-with-a-maple-sesame-flavor-and-spice-they-are-the-perfect-game-day-snack-for-vegans.jpg",
  "href": "http://jessicainthekitchen.com/sticky-sesame-cauliflower-wings/",
  "extension": "",
  "firstAdded": "2016-08-26T21:45:17.713000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Preheat oven to 450 degrees.",
    "Prepare a baking sheet by lining it with a silicone baking sheet or foil.",
    "Remove florets from the cauliflower (aka don't use the stem).",
    "Chop the cauliflower into smaller pieces to resemble the size of wings.",
    "In a separate bowl, whisk all the batter ingredients together EXCEPT the bread crumbs. Place the bread crumbs in a bowl. Line it up beside the batter bowl.",
    "Toss the cauliflower in the mixture one at a time, shaking off excess batter. Then, dip the cauliflower into the breadcrumbs to coat, then place onto the baking sheet. Repeat until all of the wings are coated.",
    "Bake for 22 minutes.",
    "While baking, prepare the ingredients for the sauce by whisking together.",
    "Remove from oven. You can stop here, and serve the wings sauceless with sauce on the side. The wings will be crispy this way. Alternatively, coat the wings in the sauce. With a pastry brush, brush the sauce onto the wings. Bake for another 5 minutes for the sauce to soak into the wings.",
    "Remove from oven and serve immediately. Enjoy!",
    "Notes",
    "1. Either way tastes great, sauce or sauceless, it's your choice!",
    "2. Don't use olive oil to grease the baking sheet since it will burn the bottom of your wings.",
    "3. The batter will only adhere to the cauliflower wings dry. So, if for any reason you wet your cauliflower, it has to be 100% dry for the batter to stick."
  ],
  "ingredients": [
    "0",
    "1 small head cauliflower",
    "1/2 cup AP gluten free flour*",
    "1/2 cup almond milk",
    "1/2 teaspoon salt",
    "1 teaspoon ground black pepper",
    "1/2 teaspoon garlic powder",
    "1/2 teaspoon crushed red pepper flakes",
    "1 cup gluten free bread crumbs (seasoned with salt and pepper)",
    "3-4 tablespoons maple syrup",
    "4 tablespoons liquid aminos",
    "3 teaspoons sesame seeds",
    "1/4 teaspoon ground black pepper",
    "2 teaspoons ground ginger"
  ],
  "__v": 1
}