{
  "hash": "3ce236517bac367478955a9bfd178e0838ccb5f6",
  "title": "Кролик, тушенный в сметане",
  "image": "http://gotovim-doma.ru/img/img1092_1.jpg",
  "href": "http://gotovim-doma.ru/view.php?r=1092-recept-Krolik-tushennyi-v-smetane",
  "extension": "Chrome",
  "firstAdded": "2016-01-06T14:56:19.427000",
  "users": [
    null
  ],
  "keywords": [],
  "directions": [
    "0",
    "Потрошка вынуть из брюшка кролика и использовать для других блюд.",
    "Кролика вымыть, обсушить и разрезать на порционные куски.",
    "Лук очистить и нарезать четвертькольцами.",
    "Чеснок очистить и мелко порубить.",
    "В сотейнике или толстостенной кастрюле разогреть сливочное масло вместе с растительным.",
    "Выложить куски кролика и обжарить с двух сторон до золотистого цвета.",
    "Чтобы мясо кролика при обжарке приобрело золотистую поджаристую корочку, его нужно обжаривать порциями.",
    "Обжаренное мясо переложить в чистую миску или кастрюлю и держать в тепле.",
    "Совет. По желанию, мясо можно предварительно не обжаривать.",
    "В сотейник, где жарился кролик, выложить лук, немного посолить и обжарить 1-2 минуты.",
    "Влить вино и выпарить его около 7-10 минут.",
    "Добавить рубленый чеснок, тимьян и розовый перец (или свежемолотую смесь перцев).",
    "Добавить сметану и перемешать.",
    "Влить 200-300 мл бульона или воды, посолить и перемешать.",
    "Выложить куски кролика (желательно, чтобы жидкость практически покрывала мясо).",
    "Довести до кипения, накрыть сотейник крышкой или фольгой.",
    "Поставить сотейник с кроликом в разогретую до 180°C духовку на 1,5-2 часа (или тушить на минимальном огне на плите).",
    "Готовому блюду дать настояться около 20 минут и подавать с картофельным пюре, рисом или другим гарниром.",
    "При подаче посыпать свежей зеленью."
  ],
  "ingredients": [
    "0",
    "Состав",
    "тушка кролика (1-1,5 кг),",
    "сметана - 250-300 г,",
    "белое сухое вино - 100-200 мл (по желанию),",
    "лук репчатый - 2 шт,",
    "чеснок - 3 зубчика,",
    "бульон (из кролика или курицы) или вода - 200-300 мл,",
    "растительное масло - 3 столовых ложки,",
    "сливочное масло - 3 столовых ложки,",
    "тимьян (по желанию),",
    "соль,",
    "розовый перец или свежемолотая смесь 4-х перцев"
  ],
  "__v": 1
}