{
  "hash": "0c55a0058ee1b8ee668caa6be6f62c3cf4d36a2b",
  "title": "Instant Pot Chicken and Rice",
  "image": "https://www.apinchofhealthy.com/wp-content/uploads/2016/11/Instant-Pot-Chicken-and-Rice-stirred.jpg",
  "href": "https://www.apinchofhealthy.com/instant-pot-chicken-rice/",
  "extension": "Firefox",
  "firstAdded": "2018-04-09T02:16:51.733000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Using the sauté setting, preheat on normal for 1.5 minutes",
    "Generously salt and pepper your chicken thighs.",
    "Use tongs to put chicken in the pan (watch out for oil splatter!)",
    "Sear chicken thighs, 5 min on side one, season the opposite side and 3 min on side 2 (pan will be hotter)",
    "Chicken will render a little fat, but you can add a little more oil if you want to",
    "Remove and set aside chicken on a plate",
    "Add 1/3 cup broth to deglaze the pan, scrape the bits with a wooden spoon (do not skip this step!). If there are any stuck on spots, be sure and lift those away from the pan with a wooden spoon.",
    "Add shallot, mushroom and carrots, and cook for 3 minutes.",
    "Add garlic, and continue to cook for another minute.",
    "Add remaining 1 and ½ cups of chicken stock, rice, thyme and stir together.",
    "Place the chicken thighs on top of the mixture.",
    "Place the lid on, and lock it, setting the valve to sealing.",
    "Cook on manual high pressure for 10 minutes, and allow the Instant Pot to release naturally (do not use the quick release lever, but let the pressure indicator lower on its own. (mine took 18 minutes, FYI)",
    "Switch the valve release, and remove the lid carefully.",
    "Use two forks to shred the chicken, and stir the pot.",
    "Serve immediately.",
    "Recipe Notes",
    "Do NOT skip rinsing the rice first! This will remove some of the starch, and will prevent scorching/ sticking to the bottom."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 pound boneless skinless chicken thighs",
    "1 Tablespoons oil (I used avocado oil)",
    "3 small shallots diced",
    "3 carrots diced",
    "1 cup sliced mushrooms",
    "2 cloves medium fresh garlic minced",
    "1.5 cups uncooked white jasmine rice rinsed and drained (Do NOT skip the rinsing. Rice will likely scorch if not rinsed!)",
    "1.5 cups chicken stock or broth plus another 1/3 cup for deglazing the pan",
    "2 Tablespoons fresh thyme leaves chopped and divided (or 2 teaspoons dried)",
    "salt and pepper to taste"
  ],
  "__v": 1
}