{
  "hash": "9ed3744cc1ef09692829aab9d35036a40fdfd921",
  "title": "Chicken Curry (tastes like Tandoori Chicken)",
  "image": "",
  "href": "http://instantpot.com/chicken-curry-tastes-like-tandoori-chicken/",
  "extension": "Chrome",
  "firstAdded": "2016-09-21T18:03:27.060000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Mix the marinade ingredients then smear all over the chicken. Cover and keep in refrigerator for 15 minutes to an hour.",
    "Note* I rub the marinade mixture all over the chicken and then put into a vacuum seal bag and vacuum seal on moist setting. Then I put in the refrigerator for an hour. This does a really good job of marinating the chicken.",
    "2) While the chicken is marinating, chop the onion, measure out the spices and chop the tomatoes.",
    "Heat oil in InstantPot on Sauté setting.",
    "3) Add coriander seeds to heat and let some of them pop. Then add onion and sauté, until they turn translucent.",
    "4) Add ginger and garlic powder, garam masala, coriander powder and chili powder and sauté for a minute.",
    "5) Add tomatoes and cook, until they become soft.",
    "6) Add chicken pieces and sauté for a minute.",
    "7) Add 1/2 cup of water and salt. (No water required for boneless chicken)",
    "8) Put lid on and set to chicken setting and adjust to 10-15 minutes. If using boneless chicken you can cook for about 8 minutes.",
    "9) Place chicken on plate, spoon up the tomatoes and onions, and sprinkle with cilantro. Serve with Chipotle style rice."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1 Chicken (cut up or you can use boneless chicken breasts and thighs)",
    "1 tsp. Coriander seeds",
    "1 Yellow onion (Spanish)",
    "1 tsp. Fresh grated ginger",
    "1 tsp. Garlic powder (or fresh garlic)",
    "2 tsp. Garam Masala powder",
    "1 tsp. Chili powder",
    "1 or 2 chopped Tomato",
    "2 tbsp. Oil",
    "Salt to taste",
    "Cilantro leaves for garnishing",
    "Marinade:",
    "1 ¼ to 2 tsp. Chili powder (depending how hot your chili powder is and how hot you want the dish)",
    "1/2 tsp. Turmeric powder",
    "2 tsp. Ginger powder (or fresh grated ginger)",
    "2 tsp. Garlic powder",
    "2 tsp. Coriander powder",
    "Juice of 1 whole lemon",
    "Salt to taste"
  ],
  "__v": 1
}