{
  "hash": "15d463001fc682b403891670784260532da262d2",
  "title": "Carb Free Cloud BreadCloud Biscuits Gluten Free",
  "image": "http://img.sndimg.com/food/image/upload/w_555,h_416,c_fit,fl_progressive,q_95/v1/img/recipes/41/15/01/picDLxt6x.jpg",
  "href": "http://www.food.com/recipe/carb-free-cloud-bread-411501",
  "extension": "Chrome",
  "firstAdded": "2016-01-25T17:31:37.074000",
  "users": [
    null
  ],
  "keywords": [
    "eggs",
    "separated",
    "milk",
    "cottage",
    "cream",
    "cheese",
    "tartar",
    "artificial",
    "sweetener"
  ],
  "directions": [
    "0",
    "Preheat oven to 300 degrees.",
    "Separate the eggs very carefully, there must be no yolk in the white.",
    "In one bowl, mix together the egg yolks, the 3 T. of Cottage Cheese OR Cream Cheese and the one packet of Sweetener until smooth.",
    "In the other bowl add 1/4 teaspoon of Cream of Tartar to the whites and beat the whites on high speed until they are fluffy and form nice peaks.",
    "Spray two cookie sheets with Pam or other fat-free cooking spray.",
    "With a large spoon, \"scoop\" the mixture into 10 even rounds on the sheets (about the size of the top-half of the McDonalds hamburger bun; roughly 3/4 inch thick and 4 to 5 inches across).",
    "Bake on the middle rack. Here is when you have to watch them, because the cooking time the same on any two batches. It is somewhere around 1/2 hour, but it could be less or more. You just need to watch them until them become nice and golden brown (again, the color of a McDonalds bun).",
    "Remove from the pans and cool on a rack or cutting board.",
    "While warm they are crumbly and similar to cooked meringue - but don't let this fool you! Once completely cool, seal them in a ziplock storage baggie or a tupperware over night. They will totally change their consistency, to something much more like bread - a softer texture that is nice and chewy. If you do not like softer chewy bread, then eat them as they are, nice and crisp.",
    "Since the sides that were facing the pan are perfectly flat, you use these to spread things on, or make sandwiches, or even as a burger bun! The choice is up to you, and you will be quite amazed at how much like a bun these really are!"
  ],
  "ingredients": [
    "0",
    "3 eggs, separated",
    "3 tablespoons whole milk cottage cheese or 3 tablespoons cream cheese",
    "1⁄4 teaspoon cream of tartar",
    "1 (1 g) packet artificial sweetener"
  ],
  "__v": 3
}