{
  "__v": 4,
  "directions": [
    "0",
    "But first, we have some pro tips to get your smoothie-making off to an award-winning start:",
    "Make sure to pour in liquids first (it’s easier on the blender).",
    "Start from the lowest speed and work up to higher speeds once the mixture smoothes out. Add ice last, and use as much or as little as you’d like. We suggest three cubes for each smoothie, but it’s perfectly okay to add more and make it a little slushier to achieve a creamier texture.",
    "Some of our smoothies use cow’s milk, or dairy free subs like almond, soy, hemp, and rice. Pick your favorite, or make a mixture of your own!",
    "If you’ve got leftover smoothie hanging in the blender, divvy it up into an ice cube tray for easy blending the next time.",
    "Top smoothies with fresh fruit, seeds, chopped nuts, or shredded coconut for a texture change.",
    "Freeze fruit for a thicker consistency. Chop it up for easier blending.",
    "If you’d rather not sip it, try your smoothie from a bowl, with a spoon.",
    "Now it’s time to get blending!"
  ],
  "firstAdded": "2014-08-07T10:38:39.879000",
  "hash": "f30ee4a7b3ada5af353a19139231f0cd71a203a7",
  "href": "http://greatist.com/health/healthy-smoothie-recipes",
  "image": "http://greatist.com/sites/default/files/styles/article-content-732/public/wp-content/uploads/2012/06/Incredible-Hulk-Smoothie_featured_0.jpg?itok=0ytASlbc",
  "ingredients": [
    "0",
    "It’s darn near impossible to screw up a smoothie (fine, avoid the anchovies). Throw any combination of milk, fruit, nuts, and other goodies into a blender and presto, you’ve got a handy-dandy drinkable snack.",
    "The beauty of these five-minute recipes is that there’s free reign with ingredient amounts. And if the fridge or pantry isn’t fully stocked with each, it’s easy to pull together a winning combination by popping just a few things in the blender.",
    "We’ve rounded up 54 of our favorite smoothie recipes to sip pre-and-post workout, plus dairy-free varieties, ones loaded with greens, and others perfect for breakfast and dessert.",
    "*All recipes serve one."
  ],
  "keywords": [
    "darn",
    "near",
    "impossible",
    "screw",
    "smoothie",
    "avoid",
    "anchovies",
    "throw",
    "combination",
    "milk",
    "fruit",
    "nuts",
    "goodies",
    "blender",
    "presto",
    "youve",
    "handydandy",
    "drinkable",
    "snack",
    "beauty",
    "fiveminute",
    "recipes",
    "theres",
    "free",
    "reign",
    "ingredient",
    "amounts",
    "fridge",
    "pantry",
    "isnt",
    "fully",
    "stocked",
    "easy",
    "pull",
    "winning",
    "popping",
    "things",
    "weve",
    "rounded",
    "favorite",
    "sip",
    "preandpost",
    "workout",
    "dairyfree",
    "varieties",
    "ones",
    "loaded",
    "greens",
    "perfect",
    "breakfast",
    "dessert",
    "serve"
  ],
  "title": "54 Healthy Smoothies for Any Occasion",
  "users": [
    null
  ]
}