{
  "__v": 1,
  "directions": [
    "0",
    "Preheat an oven to about 350 degrees F.",
    "Combine first ten ingredients in a large bowl. Using your hands, take a scoop of the crab mixture and form it into a patty that is approximately 2 inches across and 3/4 inches thick. For appetizer size, you can make the patties smaller and thinner, which will yield more cakes.",
    "Continue until you’ve made about 12 large or 20 small crab cake patties. If the mixture feels sticky, dust the sides with additional breadcrumbs.",
    "Heat a large skillet or frying pan over medium-high heat and coat the bottom of the pan with canola oil (about two tablespoons). Place the crab cakes in the pan in one layer and cook until golden brown, about 2 minutes on each side. Transfer to a baking sheet. Repeat with remaining patties and the bake crab cakes in 350 degree oven for about eight minutes or until evenly browned. Serve immediately."
  ],
  "firstAdded": "2014-03-09T23:40:54.347000",
  "hash": "1cc76e0d331278edb74ebb3a06ada320ffd4a50b",
  "href": "http://ingoodtasteblog.net/in_good_taste/2011/08/impromptu-dinner-party-recipe-crab-cakes-with-spicy-remoulade.html",
  "image": "",
  "ingredients": [
    "0",
    "1 pound lump crab meat, drained, shell fragments removed",
    "1 bell pepper, diced (red, green, yellow or a combination of any of the three)",
    "1 egg",
    "1 tablespoon Worcestershire sauce",
    "1/2 cup Panko breadcrumbs",
    "1 tablespoon lemon juice (about 1/2 large lemon)",
    "2 green onions, white and green parts, finely diced",
    "1 teaspoon garlic powder",
    "1 teaspoon onion powder",
    "1 tablespoon Dijon mustard",
    "Canola oil, as needed"
  ],
  "keywords": [
    "lump",
    "crab",
    "meat",
    "shell",
    "fragments",
    "bell",
    "pepper",
    "red",
    "green",
    "yellow",
    "combination",
    "egg",
    "worcestershire",
    "panko",
    "breadcrumbs",
    "juice",
    "lemon",
    "onions",
    "white",
    "parts",
    "garlic",
    "onion",
    "dijon",
    "mustard",
    "canola",
    "oil",
    "needed"
  ],
  "title": "Crab Cakes",
  "users": [
    null
  ]
}