{
  "hash": "6695af74c1fffd3cb0f1934d9942da4cb6deb3d9",
  "title": "CURRIED CAULIFLOWER, GRAPE, & LENTIL SALAD",
  "image": "https://minimalistbaker.com/wp-content/uploads/2018/02/HEALTHY-Kale-Salad-with-Grapes-Lentils-and-Curry-Roasted-Cauliflower-A-delicious-easy-to-make-meal-vegan-glutenfree-salad-plantbased-minimalistbaker-5.jpg",
  "href": "https://minimalistbaker.com/curried-cauliflower-grape-lentil-salad/",
  "extension": "",
  "firstAdded": "2018-04-30T16:33:30.490000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees F (204 C). Line a baking sheet with parchment paper.",
    "Add cauliflower to mixing bowl and toss with coconut oil (or water), curry powder, and sea salt. Transfer to baking sheet and roast cauliflower for 20-25 minutes or until golden brown and tender.",
    "Prepare dressing by adding green curry paste, tahini, lemon juice, maple syrup, salt, and pepper to a mixing bowl and whisking to combine. If needed, thin with water until pourable.",
    "Taste and adjust flavor as needed, adding more green curry paste for a stronger curry flavor, tahini for greater thickness, lemon juice for acidity, or maple syrup for sweetness.",
    "Assemble salad by adding lettuce to a serving platter or bowl. Top with lentils, grapes, and cooked cauliflower and serve with dressing. Optional: garnish with fresh cilantro.",
    "Best served fresh. Store leftovers in airtight container for 3-4 days. Store dressing separately for up to 1 week."
  ],
  "ingredients": [
    "0",
    "CAULIFLOWER",
    "1 head (588 g) cauliflower, divided into florets",
    "1 1/2 Tbsp (22 ml) melted coconut oil (or water)",
    "1 1/2 Tbsp (10 g) curry powder (or store-bought)",
    "1/4 tsp sea salt",
    "GREEN CURRY TAHINI DRESSING*",
    "4 1/2 Tbsp (68 g) green curry paste (or store-bought, though fresh is best)",
    "2 Tbsp (30 g) tahini",
    "2 Tbsp (30 ml) lemon juice",
    "1 Tbsp (15 ml) maple syrup",
    "Pinch each salt and black pepper",
    "Water to thin",
    "SALAD",
    "5-6 cups (180-216 g) mixed greens, kale, spinach (or other green of choice)",
    "1 cup (198 g) cooked lentils, rinsed and drained",
    "1 cup (92 g) red or green grapes, halved",
    "optional: Fresh cilantro"
  ],
  "__v": 1
}