{
  "hash": "a1ea87eb73d4835584b7a9f0714c2d5cffe94ae5",
  "title": "Vegan Paprika Cheese Without Nuts or Soy! [Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/05/Screen-Shot-2015-05-06-at-1.36.13-PM.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/paprika-cheese/",
  "extension": "Chrome",
  "firstAdded": "2015-05-13T07:32:53.410000",
  "users": [
    null
  ],
  "keywords": [
    "water",
    "oats",
    "potato",
    "steamed",
    "soft",
    "roasted",
    "red",
    "peppers",
    "marinated",
    "vinegar",
    "nutritional",
    "yeast",
    "smoked",
    "paprika",
    "celtic",
    "salt",
    "white",
    "pepper",
    "onion",
    "garlic",
    "lemon",
    "juice",
    "extra",
    "mixture",
    "blender",
    "spices",
    "herbs",
    "agar"
  ],
  "directions": [
    "0",
    "Firstly, you will need a reasonably powerful blender or food processor to handle the main ingredients",
    "Add all the cheese ingredients to your blender/processor in order so that there is water at the bottom and top of the ingredient pile. This will help the mixture start to process.",
    "Blend the ingredients until you have a nice smooth cheesy mixture. Have a quick taste test and add extra spice or salt as required.",
    "Put the cheese mixture aside for a few minutes while you prepare the Agar Agar.",
    "In a medium size saucepan add both the water and Agar Agar powder.",
    "Bring the mixture to the boil whilst constantly stirring, then turndown the heat to low and keep stirring until the mixture has a thick molasses type of consistency (see video).",
    "Once the Agar Agar mixture is ready, quickly transfer it to the cheese mixture in your blender/processor and blend for about 30 seconds to ensure the mixture is homogenous.",
    "Pour the mixture into your favourite cheese mould(s). I used plastic containers in the video, but you can use shallow bowls, cups, quick release cake tins etc.",
    "Settle the mixture in your mould(s) as best you can so that the top surface is as flat as possible. This will help the cheese sit flat when you turn it out. If necessary, use a spatula to spread the cheese mixture.",
    "Pop your mould(s) into the fridge for approximately 30 minutes to set then carefully turn out the cheese onto your favourite serving platter! We served ours with crackers, olives and pickled chilli – Yum!"
  ],
  "ingredients": [
    "0",
    "1 cup water",
    "1 cup oats",
    "1 cup sweet potato, steamed until soft",
    "1 whole roasted red peppers, marinated in vinegar",
    "0.5 cup nutritional yeast",
    "1 tbsp smoked paprika",
    "2.5 tsp celtic sea salt",
    "0.5 tsp white pepper",
    "1 tsp onion powder",
    "1 tsp garlic powder",
    "2 tbsp lemon juice",
    "1 cup water extra for over top of mixture in blender… you can also add any other spices, herbs etc that you like.",
    "1",
    "1.3 cups water",
    "2.5 tbsp agar agar powder"
  ],
  "__v": 1
}