{
  "__v": 1,
  "directions": [
    "0",
    "Fill a large pot with water and bring to a boil over a high flame.",
    "While waiting for the water to boil, begin the tomato sauce in a separate skillet. Mince a clove of garlic and combine it with the olive oil, basil, oregano, salt, rosemary, thyme, crushed red pepper, and cracked black pepper. Heat over a medium flame. Stir the mixture and allow it to start sizzling. Stir and sizzle for about one minute.",
    "Add the tomato paste, turn the heat down to medium-low, and continue to cook and stir until the mixture turns a darker shade of red (about 2 minutes more). Turn off the heat and then stir in the honey.",
    "When the water begins to boil hard, add the spaghetti. Cook for 7-10 minutes or until tender. Once the pasta is tender, drain briefly and then add it to the skillet with the tomato sauce. Stir to coat. (Reserve about ½ cup of the starchy pasta cooking water to add back into the pasta if it becomes dry while mixing with the tomato sauce).",
    "Crumble about 2 ounces of feta cheese into the skillet and stir to combine. Divide the pasta onto individual plates and crumble about a ¼ ounce more of feta over top of each serving. Enjoy!"
  ],
  "firstAdded": "2014-11-14T14:21:01.507000",
  "hash": "a5f06b02ac79e4c82c451af80abc0173efb98e35",
  "href": "http://www.budgetbytes.com/2012/09/tangy-tomato-pasta/",
  "image": "https://lh4.googleusercontent.com/-F0iYRslazaI/UFO6BZF3kbI/AAAAAAAAIBM/tj_8DW7OCM0/s640/Tangy+Tomato+Pasta+close.jpg",
  "ingredients": [
    "0",
    "8 oz. thin spaghetti $0.97",
    "3 Tbsp olive oil $0.36",
    "1 clove garlic $0.08",
    "½ tsp dried basil $0.03",
    "½ tsp dried oregano $0.03",
    "½ tsp salt $0.02",
    "¼ tsp dried rosemary $0.02",
    "¼ tsp dried thyme $0.02",
    "a pinch crushed red pepper $0.02",
    "a few cranks pepper mill $0.02",
    "3 oz. tomato paste $0.26",
    "½ tsp honey $0.02",
    "3 oz. feta cheese $1.31"
  ],
  "keywords": [
    "spaghetti",
    "olive",
    "oil",
    "clove",
    "garlic",
    "basil",
    "oregano",
    "salt",
    "rosemary",
    "thyme",
    "red",
    "pepper",
    "cranks",
    "tomato",
    "honey",
    "feta",
    "cheese"
  ],
  "title": "tangy tomato pasta",
  "users": [
    null
  ]
}