{
  "hash": "8ee3ccbc6d1d1ba27105ffa6340e5012e16f191c",
  "title": "BAKED RIGATONI WITH TOMATO SAUCE, MEATBALLS, AND EGGS",
  "image": "",
  "href": "http://lidiasitaly.com/recipes/baked-rigatoni-tomato-sauce-meatballs-eggs/",
  "extension": "Chrome",
  "firstAdded": "2018-02-28T16:24:09.775000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 425 degrees. Bring a large pot of salted water to boil for pasta. Add the onion, carrot, celery, parsley, and garlic to the bowl of a food processor and process to make a smooth paste, or pestata.",
    "Heat a large Dutch oven over medium-high heat. Add the olive oil. When the oil is hot, add about two-thirds of the pestata and cook, stirring occasionally, until the pestata dries out and sticks to the bottom of the pot, about 4 to 5 minutes. Add the tomatoes, red pepper flakes, salt, and 1½ cups pasta water. Bring to a simmer.",
    "Meanwhile, in a large bowl, combine the sausage, raw egg, breadcrumbs, and ¼ cup each Pecorino and Grana Padano. Mix well with your hands and form into about 30 (1-inch) meatballs. Add the meatballs to the sauce and simmer until the sauce is thick and flavorful and the meatballs are cooked through, about 20 minutes.",
    "When the sauce is almost ready, add the pasta to the pasta water. Remove half of the sauce and meatballs to another container and reserve for another time. When the pasta is al dente, transfer it to the simmering sauce, drizzle with olive oil, and toss to coat with the sauce.",
    "Spread half of the pasta and meatballs into a 9-by-13-inch baking dish. Cover with the hard-boiled egg slices in an even layer. Sprinkle with half of the remaining Pecorino and Grana Padano, half of the Caciocavallo, and all of the sopressata. Spread the remaining pasta and meatballs over top. Sprinkle with the remaining grated Caciocavallo, Pecorino, and Grana Padano. Bake, uncovered, until browned and bubbly, about 20 to 25 minutes."
  ],
  "ingredients": [
    "0",
    "1 small onion, roughly chopped",
    "1 small carrot, roughly chopped",
    "1 celery stalk, roughly chopped",
    "1 cup loosely packed fresh Italian parsley leaves",
    "4 cloves garlic, crushed and peeled",
    "2 tablespoons extra-virgin olive oil, plus more for drizzling",
    "2 (28-ounce) cans whole San Marzano tomatoes, crushed by hand",
    "¼ to ½ teaspoon crushed red pepper flakes",
    "½ teaspoon kosher salt",
    "1 pound sweet Italian sausage, removed from casings",
    "1 large egg",
    "¾ cup fine dry breadcrumbs",
    "½ cup freshly grated Pecorino",
    "½ cup freshly grated Grana Padano",
    "1 pound rigatoni",
    "3 hard-boiled eggs, peeled and sliced",
    "2 ounces sliced spicy sopressata, cut into strips",
    "3 cups freshly grated Caciocavallo"
  ],
  "__v": 1
}