{
  "hash": "dc06cbcb95b369ede107fc979c5114cfac32ffb7",
  "title": "Sheet Pan Dinner",
  "image": "http://images.meredith.com/content/dam/bhg/Images/2016/2/24/RU277908.jpg.rendition.largest.ss.jpg",
  "href": "http://www.bhg.com/recipe/make-it-mine-sheet-pan-dinner/?utm_source=facebook&utm_medium=social&utm_campaign=bhg_514527024",
  "extension": "Chrome",
  "firstAdded": "2016-07-15T17:08:04.356000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 425 degrees F. Line a 15x10-inch baking pan with foil. Brush meat with 1 teaspoon oil. Using your fingers, spread Rub over meat. Place in prepared baking pan.",
    "Place Vegetables in a large bowl. Drizzle with 1 tablespoon oil and sprinkle with salt and pepper; toss to coat. Arrange vegetables around meat in pan.",
    "Roast 25 to 30 minutes or until meat registers 145 degrees F and vegetables are tender (roast chicken 20 to 25 minutes or until 165 degrees F). Cover meat with foil; let stand 3 minutes. Slice meat. Serve with vegetables and, if desired, a Topper."
  ],
  "ingredients": [
    "0",
    "1 pound pork tenderloin, trimmed",
    "1 teaspoon olive oil",
    "6 cups VEGETABLES",
    "1 tablespoon olive oil",
    "1/2 teaspoon salt",
    "1/2 teaspoon black pepper",
    "RUB (PICK ONE)",
    "Greek: Stir together 2 tsp. dried oregano, crushed; 1 tsp. dried basil, crushed; 1/2 tsp. lemon-pepper seasoning; and 1/4 tsp. garlic powder.",
    "BBQ: Stir together 1 Tbsp. packed brown sugar, 2 tsp. chili powder, 1/2 tsp. smoked paprika, and 1/4 tsp. salt.",
    "Mustard-Thyme: Stir together 1 Tbsp. yellow mustard; 1 Tbsp. honey; 1/2 tsp. dried thyme; crushed; and 1/4 tsp. black pepper.",
    "Sweet 'n' Spicy: Stir together 1 Tbsp. packed brown sugar, 1/2 tsp. pumpkin pie spice, 1/2 tsp. orange zest, 1/4 tsp. salt, and 1/8 to 1/4 tsp. cayenne pepper.",
    "VEGETABLES (PICK A COMBINATION)",
    "1-inch pieces red potatoes, peeled sweet potatoes, or fingerling potatoes Whole tiny new potatoes 1-inch pieces peeled butternut or acorn squash 1-inch pieces summer squash 1/2-inch slices delicata squash 1-inch pieces sweet peppers 1/2-inch wedges red or yellow onion 1/2-inch wedges fennel Sliced carrots or peeled parsnips Brussels sprouts, halved if large Cauliflower florets Button or cremini mushrooms, halved Whole cherry or grape tomatoes Whole garlic cloves",
    "TOPPER (PICK ONE) (Optional)",
    "Basil pesto Lemon, lime, or orange wedges Barbecue sauce Plain Greek yogurt or tzatziki Light vinaigrette salad dressing"
  ],
  "__v": 4
}