{
  "hash": "e2a46ddccc45f9a4dfbfc7a0d642cafd27f88442",
  "title": "Pie Maker Cheesecake Brownies",
  "image": "https://mumcentral.com.au/wp-content/uploads/2020/02/Pie-maker-cheesecake-brownies-FI.jpg",
  "href": "https://mumcentral.com.au/pie-maker-cheesecake-brownie/",
  "extension": "Chrome",
  "firstAdded": "2020-04-03T00:41:12.887000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Combine the chocolate and butter in a medium saucepan over low heat. Cook, stirring for around five minutes until melted and smooth. Remove from the heat.",
    "Make the cheesecake dollops using an electric mixer. Beat together the cream cheese and sugar until smooth. Add in the egg yolk and the vanilla, beating well until combined. Spoon into a zip-lock bag and set aside.",
    "Next, add the caster and brown sugars to the saucepan of melted chocolate and butter. Whisk until combined. Whisk in the eggs. Sift the flour and cocoa over the top and fold in until just combined.",
    "Heat the pie warmer! Use a ¼ measuring cup to scoop the brownie mix into the pie warmer cavities. Snip the corner off the cheesecake zip-lock bag and dot the top of the brownie with the mixture. Use a toothpick to swirl it a little before adding a few raspberries on top.",
    "Close the lid and cook for six minutes before turning off the pie maker and letting them stand for two minutes. Gently remove and let them cool on a wire rack. Repeat for remaining mixtures. NOTE: All pie makers are different and cook times will vary. If they are too soft, cook for a little longer – but remember, you want them a little gooey in the middle.",
    "Serve your individual cheesecake brownies with a dusting of icing sugar and cream or ice cream if feeling particularly fancy. Deeeeeeelicious!"
  ],
  "ingredients": [
    "0",
    "180g butter, chopped",
    "300g dark chocolate, chopped",
    "1 cup brown sugar",
    "½ cup caster sugar",
    "4 eggs",
    "1/4 cup cocoa",
    "1½ cups plain flour",
    "½ cup frozen raspberries, thawed and drained"
  ],
  "__v": 1
}