{
  "hash": "e8546f435bbbf2c88636d953f68e2c0c0fc1e20a",
  "title": "Pork Medallions in Mushroom Marsala Sauce",
  "image": "http://www.finecooking.com/CMS/uploadedImages/Images/Cooking/Articles/Issues_61-70/fc64qd001-02_xlg.jpg",
  "href": "http://www.finecooking.com/recipes/pork-medallions-mushroom-marsala-sauce.aspx",
  "extension": "",
  "firstAdded": "2016-09-07T13:39:19.802000",
  "users": [
    null,
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Trim the tenderloins of silverskin and any excess fat. Cut the tenderloins into 2-inch-thick medallions. Flip each medallion onto a cut side and press down with the palm of your hand to flatten slightly. Season the meat with 3/4 tsp. salt and 1/4 tsp. black pepper.",
    "Heat the olive oil and 1 Tbs. of the butter in a large sauté pan over high heat. When the butter is melted and foaming, add half of the meat and sear until nicely browned, 2 to 3 min. Flip and cook the other side until the meat is well browned and slightly firm to the touch, about another 2 min. Transfer to a plate and repeat with the remaining pork.",
    "Melt the remaining 2 Tbs. butter in the pan. Add the shallots and a pinch of salt and sauté for about 30 seconds, using a wooden spoon to scrape up any browned bits from the bottom of the pan. Add the mushrooms and sauté until all of the mushroom liquid has evaporated and the mushrooms are golden, about 3 min. Season with 1/2 tsp. salt, sprinkle with the flour, and add the Marsala. Once the Marsala has almost completely evaporated, add the chicken broth and reduce by half, about 3 min. Stir in the cream and parsley, return the pork and any accumulated juices to the pan, and cook, flipping the pork once, until it’s firm to the touch and still a little pink in the middle (cut into a piece to check), 2 to 4 min. Taste for salt and pepper and serve.",
    "Serve with Buttermilk Mashed Potatoes with Chives or simple buttered baby potatoes when they're in season."
  ],
  "ingredients": [
    "0",
    "2 lb. pork tenderloin (about 2 tenderloins)",
    "Kosher salt and freshly ground black pepper",
    "3 Tbs. extra-virgin olive oil",
    "3 Tbs. unsalted butter",
    "2 medium shallots, finely diced",
    "12 oz. cremini mushrooms, thinly sliced",
    "1 Tbs. all-purpose flour",
    "1/2 cup dry Marsala",
    "1 cup homemade or low-salt chicken broth",
    "3 Tbs. heavy cream",
    "1/4 cup chopped fresh flat-leaf parsley"
  ],
  "__v": 2
}