{
  "hash": "fcb4730696c49adaae0c1b2c11f1700567034b81",
  "title": "Raspberry Swirl Sweet Rolls",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2012/12/Raspberry-Sweet-Rolls-3.jpg",
  "href": "https://sallysbakingaddiction.com/2012/12/16/raspberry-swirl-sweet-rolls/",
  "extension": "Chrome",
  "firstAdded": "2018-10-09T17:14:50.717000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "Make The Dough: In a small saucepan, warm the milk over low heat until lukewarm (no need to use a thermometer, but to be precise: about 95 degrees F). Pour the warm milk into the bowl of a stand electric mixer fitted with the dough hook attachment (OR you can use a handheld mixer OR no mixer, but a stand mixer is ideal). With a spoon, manually stir in the sugar and yeast. Cover with a towel and let sit until the yeast is foamy, about 5-10 minutes. On low speed, beat in the softened butter until it is slightly broken up. Next add the eggs, one at a time, and then the salt. The butter won't really be mixing into the mixture, so don't be alarmed if it stays in pieces. On low speed, gradually add the flour. Once it is all added, beat on medium speed until a soft dough forms. Increase speed to medium-high and beat until the dough is soft and supple, about 8-10 minutes longer. *If you do not have a stand-mixer with a hook attachment, knead the dough by hand in this step.",
    "Transfer the dough to a lightly floured surface and knead it with your hands for about 2 minutes. Form the dough into a ball and transfer it to a lightly greased bowl. Cover the dough and let sit in a warm place until doubled in size, 1 to 2 hours. Here's what I do: turn the oven on to 300F degrees. Turn the oven off. Stick the covered dough inside the oven and allow it to rise in this warm environment.",
    "Butter/grease/spray with nonstick spray the bottom of a 9x13 inch baking dish, then line with parchment paper. Turn the dough out onto a lightly floured work surface and, using a rolling pin, roll into a 12x18 inch rectangle. I used a ruler for accuracy. Make sure the dough is smooth and evenly thick, even at the corners.",
    "Make The Filling: In a medium bowl, toss the frozen raspberries with the sugar and cornstarch. Spread the cold sugared raspberries evenly over the dough. Tightly roll up the dough to form an 18-inch-long log. Cut into 12 even rolls (about 1.5 inches in width each). Arrange them in the prepared baking pan, cut sides up. Cover the rolls and let them rise in a warm place until they are puffy, about 2 hours OR overnight (see note). The berries will release their juice at the bottom of the pan - this is OK.",
    "After the rolls have risen, preheat the oven to 400F degrees. Cover the rolls with aluminum foil and bake for about 25 minutes, until they are golden and the berries are bubbling. Transfer the pan to a rack to cool for about 15 minutes.",
    "Make The Glaze: In a small bowl, whisk the confectioner’s sugar and heavy cream until smooth. Add more sugar or cream, depending how thick you want the glaze. Pour glaze over the rolls and serve warm. Cover rolls and store at room temperature for up to 2-3 days. Baked rolls can be frozen up to 2 months and warmed up to enjoy at a later date. Glaze them right before serving.",
    "Recipe Notes:",
    "Make Ahead: During the second rise, cover the sliced rolls and let sit overnight in the refrigerator before baking. In the morning, remove from the refrigerator and allow to rise in a warm environment for 1 hour (use your oven as noted in step 2 of the recipe)."
  ],
  "ingredients": [
    "0",
    "Dough",
    "1 cup (240ml) milk",
    "2/3 cup (135g) granulated sugar",
    "1 and 1/2 tablespoons active dry yeast (2 standard size packets)",
    "1/2 cup (115g) unsalted butter, softened to room temperature and cut into 4 pieces",
    "2 large eggs",
    "1/2 teaspoon salt",
    "4 and 1/2 cups (562g) all-purpose flour, plus more for dusting/rolling",
    "Filling",
    "One 10-oz. package frozen raspberries (NOT thawed)",
    "1/4 cup plus 2 Tablespoons (80g) granulated sugar",
    "1 teaspoon cornstarch",
    "Glaze",
    "1 cup (120g) confectioners' sugar",
    "3 Tablespoons (45ml) heavy cream (or half-and-half or milk)"
  ],
  "__v": 1
}