{
  "hash": "f9dbac7dbba06e783d80ddf7c463552b4abf7149",
  "title": "No Knead Jalapeño Cheddar Bread",
  "image": "http://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2018/10/jalapeno-cheddar-bread-honey-butter.jpg",
  "href": "https://sallysbakingaddiction.com/2018/10/09/jalapeno-cheddar-bread/",
  "extension": "Chrome",
  "firstAdded": "2018-10-13T18:06:27.396000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "*No need to grease the bowl.* Stir the first 5 ingredients together in a large bowl. Stir in the warm water. The dough will be pretty sticky-- don't be tempted to add more flour-- you want a sticky dough. Gently shape into a ball as best you can. Cover tightly with plastic wrap or aluminum foil. Set on the counter at room temperature (honestly any normal room temperature is fine!) and allow to rise for 12-18 hours. The dough will double in size, stick to the sides of the bowl, and have a lot of air bubbles.",
    "Turn the dough out onto a lightly floured work surface and, using lightly floured hands, shape into a ball as best you can. Doesn't have to be perfect. Transfer dough to a large piece of parchment paper, a piece large enough to fit inside your dutch oven and one that is safe under high oven heat. (I use this parchment and it's never been an issue.) Place the ball of dough + parchment inside a bowl so the dough doesn't spread out as it rests. See photo above.",
    "Using a very sharp knife, gently score an X into the top. Cover dough lightly with plastic wrap or a clean kitchen towel and let it rest for 30 minutes.",
    "During this 30 minutes, preheat the oven to 475°F (246°C). (Yes, very hot!) Place your dutch oven with the lid OR heavy duty pot inside for 30 minutes so that it's extremely hot before the dough is placed inside. After 30 minutes, remove the dutch oven from the oven and carefully place the dough inside by lifting it up with the parchment paper and sticking it all-- parchment paper included-- inside the pot. Cover with the lid.",
    "Bake for 25 minutes with the lid on. Carefully remove the lid and continue baking for 8-10 more minutes until the bread is golden brown. Remove pot from the oven, carefully remove the bread from the pot, and allow to cool on the counter for 30 minutes before breaking/slicing/serving.",
    "Cover and store leftover bread at room temperature for 1 week.",
    "Make ahead tip/Freezing: The dough takes up to 18 hours to rise, so this is a wonderful recipe to begin 1 day ahead of time. You can also bake the bread, allow it to cool, and freeze for up to 3 months. Thaw in the refrigerator and allow to come to room temperature before serving. You can also freeze the dough. Complete the recipe through step 2. Wrap in plastic wrap and place in a freezer-friendly container. To bake, allow dough to thaw overnight in the refrigerator, or for 2-3 hours at room temperature. Continue with step 3 and the rest of the recipe instructions.",
    "Recipe Notes:",
    "Recipe adapted from Red Star Yeast, method originally from Jim Lahey",
    "Feel free to increase or decrease the amount of diced jalapeño based on your spice tolerance. I like mildy spicy and think the heat with 1jalapeño is perfect.",
    "Whole wheat flour: You can swap all-purpose flour for whole wheat flour. The bread will have a tougher and heartier texture, as expected. To maintain a chewy and softer texture, use half all-purpose flour and half whole wheat flour.",
    "If your parchment paper can only be heated to a certain temperature, bake the bread at that temperature. Bake the bread a little longer to compensate for the lower temperature."
  ],
  "ingredients": [
    "0",
    "3 cups + 2 Tablespoons (390g) all-purpose flour, plus more for hands",
    "2 teaspoons coarse sea salt (I find the flavor lacking using regular table salt)",
    "1/2 teaspoon instant or active-dry yeast",
    "1 jalapeño, diced",
    "1 cup shredded cheddar cheese",
    "1 and 1/2 cups (360ml) warm water (about 95°F (35°C))"
  ],
  "__v": 1
}