{
  "hash": "245049b92b45dd40ae13b9f36d76df47313540e5",
  "title": "Classic Fish and Chips",
  "image": "https://imagesvc.timeincapp.com/v3/mm/image?url=http%3A%2F%2Fimg1.cookinglight.timeinc.net%2Fsites%2Fdefault%2Ffiles%2Fstyles%2Fmedium_2x%2Fpublic%2F1521146190%2F1803wAirFryFishAndChips.jpg%3Fitok%3D-4Zf-zmD&w=800&q=85",
  "href": "http://www.cookinglight.com/recipes/air-fryer-fish-and-chips",
  "extension": "",
  "firstAdded": "2018-06-26T08:14:32.581000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Step 1",
    "Cut potatoes into spirals on a spiralizer, using manufacturer’s instructions. In batches, place in a single layer in air fryer basket; spray with cooking spray, tossing to be sure that they are coated completely. Cook at 375°F until golden brown and crispy on the outside, 10 minutes, turning halfway through cooking. Remove potatoes from basket, and cover to keep warm. When all potatoes are cooked, sprinkle evenly with 1/4 teaspoon salt.",
    "Step 2",
    "While potatoes cook, stir together flour and 1/2 teaspoon of the salt in a shallow dish. Lightly whisk together eggs and water in a second shallow dish. Stir together panko and remaining 1/2 teaspoon salt in a third shallow dish. Cut each fish fillet lengthwise into 2 long strips. Dredge in flour mixture, shaking off excess. Dip in egg mixture, allowing any excess to drip off. Dredge in panko mixture, pressing to adhere. Coat fish on both sides with cooking spray.",
    "Step 3",
    "Place fish in a single layer in air fryer basket, and cook in batches at 375°F until golden brown, 10 minutes, turning fish over halfway through cooking.",
    "Step 4",
    "To serve, place 2 pieces of fish and equal portions potato spirals on each plate with 2 tablespoons malt vinegar for dipping."
  ],
  "ingredients": [
    "0",
    "2 (10-oz.) russet potatoes, scrubbed",
    "Cooking spray",
    "1 1/4 teaspoons kosher salt, divided",
    "1 cup (about 4 1/4 oz.) all-purpose flour",
    "2 large eggs",
    "2 tablespoons water",
    "1 cup whole-wheat panko (Japanese-style breadcrumbs)",
    "4 (6-oz.) skinless tilapia fillets",
    "1/2 cup malt vinegar"
  ],
  "__v": 1
}