{
  "hash": "4de116786b02d5566955c589add5fc12be5d0208",
  "title": "Ultimate Green Taco Wraps with Lentil-Walnut Taco Meat (Vegan + Gluten-Free)",
  "image": "http://cdn.ohsheglows.com/wp-content/uploads/2014/06/vegantacos-8805.jpg",
  "href": "http://ohsheglows.com/2014/06/17/ultimate-green-taco-wraps-with-lentil-walnut-taco-meat-vegan-gluten-free/",
  "extension": "Chrome",
  "firstAdded": "2016-02-15T22:24:37.162000",
  "users": [
    null
  ],
  "keywords": [
    "lentilwalnut",
    "meat",
    "makes",
    "uncooked",
    "french",
    "green",
    "need",
    "lentils",
    "walnut",
    "pieces",
    "oregano",
    "cumin",
    "chili",
    "salt",
    "extra",
    "virgin",
    "olive",
    "oil",
    "water",
    "toppingswraps",
    "bell",
    "peppers",
    "used",
    "time",
    "use",
    "ample",
    "leftovers",
    "onion",
    "cashew",
    "sour",
    "cream",
    "link",
    "tomatoes",
    "salsa",
    "lime",
    "juice",
    "wraps",
    "romaine",
    "iceburg",
    "butter",
    "lettuce",
    "leaves",
    "options",
    "avocado",
    "hot",
    "cilantro"
  ],
  "directions": [
    "0",
    "Directions:",
    "Cook the lentils: Rinse lentils in a fine mesh sieve. Add to a medium pot along with a few cups of water. Bring to a boil, reduce heat to medium, and simmer for 20-25 minutes until tender (cook time will vary depending on the type of lentils you use - see package). Drain off excess water.",
    "Toast the walnuts: Preheat oven to 300F. Add walnuts onto a rimmed baking sheet and toast for 10-13 minutes, watching closely, until lightly golden and fragrant. Set aside to cool for a few minutes.",
    "Saute the pepper + onion filling: Add 1/2-1 tablespoon of oil into a large skillet or wok. Cook the onion and peppers over medium heat for about 15-20 minutes, reducing heat if necessary and stirring frequently, until translucent.",
    "Prepare the taco meat: Add 1 3/4 cups cooked lentils (you'll have some leftover) and all the toasted walnuts into a food processor and pulse until chopped (make sure to leave texture). Stir or pulse in the oregano, cumin, chili powder, and salt. Stir in the oil and the water until combined.",
    "Prepare the rest of your vegetable toppings and wash + dry the lettuce wraps.",
    "Assemble: Add a large lettuce leaf onto a plate, top with taco meat, sauteed peppers + onion, and the rest of your desired toppings.",
    "Leftovers can be stored in the fridge in sealed containers to be enjoyed the next couple days. The cashew cream will keep for at least a week in the fridge. Use sour cream leftovers on sandwiches, wraps, stirred into salad dressings, on vegan nachos, or with chili or soup.",
    "Tips:",
    "1) I used French green lentils in my taco meat because I love their chewy texture, but regular green and brown lentils work too. Do not use red lentils as they are too mushy and don't have the required chewy texture for this recipe.",
    "2) Nut-free taco meat: I haven't tried this yet, but you might want to try subbing the walnuts for 1/2-3/4 cup toasted sunflower seeds. Let us know how it goes if you try it out!",
    "3) My Cashew Sour Cream recipe can be found here."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "FOR THE LENTIL-WALNUT MEAT (makes 2 1/2 cups):",
    "1 cup uncooked French green lentils (you will need 1 3/4 cups cooked lentils)",
    "1 cup walnut pieces, toasted",
    "1 1/2 teaspoons dried oregano",
    "1 1/2 teaspoons ground cumin",
    "1 1/2 teaspoons chili powder",
    "1/2 teaspoon fine grain sea salt, or to taste",
    "1 1/2 tablespoons extra virgin olive oil",
    "2 tablespoons water",
    "FOR THE TOPPINGS/WRAPS:",
    "1-2 bell peppers, thinly sliced (I used one, but next time I will use 2 for ample leftovers)",
    "1/2-1 large onion, thinly sliced (I used 1/2 onion, but next time will use 1 for ample leftovers)",
    "Cashew Sour Cream (see below for link)",
    "Diced tomatoes or salsa",
    "Green onion & fresh lime juice, for garnish",
    "lettuce wraps (large romaine, Iceburg, or Butter lettuce leaves)",
    "Other topping options: Sliced avocado, hot sauce, cilantro, etc."
  ],
  "__v": 1
}