{
  "hash": "c893157158d0f1745e70a40f6bfe967af83aa5ce",
  "title": "Chile Verde (La Frontera Style)",
  "image": "http://images.bigoven.com/image/upload/t_recipe-256/chile-verde-la-frontera-style-30bd6d.jpg",
  "href": "http://www.bigoven.com/recipe/chile-verde-la-frontera-style/169360",
  "extension": "Chrome",
  "firstAdded": "2015-11-24T01:18:13.900000",
  "users": [
    null
  ],
  "keywords": [
    "pork",
    "jalapeno",
    "peppers",
    "serrano",
    "anaheim",
    "tomatillos",
    "onion",
    "cilantro",
    "garlic",
    "green",
    "chilis",
    "tomatoes",
    "tomato",
    "chicken",
    "broth",
    "oregano",
    "cumin",
    "chili",
    "corn",
    "starch",
    "flour",
    "browning",
    "salt",
    "pepper"
  ],
  "directions": [
    "0",
    "Cut the pork into small chunks. You can use pork roast, pork loin, or Boston butt.",
    "Husk the tomatillos, de-stem them, and cut them into large chunks.",
    "Cut the jalapenos, Anaheim peppers, and Serrano peppers into large chunks.",
    "Put tomatillos and peppers and cilantro in a food processor, puree them all.",
    "Add the can of green chilis, diced tomatos, and tomato sauce to the food processor.",
    "Continue blending until the mixture is a consistant color.",
    "Pour the vegetable puree into a crock-pot.",
    "Add the chicken broth, oregano, cumin, and chili powder.",
    "Turn the crock-pot on high and cover.",
    "Dust the pork with flour, salt and pepper.",
    "Heat 2 Tbsp. olive oil, shortening, or lard in a frying pan.",
    "Add the garlic and onions, sauté until the onions are tender.",
    "Add the pork, brown it thoroughly.",
    "Pour the entire pan’s contents (including drippings) into the crock-pot.",
    "Cook in the crock-pot on high for 2 hours.",
    "After 2 hours, reduce the heat to medium or low and cook for at least another 2 hours. For very tender pork, cook on low heat for 8 or more hours.",
    "30 minutes before serving, mix the cornstarch with 2 ounces of cold water, and add it to the crock-pot. Add more if you want to thicken it further.",
    "Serve over bean burritos. I used flour tortillas, with refried beans, chopped onions, and cheese wrapped inside. Bake the burritos in the oven at 400 for 15-20 minutes (until the tortilla just barely starts to dry out). Cover them with the chili verde and pork, then garnish (or further smother) with onions and cheese."
  ],
  "ingredients": [
    "0",
    "2 pounds pork",
    "6 jalapeno peppers; small",
    "6 serrano peppers",
    "3 anaheim peppers; optional",
    "8 tomatillos",
    "1 sweet onion; large",
    "0.5 cup cilantro; fresh",
    "1 tbsp garlic; minced",
    "1 4-oz can green chilis",
    "1 10-oz can diced tomatoes",
    "1 14-ounce can tomato sauce",
    "2 cups chicken broth",
    "1 tsp oregano",
    "1 tsp cumin",
    "1 tsp chili powder",
    "2 tbsp corn starch",
    "1/4 cup Flour; for browning the pork.",
    "1 teaspoon Salt; for browning the pork.",
    "1 teaspoon Pepper; for browning the pork."
  ],
  "__v": 1
}