{
  "hash": "5afe79dd05505e75d48579ac4d43e269cfa7a6c8",
  "title": "Teriyaki Meatloaf Cupcakes",
  "image": "http://www.thebariatricdiva.com/uploads/1/9/7/6/19765261/9999303_orig.jpg",
  "href": "http://www.thebariatricdiva.com/blog/teriyaki-meatloaf-cupcakes",
  "extension": "Chrome",
  "firstAdded": "2016-09-12T08:15:03.322000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Preheat oven to 350 degrees.",
    "Start by making the meatloaves. In a food processor, whiz the Fiber One cereal and place in a large mixing bowl. Whiz the onion and celery too and add to the bowl.",
    "Add ginger, garlic, eggs, Worcestershire sauce, seasoned salt, and pepper. Add ground beef and ground turkey. Mix well until everything is combined. Don’t be afraid to get dirty – use your hands!",
    "Press meatloat mixture into 12 cupcake cups. I was able to get about 4 tbsp into each cup. Bake for 20 minutes.",
    "While it is cooking, make your sauce. Basically, combine all ingredients (ketchup, garlic, Splenda Brown Sugar Blend, ground ginger, soy sauce, pineapple juice) until mixed well.",
    "After 20 minutes, take out your cupcake pan. Use a spoon and spoon about 1 tbsp of the sauce over each cupcake. Return to the oven and continue to cook about 10 more minutes, until meat is no longer pink and a meat thermometer inserted reaches 160 degrees.",
    "Note: you will want to remove them from the cupcake pan and drain on paper towels. The cupcake tins don’t allow the juice/fat from the meat to drain. Alternatively, you can stick them on a broiler pan and put them back in the oven for about 5 minutes. Just make sure you have a pan to catch the drippings."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Meatloaves",
    "1/2 tsp ground ginger",
    "1 clove garlic, minced",
    "2 eggs, lightly beaten",
    "2 tbsp Worcestershire sauce",
    "1 cup Fiber One cereal, crushed",
    "3 stalks celery",
    "1/2 onion",
    "1 teaspoon seasoned salt",
    "1/2 teaspoon pepper",
    "1 pound lean ground beef (93%)",
    "1 pound ground turkey",
    "Sauce:",
    "1 cup reduced sugar ketchup (Heinz brand makes one that has 75% less added sugar)",
    "1 clove garlic, minced",
    "2 tbsp packed Splenda Brown Sugar Blend",
    "1/2 tsp ground ginger",
    "1 tbsp soy sauce",
    "2 tbsp pineapple juice (optional)"
  ],
  "__v": 1
}