{
  "hash": "62426a4f4e161e11bab023b5e6daa2770a4c43df",
  "title": "Paneer Tikka Snack",
  "image": "http://recipe-folder.com/img/recipe-images/092/814/2700608292.jpg",
  "href": "http://recipe-folder.com/recipe/5caa1a71d8e26b095b61b16e",
  "extension": "User Added",
  "firstAdded": "2019-04-07T15:42:41.739000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Mix all the ingredients under marinade into a bowl and add paneer to it. Toss the paneer in the marinade till the cubes are coated well. Cover and set aside for at least half an hour or up to two hours.",
    "1",
    "Pre-heat oven to 220 C/ 430 F 10 minutes before ready to cook. Place a cooling rack over a roasting pan and set aside.",
    "2",
    "Skewer paneer cubes alternating with onions, capsicum and tomato (if using). This should make about 3-4 skewers.",
    "3",
    "Place the skewers on the cooling rack and bake for 15 minutes, turning once half way. After 15 minutes, switch on the broiler (or only the upper element of the oven) and broil for 2-3 minutes till the paneer has a slight char on the surface.",
    "4",
    "Carefully remove the roasting pan with the skewers out of the oven (the paneer tends to become really soft so be careful) and place the skewers on your serving platter. Top with chopped coriander and squeeze lime juice on them. Serve immediately with sliced onions."
  ],
  "ingredients": [
    "0",
    "for the paneer tikka",
    "1",
    "2 cups Paneer cubes ((Cottage Cheese), cut into 1 inch cubes)",
    "2",
    "1 medium sized onion (cut into 1 inch cubes)",
    "3",
    "1 capsicum (deseeded and cut into 1 inch cubes)",
    "4",
    "1 large tomato (deseeded and cut into cubes (optional))",
    "5",
    "chopped Coriander or Cilantro, Lime juice for topping",
    "6",
    "for the marinade",
    "7",
    "3 tablespoons Mustard Oil",
    "8",
    "1 teaspoon Garlic Paste",
    "9",
    "1 teaspoon Ginger Paste",
    "10",
    "1/2 cup thick Curds (or Greek Yogurt)",
    "11",
    "2 teaspoons Kashmiri Red Chilli Powder (or Paprika)",
    "12",
    "1 tablespoon Coriander Powder",
    "13",
    "1 teaspoon Chaat Masala Powder ((available at Asian/Indian stores))",
    "14",
    "1/2 teaspoon Garam Masala Powder",
    "15",
    "1 teaspoon kasuri methi (crushed)",
    "16",
    "Salt to taste"
  ],
  "__v": 1,
  "hidden": true
}