{
  "hash": "0bfa043aeeb8703c6855d3a63f37a6cf76a82fee",
  "title": "Lemon-Ricotta Pancakes",
  "image": "",
  "href": "http://www.chowhound.com/recipes/lemon-ricotta-pancakes-28985",
  "extension": "Chrome",
  "firstAdded": "2016-05-17T21:45:40.001000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "1Place butter and milk in a small saucepan over medium-low heat, stirring occasionally until butter has melted; remove from heat and let cool slightly.",
    "2In a medium bowl, sift together flour, baking powder, and 1/2 teaspoon of the salt; set aside.",
    "3Place egg yolks, 1 tablespoon of the sugar, lemon zest, and vanilla in a large bowl and whisk to combine. Whisk in a quarter of the milk-butter mixture (this will temper the eggs and prevent them from curdling), then whisk in the remaining milk-butter mixture until smooth.",
    "4Add the reserved flour mixture and stir with a rubber spatula until just combined (do not overmix); set aside.",
    "5In a medium bowl, whisk egg whites to soft peaks (they should bend like soft-serve ice cream; make sure the bowl and whisk are perfectly clean with no traces of grease, or the whites will not whip properly). Halfway through whisking them, sprinkle in the remaining 1 tablespoon sugar and 1/2 teaspoon salt. Using the rubber spatula, fold the whites into the reserved batter until just combined.",
    "6Gently fold the ricotta into the batter, being careful not to break down the texture of the cheese (the batter will be lumpy and streaked with ricotta); set aside.",
    "7Heat a large nonstick frying pan, griddle, or seasoned cast iron skillet over medium heat until hot, about 4 minutes. Test to see if the pan is hot enough by sprinkling a couple of drops of cold water in it: If the water bounces and sputters, the pan is ready to use.",
    "8Lightly coat the pan’s surface with butter, then use a 1/4-cup measure to scoop the batter into the pan. Cook until bubbles form on top of the pancakes, about 4 to 5 minutes. Flip and cook the other side until the bottoms are golden brown, about 1 to 2 minutes more. Repeat with the remaining batter. Serve immediately with powdered sugar, fruit, butter, or maple syrup."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS (11)",
    "5 tablespoons unsalted butter, plus more for coating the frying pan and serving",
    "1 cup whole milk",
    "1 1/4 cups all-purpose flour",
    "1 1/2 teaspoons baking powder",
    "1 teaspoon fine salt",
    "3 large eggs, yolks and whites separated",
    "2 tablespoons granulated sugar",
    "1 tablespoon packed finely grated lemon zest (from about 2 to 3 medium lemons)",
    "1/2 teaspoon vanilla extract",
    "3/4 cup whole-milk ricotta cheese",
    "Powdered sugar, fruit, or maple syrup, for serving (optional)"
  ],
  "__v": 1
}