{
  "hash": "341631b4411a52eea687cf81957fdbb50838eeb3",
  "title": "Bombay Style Chicken with Dal",
  "image": "https://www.archanaskitchen.com/images/archanaskitchen/1-Author/sibyl_sunitha/_Murghi_Aur_Masoor_Dal_Recipe_Bombay_Style_Chicken_with_Red_Lentils_.jpg",
  "href": "https://www.archanaskitchen.com/murghi-aur-masoor-dal-recipe-bombay-style-chicken-with-red-lentils",
  "extension": "Firefox",
  "firstAdded": "2019-03-09T00:05:31.339000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "How to make Murgh Aur Masoor Dal Recipe-Bombay Style Chicken with Dal",
    "To begin making the Murgh Aur Masoor Dal Recipe, wash and soak the whole masoor dal for 3-4 hours.",
    "Heat up a pressure cooker over medium heat with oil.",
    "Add ginger, garlic and saute until the raw smell goes away. Add half of the onions and saute till they turn translucent.",
    "Add turmeric powder, cumin powder, salt, masoor dal and 2 cups of water and pressure cook for about 5 whistle until the dal is done.",
    "Once the pressure has released naturally, open the cooker and use a masher to mash the dal. Transfer to aa bowl and set aside.",
    "Heat the same pressure cooker with oil on medium heat, add remaining onions and saute until they turn translucent.",
    "Add the mashed dal and give it a good stir. Add remaining spice powders - garam masala, red chilli powder and mix well.",
    "Now add the add the cleaned and washed chicken pieces, adjust the seasoning, add about 1 1/2 cups of water and pressure cook for about 2 whistle until the chicken is cooked. Turn off thee flame. Allow the pressure to release naturally. Serve hot.",
    "Serve the Murgh Aur Masoor Dal Recipe along with steamed rice or phulka, Carrot, Radish & Peanut Salad with Lemon Recipe and Onion Raita Recipe - Pyaz Ka Raita Recipe to make your complete meal rich and flavorful."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "300 grams Chicken\t, with bone",
    "1 cup Masoor Dal (Whole)",
    "2 Onions\t, sliced",
    "1 Green Chilli\t, slit",
    "1 inch Ginger\t, chopped",
    "5 cloves Garlic\t, chopped",
    "1 teaspoon Turmeric powder (Haldi)",
    "2 teaspoon Cumin powder (Jeera)",
    "1 teaspoon Red chilli powder",
    "2 teaspoon Garam masala powder",
    "1 Lemon juice",
    "Salt\t, to taste",
    "Cooking oil"
  ],
  "__v": 1
}