{
  "hash": "c336664d990786e81825ddb886af988297490ac9",
  "title": "Cheesy, Heirloom, Panini Batons",
  "image": "http://www.101cookbooks.com/mt-static/images/food/paninibatons.jpg",
  "href": "http://www.101cookbooks.com/archives/001455.html",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T21:39:54.225000",
  "users": [
    null
  ],
  "keywords": [
    "clove",
    "garlic",
    "extravirgin",
    "olive",
    "oil",
    "ricotta",
    "cheese",
    "basil",
    "bunch",
    "chives",
    "salt",
    "mozzarella",
    "preferably",
    "waterpacked",
    "heirloom",
    "tomatoes",
    "flat",
    "slab",
    "ciabatta",
    "sturdy",
    "foccacia",
    "bread",
    "comparable",
    "pepper"
  ],
  "directions": [
    "0",
    "Make the basil-chive ricotta spread by combining the garlic, olive oil, ricotta, basil, chives, and salt in a food processor until mixture turns pale green, about 15-20 seconds. Set aside.",
    "Cut the slab of bread into one-inch thick strips and then in half horizontally so that each strip can be made into a sandwich baton. Sometimes there is too much bread going on in the middle and I'll thin it out by trimming it closer to the crust on both sides.",
    "Drain the mozzerella on a paper towel and season with a few pinches of salt and freshly ground pepper. Slice into 1/4-inch thick rounds. The mozzerella should go on the bread without much overhang, so cut each round in half if needed.",
    "Drizzle the tomato slices with a bit of olive oil.",
    "To assemble each panini, slather both the tops and bottoms of each bread baton with the basil-chive spread and then add a few pieces of mozzerella. Put the tops on and place in a skillet (see above) over medium heat or in your panini maker. Cook until the cheese is nice and oozy.",
    "Remove from the pan open each baton and add a few sliced tomatoes. Close up and enjoy."
  ],
  "ingredients": [
    "0",
    "1 clove of garlic",
    "2 tablespoons of extra-virgin olive oil",
    "1 cup ricotta cheese",
    "1/2 cup fresh basil",
    "1 bunch of chives",
    "1/2 teaspoon fine grain sea salt",
    "Mozzarella (preferably water-packed)",
    "Small heirloom tomatoes, sliced 1/4-inch thick",
    "1 flat slab of ciabatta, sturdy foccacia bread, or comparable",
    "Salt and pepper"
  ],
  "__v": 1
}