{
  "hash": "f0dd3672c492306dfd7d17559a49a49b56525ef6",
  "title": "Caramelized Pasilla Brisket",
  "image": "https://patijinich.com/wp-content/uploads/2017/09/610-caramelized-pasilla-brisket-912x622.jpg",
  "href": "https://patijinich.com/recipe/caramelized-pasilla-brisket/",
  "extension": "Chrome",
  "firstAdded": "2017-10-29T13:29:13.170000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Pre-heat the oven to 350 degrees Fahrenheit.",
    "Heat up a comal or skillet over medium heat, then toast the pasilla chiles for about 1 to 2 minutes, flipping with tongs as they toast. Remove from heat and place in a bowl.",
    "Season the meat with 1 teaspoon salt and freshly ground black pepper to taste. Heat oil in a large casserole or roasting pan set over high heat. Brown the meat for about 2 to 3 minutes per side. Add the toasted pasilla chiles, tomatillos, onion, garlic, chicken broth, piloncillo, the remaining teaspoon salt, and freshly ground black pepper to taste. Make sure chiles are covered with the broth.",
    "Cover and seal tight with a lid or aluminum foil. Place in the oven and braise for 3 to 3-and-a-half hours, or until meat is tender. Remove from the oven. Remove the meat and place on a chopping board.",
    "Pour all the remaining contents of the roasting pan into the jar of a blender and puree until completely smooth. Pour the sauce back into roasting pan.",
    "Slice the meat against the grain into about 1/2 to 3/4-inch slices and return it to the roasting pan. Add the potatoes and carrots, cover everything with the sauce. Cover the dish and return to oven for another 30 minutes. Remove the lid or aluminum foil, return to the oven and cook uncovered for another 30 minutes, until the vegetables are tender.",
    "Toss the greens of your choice with lime juice and olive oil to taste. Serve the brisket with the side salad."
  ],
  "ingredients": [
    "0",
    "2ounces (about 5 to 6)dried pasilla chilesstemmed and seeded",
    "3poundsbeef briskettrimmed",
    "2teaspoonskosher or coarse sea saltdivided",
    "To tastefreshly ground black pepper",
    "2tablespoonsvegetable oil",
    "1 1/2poundstomatilloshusked, rinsed, quartered",
    "1largewhite onioncut into chunks",
    "10garlic clovespeeled",
    "4cupschicken broth",
    "4ounces (or 1/2 cup)grated piloncillo or brown sugar",
    "1 1/2poundsbaby potatoeshalved",
    "1 1/2poundscarrots peeledand cut diagonally into 1-inch pieces",
    "Greens of your choice for salad",
    "Freshly squeezed lime juice and olive oilto dress the salad"
  ],
  "__v": 1
}