{
  "hash": "e1b6300901e22fb75c9440b8dce8928db7b37e8e",
  "title": "Roasted Broccoli and Tofu with Creamy Miso Dressing",
  "image": "",
  "href": "https://www.bonappetit.com/recipe/roasted-broccoli-and-tofu-with-creamy-miso-dressing",
  "extension": "Chrome",
  "firstAdded": "2018-06-24T13:33:02.943000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 425◦. Cut off stems from brussels sprouts; discard. Place outer leaves on a large rimmed baking sheet. Finely slice inner brussels sprout cores and transfer to a medium bowl. Coarsely grind coriander seeds in spice mill or with mortar and pestle.",
    "Add broccoli and tofu to baking sheet with outer sprout leaves. Drizzle with 2 Tbsp. oil, add crushed coriander and pepper, and toss to combine; season with salt. Roast, tossing once halfway through, until broccoli is browned (even lightly charred in a few spots) and tender, 30–35 minutes. Let cool.",
    "Meanwhile, add olives, 1 Tbsp. oil, and 1 Tbsp. lemon juice to sliced brussels sprouts and toss to combine. Season with salt.",
    "Purée hemp seeds, miso, 2 tsp. sesame seeds, remaining 5 Tbsp. lemon juice and 2 Tbsp. oil, and ¼ cup water in a blender until smooth. Season with salt.",
    "Spread some dressing on bowls or plates. Toss roasted vegetables with sliced brussels sprouts and arrange over dressing. Top with sesame seeds, almonds, and parsley."
  ],
  "ingredients": [
    "0",
    "½ pound brussels sprouts",
    "2 teaspoons coriander seeds",
    "2 small heads of broccoli (about 1 pound total), cut into large florets",
    "1 14-ounce block firm tofu, drained well, torn into bite-size pieces",
    "5 tablespoons extra-virgin olive oil, divided",
    "1 teaspoon Aleppo-style pepper or other mild red pepper flakes",
    "Kosher salt",
    "⅓ cup green olives, pitted, coarsely chopped",
    "¼ cup plus 2 tablespoons fresh lemon juice, divided",
    "½ cup hemp seeds",
    "2 tablespoons white miso",
    "2 teaspoons toasted sesame seeds, plus more for serving",
    "Crushed toasted almonds and/or parsley leaves with tender stems (for serving)"
  ],
  "__v": 1
}