{
  "hash": "cd819a4caa73ef72dbf81ae8d235dbf470c64e4f",
  "title": "Pizza Stromboli with Spinach, Mushrooms, and Cheese",
  "image": "http://twopeasandtheirpod.com/wp-content/uploads/2008/11/pizza-roll-012.jpg",
  "href": "http://www.twopeasandtheirpod.com/pizza-roll-ups/",
  "firstAdded": "2014-12-21T18:40:30.380000",
  "users": [
    null
  ],
  "keywords": [
    "dough",
    "dry",
    "active",
    "yeast",
    "water",
    "sugar",
    "salt",
    "flour",
    "olive",
    "oil",
    "mozzarella",
    "cheese",
    "coarsely",
    "baby",
    "spinach",
    "mushrooms",
    "roasted",
    "peppers",
    "red",
    "onion",
    "basil",
    "tblsp",
    "pepper",
    "eggfor",
    "egg",
    "wash"
  ],
  "directions": [
    "0",
    "Preheat the oven to 400 degrees F. Dissolve the yeast in warm water, sprinkle with pinch of sugar. Let stand for five minutes.",
    "Combine flour and salt in large mixing bowl. (We do this in our Kitchenaid.) Pour half of the yeast water into your bowl and add in olive oil. Mix briefly. Add the rest of the yeast mixture. Mix until combined and switch to your dough hook. Let the machine knead the dough for about 10 minutes. Take the dough ball out and make sure it is smooth and not sticky!",
    "Place the dough in an oiled bowl. Turn it over to oil both sides. Cover the bowl with a damp cloth/towel. Let rise for about 45 minutes or until doubled in bulk.",
    "Divide the dough in half. You can freeze one if you want.",
    "Roll our the dough on a lightly floured surface. It should be a 12-14 inch circle, about ¼ inch thick.",
    "Sprinkle 1/2 of the mozzarella over the dough. Arrange the spinach over the cheese in a single layer. Sprinkle with the mushrooms, peppers, onions, basil, and then top with the remaining cheese.",
    "Roll the dough into a thin cylinder, gently tucking in the ends. Brush the entire roll with the olive oil & season with the salt & pepper. We also brushed it with an egg wash to help the browning process.",
    "Place the dough, seam-side down, on the baking sheet & bake for 25 minutes until the top is golden brown.",
    "Cool the roll for 5 minutes, then use a serrated knife to cut it into 3/4-inch slices."
  ],
  "ingredients": [
    "0",
    "Dough:",
    "1 package of dry active yeast",
    "1 cup warm water",
    "Pinch of sugar",
    "1 1/4 tsp. salt",
    "3 1/2 cups flour",
    "1 T olive oil",
    "2 cups shredded mozzarella cheese",
    "1 cup coarsely chopped baby spinach",
    "1 cup sliced mushrooms",
    "Roasted peppers",
    "Chopped red onion",
    "Fresh basil",
    "1 tblsp olive oil",
    "Salt & Pepper",
    "1 egg-for the egg wash"
  ],
  "__v": 1
}