{
  "hash": "2788d5bf6071a1d7ba4e8b79881e492ffc487463",
  "title": "Miso Kimchi Nachos w/ Cashew Cheese Sauce",
  "image": "http://static1.squarespace.com/static/55351d7ee4b097f55547d973/t/55a9766be4b048cfac175130/1437169286322/?format=750w",
  "href": "http://www.spiceandsprout.com/recipe-blog/2015/7/17/miso-kimchi-nachos-w-cashew-cheese",
  "extension": "",
  "firstAdded": "2015-11-15T15:55:26.142000",
  "users": [
    null
  ],
  "keywords": [
    "cashew",
    "cheese",
    "raw",
    "cashews",
    "soaked",
    "hours",
    "nutritional",
    "yeast",
    "juice",
    "lemon",
    "garlic",
    "water",
    "salt",
    "miso",
    "nachos",
    "ton",
    "tortilla",
    "chips",
    "stalks",
    "kale",
    "washed",
    "roughly",
    "yellow",
    "bell",
    "pepper",
    "obsessed",
    "alchemy",
    "pickle",
    "companys",
    "bok",
    "choy",
    "kim",
    "chi"
  ],
  "directions": [
    "0",
    "Notes",
    "To prepare cheese sauce, drain the water from the soaking cashews and add the cashews to a blender. Add the nutritional yeast, lemon juice, garlic, water, salt, and miso to the blender and blend on high speed until smooth. Set aside.",
    "Set your oven to broil. Layer tortilla chips along the bottom of a large, heatproof baking dish. Sprinkle some of the diced yellow pepper and kale over the chips and drizzle on a generous amount of cashew cheese sauce. Repeat layering until your dish is filled to the top. Pile the rest of the kale and yellow pepper in the middle and drizzle even more cheese sauce over the whole dish. Bake in the oven for 5-7 minutes, watching carefully. Remove from oven and add Kim Chi to the top of the nachos. Serve immediately, It is best hot! You should have extra cheese sauce left for dipping into, and extra Kim Chi for when you get to the bottom layer.",
    "Enjoy!",
    "P.S. This can easily be cooked in the BBQ if you do not want to turn on the oven!"
  ],
  "ingredients": [
    "0",
    "Cashew Cheese Sauce",
    "1/2 cup raw cashews, soaked for at least 2 hours",
    "3 tbsp nutritional yeast",
    "2 tbsp lemon juice (about 1/2 a lemon)",
    "2 cloves of garlic",
    "1/2 cup water",
    "1 tsp salt",
    "1 tbsp miso paste",
    "Nachos",
    "a TON of tortilla chips",
    "4 stalks of kale, washed and roughly chopped",
    "1 yellow bell pepper, diced",
    "approximately 1/2 cup Kim Chi, add more or less to taste (I am obsessed with Alchemy Pickle Company’s Bok Choy Kim Chi)"
  ],
  "__v": 1
}