{
  "hash": "ad324dcaee1a61e321542015be47a0e862689c5a",
  "title": "Bean, Kale and Egg Stew",
  "image": "//food.fnr.sndimg.com/content/dam/images/food/fullset/2013/12/27/0/FNK_bean-kale-egg-stew_s4x3.jpg.rend.hgtvcom.616.462.suffix/1389218636450.jpeg",
  "href": "http://www.foodnetwork.com/recipes/food-network-kitchen/bean-kale-and-egg-stew-3362360",
  "extension": "Chrome",
  "firstAdded": "2018-01-15T05:05:08.798000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat broiler. Heat 1 tablespoon of the oil in a medium saucepan over medium-high heat. Add the onions and cook, stirring, until soft, about 4 minutes. Add the beans and reserved bean liquid, chicken broth, soy sauce, 1/2 teaspoon salt and a few grinds of black pepper. Bring to a simmer, add the kale and stir until wilted; bring back to a simmer and cook until the kale is tender and the stew is slightly thickened, about 15 minutes. Remove from the heat, cover and keep warm.",
    "Heat the remaining 1 tablespoon oil in a large nonstick skillet. Once the oil is hot, crack the eggs into the skillet and cook until the whites begin to set up, about 2 minutes. Sprinkle each egg with pepper, cover and continue to cook until the whites are completely set and the yolks are still runny, about 2 minutes more. Remove from the heat.",
    "Top each slice of bread with cheese and broil until melted. Cut each slice in quarters.",
    "Divide the stew among four bowls, top each with an egg and serve with a piece of cheese toast. Serve with hot sauce."
  ],
  "ingredients": [
    "0",
    "2 tablespoons olive oil",
    "1/2 small red onion, chopped",
    "Two 15-ounce cans kidney or pinto beans, one can drained and rinsed, one can liquid reserved",
    "1 1/2 cups low-sodium chicken or vegetable broth",
    "2 teaspoons low-sodium soy sauce",
    "Kosher salt and freshly ground black pepper",
    "1 bunch kale, stemmed and torn into 2-inch pieces (about 10 cups)",
    "4 large eggs",
    "4 slices whole-grain bread",
    "2 ounces sharp Cheddar, grated (about 1/3 cup)",
    "Your favorite hot sauce, for serving"
  ],
  "__v": 1
}