{
  "hash": "c25a43d65dbfd892bdf0345a91c3a99675e9dd68",
  "title": "Baked Tonkatsu",
  "image": "http://www.justonecookbook.com/wp-content/uploads/2014/09/Baked-Tonkatsu-NEW-205x135.jpg",
  "href": "http://www.justonecookbook.com/baked-tonkatsu",
  "extension": "Chrome",
  "firstAdded": "2017-04-30T03:40:40.574000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Gather all the ingredients.",
    "Adjust an oven rack to the middle position and preheat the oven to 400F (200C). Line a rimmed baking sheet with parchment paper.",
    "Combine the panko and oil in a frying pan and toast over medium heat until golden brown. Transfer panko into a shallow dish and allow to cool.",
    "Get rid of the extra fat and make a couple of slits on the connective tissue between the meat and fat. The reason why you do this is that red meat and fat have different elasticity, and when they are cooked they will shrink and expand at different rates. This will allow Tonkatsu to stay nice and flat and prevent Tonkatsu from curling up.",
    "Pound the meat with a meat pounder, or if you don’t have one then just use the back of knife to pound. Mold the extended meat back into original shape with your hands.",
    "Sprinkle salt and freshly ground black pepper.",
    "Dredge each pork piece in the flour to coat completely and pat off the excess flour. Then dip into the beaten egg and finally coat with the toasted panko. Press on the panko flakes to make sure they adhere to the pork.",
    "Place the pork on the prepared baking sheet or even better if you have an oven-safe wire rack (as air goes through on the bottom so panko won't get crushed). Bake until the pork is no longer pink inside, about 20 minutes.",
    "Cut Tonkatsu into 1 inch pieces (so you can eat with chopsticks) by pressing the knife directly down instead of moving back and forth. This way the panko will not come off. Transfer to a plate and serve immediately.",
    "To make special sesame tonkatsu sauce, grind black and white sesame seeds in a mortor and add tonkatsu sauce. Mix all together."
  ],
  "ingredients": [
    "0",
    "¾cuppanko (Japanese breadcrumbs)",
    "1Tbspolive oil",
    "2piecespork loin(2 pieces = ½ lb or 226 g, thickness: 1.2 cm or ½\" )",
    "1tspKosher salt",
    "Freshly ground black pepper",
    "2Tbspall-purpose flour",
    "1large egg",
    "Tonkatsu Sauce(See Notes for homemade recipe)",
    "1Tbspwhite and black sesame seeds (roasted/toasted)"
  ],
  "__v": 1
}