{
  "hash": "35d3643b5f29b2468ffedddb5fe93b0b464504e9",
  "title": "Farro with Swiss Chard and Radicchio",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2014/10/farro-chard-radicchio-horiz-a-1200.jpg",
  "href": "https://www.simplyrecipes.com/recipes/farro_with_swiss_chard_and_radicchio/",
  "extension": "",
  "firstAdded": "2018-01-28T21:06:43.142000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Sauté onions and garlic: Heat 2 Tbsp of olive oil in a thick-bottomed 5 to 6 quart pot on medium high heat. Add the onions, and sauté for 3 to 4 minutes until softened. Add garlic cloves, reduce heat to medium, and cook for another 3 minutes.",
    "2 Add farro, water, bay leaves, thyme salt, bring to simmer: Add farro and stir to coat. Add the water, bay leaves, thyme, and salt. Raise the heat to high to bring to a simmer, then lower the heat to maintain a low simmer, cover, and let cook for 20 to 25 minutes, until the farro is cooked through.",
    "3 Prep chard, radicchio: While the farro is cooking, prep the swiss chard and radicchio.",
    "4 Remove cooked farro to a sheet pan to cool: Once the farro is done, remove the lid and check the moisture level. If there is still water in the pot, increase the heat to high to make it boil away. Then scoop out the farro onto a sheet pan to cool. At this point you can either remove the garlic cloves and discard, or keep them with the farro if you love garlic. Remove the bay leaves.",
    "5 Add olive oil, then chard, then radicchio: In the same pan that you've used to cook the farro, heat the remaining 2 tablespoons of olive oil on medium high heat.",
    "Add the swiss chard to the pan and toss to coat with the olive oil. Cook for a minute or two until the chard just begins to wilt.",
    "Then add the radicchio to the pot, sprinkle with a pinch of salt and the rosemary leaves, and toss to combine. Cook for a few minutes until the radicchio is wilted. Remove from heat.",
    "6 Stir cooked farro into wilted greens: Stir the farro back into the pot with the swiss chard and radicchio. Taste for seasoning, add more salt if needed, and serve."
  ],
  "ingredients": [
    "0",
    "4 Tbsp olive oil, divided 2 Tbsp and 2 Tbsp",
    "1 medium onion, diced, about 1 1/2 cups",
    "6 garlic cloves, peeled and lightly crushed",
    "1 teaspoon kosher salt",
    "2 cups (1/2 pound) pearled farro",
    "4 cups water",
    "1 teaspoon minced fresh thyme leaves, or 1/2 teaspoon dried thyme",
    "2 bay leaves",
    "2 cups sliced swiss chard (center ribs removed)",
    "2 cups sliced radiccio",
    "1 teaspoon minced fresh rosemary, or 1/2 teaspoon dried rosemary"
  ],
  "__v": 1
}