{
  "hash": "d146195fefb8d14b75a873417bd8494a886dc7d7",
  "title": "Marinated Roasted Red Bell Peppers",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2009/08/marinated-roasted-red-bell-peppers-vertical-a-640.jpg",
  "href": "https://www.simplyrecipes.com/recipes/marinated_roasted_red_bell_peppers/",
  "extension": "",
  "firstAdded": "2018-01-27T23:56:14.453000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 If you are canning for shelf storage (and not just chilling in the refrigerator), place a steaming rack at the bottom of a large (12-qt) pot, fill half way with water, bring to a boil. It takes a while to get a large pot of water to boil, so while the water is heating, proceed with the recipe.",
    "2a Broiler Method Position rack in oven so that the top surface of bell peppers placed in the oven will be 4-5 inches from the broiler heat element. Rub the surface of the peppers with a little olive oil (this will help them blister faster). Preheat broiler on high. Place peppers either directly on the top oven rack, with a pan to catch the drippings on a rack beneath, or place on a aluminum-foil or Silpat lined broiler pan (a cookie sheet will warp). As the surface of the peppers blister and blacken, turn them with tongs so that they will blacken on all sides.",
    "2b Stovetop Method If you have a gas range (or grill) you can place the peppers directly on the range top so that the flames lick the peppers. Work carefully so that as soon as one section of a pepper is blackened, you turn it to work on a fresh side. If you have an electric stove, heat a cast iron pan on high and place the peppers in the pan, allowing the peel to blister and blacken, turning so that all sides get blackened.",
    "3 When the peppers are all well blistered and blackened, place in a non-reactive bowl and cover. (The steam from the hot peppers will help dislodge the skins.) Once the peppers have cooled enough to handle, work with them one by one over a plate, gently peel off the blackened skins. Cut the peppers in half and remove and discard the seed pods, stems and all seeds.",
    "4 Heat lemon juice, white vinegar, olive oil, garlic, and salt, in a saucepan until boiling.",
    "5 Dip canning jars and lids in the boiling water from step 1. Distribute the peppers evenly among the jars. Pour the hot vinegar mixture over the peppers to cover (try to make sure some garlic gets in each jar). Leave 1/2-inch head space on the jars. Wipe the rims with a clean, dampened paper towel. Place on lids and rings (do not tighten rings tight).",
    "At this point you can store in the refrigerator for several weeks. If you want longer storage, or shelf storage, proceed.",
    "6 Place filled jars in boiling water on a rack (from step 1). (Helps to use tongs and wear thick rubber gloves). Water should cover jars by at least an inch. Boil for 15 minutes. Let cool in pot for several minutes, remove. Let cool completely. You should hear the jars \"pop\" as the lids seal. If a jar does not seal, store it in the refrigerator and use up within a few weeks. Otherwise the jars should last a year."
  ],
  "ingredients": [
    "0",
    "4 pounds firm, fresh, clean red bell peppers",
    "1 cup bottled lemon juice*",
    "2 cups white vinegar (5%)",
    "1 cup olive oil + additional for roasting the peppers",
    "2 cloves garlic, quartered",
    "1 1/2 teaspoons salt",
    "3 pint canning jars"
  ],
  "__v": 1
}