{
  "hash": "885d51d7f43c976af015daf814a278af5533eb52",
  "title": "Roasted Eggplant Banh Mi",
  "image": "http://chocolateforbasil.com/wp-content/uploads/2016/01/IMG_1967.jpg",
  "href": "http://chocolateforbasil.com/roasted-eggplant-banh-mi/",
  "extension": "Chrome",
  "firstAdded": "2018-12-10T18:31:40.530000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Pickle the Veggies: In a bowl or container, whisk together the wine vinegar and sugar and then add the prepper carrot, cucumbers, and radishes and allow them to pickle while you make the eggplant.",
    "Marinate and Roast the Eggplant: Preheat the oven to 400 degrees and line a sheet pan with parchment paper.",
    "In a bowl, whisk together the soy sauce, rice wine vinegar, agave, minced ginger, minced garlic, sriracha or chili paste, oil, and pepper. Spread the eggplant slices on the sheet pan, and drizzle over the marinade making sure to flip and rub in the liquid so everything is coated well. Place in the oven to roast for 15 minutes or until browned, flipping halfway through.",
    "Remove them from the oven and allow them to cool.",
    "In a separate bowl, mash the avocado until it turns to a paste, add the fresh lime juice, and salt to taste.",
    "Slice the baguettes in half horizontally, spread the avocado onto the bottom, and lay over the roasted eggplant. Add the pickled veggies, sliced jalapenos, snap peas, and cilantro. Top with the other side of the bread, give a squeeze of more lime juice, and serve!"
  ],
  "ingredients": [
    "0",
    "Roasted Eggplant",
    "1 large eggplant, sliced lengthwise into 4 thick pieces, about 1 inch thick",
    "3 TBSP soy sauce",
    "3 TBSP rice wine vinegar",
    "2 tbsp agave, or other sweetener",
    "1 inch ginger, peeled and minced",
    "1 clove garlic, minced",
    "1 Tbsp sriracha or chili paste",
    "1 Tbsp mild cooking oil (vegetable, avocado, sunflower, canola, peanut, etc.)",
    "pepper to taste",
    "Pickled Veggies",
    "1 large carrot, peeled and cut into thin sticks",
    "2 mini seedless cucumbers, cut into thin sticks",
    "3 radishes, thinly sliced",
    "2 TBSP rice Wine vinegar",
    "1 TBSP Agave, or other sweetener",
    "1 avocado",
    "juice of 2 limes, plus more wedges for serving",
    "salt to taste",
    "1 jalapeno, seeds and ribs removed, sliced",
    "handful of sugar snap peas (optional)",
    "handful cilantro leaves, roughly chopped",
    "2, 6-inch baguettes, freshly baked"
  ],
  "__v": 1
}