{
  "hash": "88a29176bbc0c9c3b0c4342f9f0dd7e539cf858d",
  "title": "Healthy Chipotle Sweet Corn Fettuccine",
  "image": "https://pinchofyum.com/wp-content/uploads/2013/08/corn-fettuccine-51.jpg",
  "href": "https://pinchofyum.com/healthy-chipotle-sweet-corn-fettuccine",
  "extension": "Firefox",
  "firstAdded": "2018-11-13T05:19:24.854000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Corn: bring a large pot of water to boil. Place the ears of sweet corn in the pot, cover, and remove from heat. Let the ears “cook” for a few minutes before taking them out and letting them cool. (This helps partially cook the corn so it’s not so raw, but this step is optional.)",
    "Corn: Cut the corn off the ears. Place the corn kernels in a large nonstick skillet over medium high heat with no oil or butter. Let the corn sit for a few minutes with stirring. Stir once, and let it sit again so that the outside of the corn gets roasty-looking. When the corn is as browned as you want it, remove from the heat.",
    "Pasta: Cook the pasta according to package direction. Keep a little bit of the pasta water.",
    "Sauce: Melt the butter in a small saucepan over medium low heat. Add the garlic and saute until soft and fragrant, about 2 minutes. Don’t burn the garlic – it will taste bad. Add the flour and stir for 1 minute. Whisk in the milk, half and half, salt, and corn water until the sauce is smooth. Finally stir in the Greek yogurt and the chipotle pepper. Combine the sauce, pasta, and corn in one large pot. Add extra Greek yogurt or pasta water to get the desired consistency for your sauce. Sprinkle with cilantro for serving. Basil would be nice, too."
  ],
  "ingredients": [
    "0",
    "4-6 ears of fresh sweet corn",
    "1 lb. uncooked fettuccine noodles",
    "3 tablespoons salted butter",
    "1 teaspoon garlic",
    "1/4 cup flour",
    "1 cup milk",
    "1/2 cup half and half",
    "1/2 teaspoon salt",
    "3/4 cup water (the stuff that you boiled the corn in is best)",
    "1/2 cup Greek yogurt – I used Chobani plain low fat",
    "1 single chipotle pepper in adobo sauce, minced",
    "cilantro for serving"
  ],
  "__v": 1
}