{
  "hash": "d465cf64e89664916c8f70b5941954e6910f5e27",
  "title": "BBQ Pulled Carrot Tacos",
  "image": "https://yupitsvegan.com/wp-content/uploads/2017/03/bbq-pulled-carrot-tacos-vegan-square-150x150.jpg",
  "href": "https://yupitsvegan.com/bbq-pulled-carrot-tacos/",
  "extension": "",
  "firstAdded": "2017-11-25T03:08:58.668000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the BBQ pulled carrots:",
    "Heat the oil over medium-high heat in a large, deep skillet. When hot, add the shredded carrot and quickly stir to distribute the oil. Sprinkle with salt and pepper. Cook for 4-5 minutes, stirring and flipping the carrot occasionally.",
    "Once the carrot is starting to dry out and lightly brown, add the BBQ sauce and stir. Reduce the heat to medium-low and cook for 10-15 minutes, stirring occasionally, or until the carrot is cooked to your preference. I like mine to still have a little bit of bite to them. Season to taste with more salt and pepper, hot sauce, etc.",
    "For the quick re-fried black beans:",
    "Heat the olive oil in a skillet over medium to medium-high heat. Add the onion and cook for 3 to 5 minutes, stirring frequently, until the onion is starting to brown.",
    "Add the black beans with liquid and stir. Reduce the heat to medium-low. Continue to cook, stirring occasionally (taking care to scrape around the bottom of the pan) and mashing the beans as you stir, until the mixture has thickened to your liking.",
    "Season to taste with salt and pepper.",
    "For the BBQ pulled carrot tacos:",
    "(optional, but recommended) Warm the tortillas in a skillet for 30-40 seconds per side to make them more pliable for filling.",
    "Spread a dollop of re-fried black beans onto a tortilla, then top it with a handful of the BBQ pulled carrots, and the other toppings to taste. Enjoy!",
    "Recipe Notes",
    "BEAN COOKING LIQUID: If you are using canned black beans, simply use the entire contents of can including the liquid. If you are using beans that you cooked yourself, use about 1/4 cup of reserved cooking liquid, or substitute with vegetable broth.",
    "MAKE AHEAD: Carrots and beans can be cooked in advance and reheated before serving. The beans thicken as they cool, so add a splash of liquid when you're reheating them.",
    "TOPPINGS: Mix and match your favorite toppings, but I don't recommend skipping the fresh cabbage, as it provides a little crunch which gives a needed texture contrast!"
  ],
  "ingredients": [
    "0",
    "For the BBQ pulled carrot:",
    "2 cups shredded carrot (3 to 5 carrots)",
    "1 tsp olive oil",
    "salt and pepper to taste",
    "1/2 cup BBQ sauce scant",
    "For the quick re-fried black beans:",
    "2 tsp olive oil",
    "1/2 white or yellow onion diced",
    "1 and 1/2 cups cooked black beans with liquid (see notes)",
    "salt and pepper to taste",
    "For the BBQ pulled carrot tacos:",
    "6 corn tortillas",
    "BBQ pulled carrots (above)",
    "quick re-fried black beans (above)",
    "2 avocados cubed",
    "1/4 head of purple cabbage shredded",
    "(optional) dressing or sauce of choice (I used ranch)",
    "other toppings as desired"
  ],
  "__v": 1
}