{
  "hash": "df6d44b20b2457e56d71710eb003255779c9493d",
  "title": "Spiralized Potato Latkes {Grain Free}",
  "image": "//www.everydaymaven.com/wp-content/uploads/2015/11/IMG_8070.jpg",
  "href": "http://www.everydaymaven.com/2015/spiralized-potato-latkes/",
  "extension": "",
  "firstAdded": "2016-01-01T15:28:01.869000",
  "users": [
    null
  ],
  "keywords": [
    "organic",
    "russet",
    "potatoes",
    "spiralized",
    "notes",
    "extra",
    "yellow",
    "onions",
    "cassava",
    "flour",
    "arrowroot",
    "pepper",
    "eggs",
    "avocado",
    "oil",
    "needed",
    "frying",
    "kosher",
    "salt"
  ],
  "directions": [
    "0",
    "Begin by filling a large pot with very cold water. Set aside. Peel potatoes, trim ends so each end of the potato is flat and place each potato in the cold water to keep from turning brown.",
    "Once all of the potatoes are peeled, trim ends of onions and peel. Leave whole.",
    "Set up the spiralizer with the small noodle blade and begin by placing whole peeled onions (with ends trimmed so each end is flat) on the spiralizer. Once onion is spiralized, use a knife to roughly chop every 3 to 4\". Place onion pieces in a very large bowl (large enough to hold onions and potatoes) and set aside.",
    "Remove all of the potatoes from the cold water and spiralize using the same technique as the onion above. Place the potato spirals back into the cold water as you work through the remaining potatoes so they don't turn brown.",
    "Once all of the potatoes are spiralized, drain from cold water.",
    "Gently squeeze to remove as much water as possible.",
    "Add potato pieces to the onions along with cassava flour, arrowroot and ground pepper. Do NOT add salt yet. Mix until well combined.",
    "Beat eggs in a separate dish and pour over potato mixture. Use your hands or tongs to mix until well coated.",
    "Grab two baking sheets or other large serving dishes and begin forming the latkes. Use your hands to grab a small ball of the potato mixture - about the size of golf ball - and gently squeeze until formed. Flatten with your palms and place on baking sheet in a single layer. These will seem a bit looser than old school grater latkes.",
    "1",
    "Heat a large cast iron (or stainless steel) frying pan over medium high heat. Once hot, add avocado oil so that it is 1\" high.",
    "When oil is hot, use a spatula to gently lift each latke from the baking sheet and into the frying pan. Give each latke a sprinkle with kosher salt. Do not crowd the frying pan. If you are using a 12\" frying pan, you should be able to fit 4 or 5 latkes max.",
    "Cook, undisturbed, for 5 to 6 minutes and use your spatula to gently press down before flipping over. Sprinkle the other side with kosher salt. Continue cooking an additional 5 to 6 minutes until brown.",
    "When latkes are browned and crispy, remove to a plate lined with paper towels.",
    "Give each latke a final sprinkle of salt and allow to cool.",
    "Serve warm topped with sour cream and chives or applesauce and Enjoy! *For freezing instructions, see NOTES above."
  ],
  "ingredients": [
    "0",
    "5 pounds organic russet potatoes, peeled and spiralized (see NOTES)",
    "2 extra large yellow onions, peeled and spiralized",
    "1 cup cassava flour (see NOTES)",
    "¼ cup arrowroot flour",
    "1 Tablespoon ground pepper",
    "3 large eggs",
    "1 cup avocado oil (as needed for frying)",
    "kosher salt"
  ],
  "__v": 1
}