{
  "hash": "5107fb65ba56aee7c50fc0043221882b6e45a8e9",
  "title": "Dinner Rolls from scratch",
  "image": "https://bakingwithsibella.files.wordpress.com/2011/09/047.jpg?w=656&h=418",
  "href": "https://bakingwithsibella.com/2011/09/24/dinner-rolls-from-scratch/",
  "extension": "Chrome",
  "firstAdded": "2018-12-11T13:28:02.733000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl (or a stand mixer bowl) combine and mix well all dry ingredients, add thinly sliced butter. Pour little by little water into the bowl and mix slowly for 2-3 minutes, add oil and continue mixing for the next 5 minutes.",
    "When the dough doesn’t stick to the walls of the bowl and it looks shiny and smooth, form it into a ball, cover with a clean dish towel and let it raise over night or at least 1 to 1 1/2 hour. The dough needs to double its volume.",
    "Sprinkle your working surface with flour, roll the dough into a 10 X 15 inch (25 X 35 cm) rectangle. Prepare a baking sheet and line it with parchment paper. Grease your muffin pan.",
    "For the knot shaped rolls cut the dough at the shorter end into 1 in (2.5 cm) strips. Tie a strip into a knot with ends placed on the bottom. Allow some space between knots as they will raise and expand during baking.",
    "For the pull-apart rolls, form 1 inch balls, putting three together into a muffin pan.",
    "For the egg wash, lightly beat an egg with two table spoons of milk, brush over rolls and sprinkle with your favorite topping or just leave plain. Let the rolls raise for about 30-45 minutes.",
    "Pre-heat oven to 400 F (200 C) and bake about 20 minutes or until beautiful golden-brown color.",
    "*Note:",
    "For bread and rolls I always use “King Arthur” all-purpose or bread flour. I think it is the best flour on US market.",
    "If you like sweeter rolls add 2 more tbsp of sugar into the dough.",
    "Bon Appetite!"
  ],
  "ingredients": [
    "0",
    "4 cups ( 512 g) all-purpose flour*",
    "2/3 cup (75 g) dry milk powder",
    "1 pack of active dry yeast",
    "1 tbsp sugar*",
    "1 1/2 tsp salt",
    "3 tbsp (42 g) butter (room temperature)",
    "2 tbsp vegetable oil",
    "about 2 1/4 cup (500 ml) warm water"
  ],
  "__v": 1
}