{
  "hash": "13f08c27188a96307f61d586a37696313d1264ef",
  "title": "Ginger Ginger Cookies",
  "image": "https://www.washingtonpost.com/rf/image_982w/2010-2019/WashingtonPost/2017/11/28/Others/Images/2017-11-08/foodlab015.JPG",
  "href": "https://www.washingtonpost.com/recipes/ginger-ginger-cookies/16199/?tid=a_inl&utm_term=.dd6003fc4ecc",
  "extension": "Firefox",
  "firstAdded": "2017-12-23T18:21:40.701000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Whisk together the flour, baking soda, salt, cinnamon, ginger, cloves and nutmeg in a medium bowl.",
    "Combine the oil, molasses, brown sugar and egg in the bowl of a stand mixer or use a handheld electric mixer; beat for about 20 seconds on medium speed until smooth. Reduce the speed to low; add the flour mixture, beating just long enough to form a dough with no trace of dry ingredients.",
    "Divide the dough in half, and place each portion on a large piece of plastic wrap. Shape each one into a 12-inch log, then sprinkle 1 1/2 tablespoons of the granulated sugar over each one, rolling it back and forth until evenly coated. Next, use half the chopped crystallized ginger to sprinkle over the logs; roll them back and forth to press in and coat evenly. Wrap in plastic wrap and seat each log inside one of the split cardboard tubes. Refrigerate for 3 hours, or up to overnight.",
    "When ready to bake, preheat the oven to 350 degrees. Line a few baking sheets with parchment paper or silicone liners.",
    "Unwrap the logs. Cut each one into 12 equal slices, spacing them on the baking sheets at least 1 inch apart. Sprinkle them with the remaining granulated sugar and the remaining chopped crystallized ginger. Bake (middle rack) one sheet at a time, for 10 minutes, until they flatten a bit and cracks form on the tops. Let cool on the baking sheet for 10 minutes, then transfer the cookies to a wire rack to cool completely."
  ],
  "ingredients": [
    "0",
    "2 cups flour",
    "2 teaspoons baking soda",
    "1/2 teaspoon salt",
    "1 teaspoon ground cinnamon",
    "1 teaspoon ground ginger",
    "1 teaspoon ground cloves",
    "1 teaspoon freshly grated nutmeg",
    "1/2 cup canola oil",
    "1/4 cup molasses",
    "1 cup packed dark brown sugar",
    "1 large egg",
    "4 tablespoons granulated sugar",
    "1/2 cup crystallized ginger, coarsely chopped"
  ],
  "__v": 1
}