{
  "hash": "db5249fc346b4cf7a646b784cd2cfb30c2a3f2c8",
  "title": "Broccoli, Extra Sharp Cheddar, and Bacon Quiche",
  "image": "http://www.fortheloveofcooking.net/wp-content/uploads/2016/09/DSC_7224Broccoli-Extra-Sharp-Cheddar-and-Bacon-Quiche.jpg",
  "href": "http://www.fortheloveofcooking.net/2016/09/broccoli-extra-sharp-cheddar-and-bacon-quiche.html",
  "extension": "Chrome",
  "firstAdded": "2017-03-13T16:12:17.019000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 375 degrees.",
    "Steam the broccoli in a steamer over boiling water for a couple of minutes, or until fork tender.",
    "While the broccoli is steaming, cook the bacon in a skillet over medium heat until crisp and cooked. Place on a paper towel to drain grease then cut into crumbles.",
    "Remove all but 1-2 teaspoons of bacon grease from the skillet (or use olive oil) then add the onion. Cook, stirring often, for 4-5 minutes, or until softened and golden brown.",
    "Coat a pie pan with cooking spray then carefully unroll the pre-made pie crust and place it in the pie pan. Crimp the edges.",
    "Combine the eggs, milk, sea salt, and freshly cracked pepper, to taste, together in a bowl and whisk until very well combined.",
    "Sprinkle most of the chopped steamed broccoli, onions, crumbled bacon, and extra sharp cheddar in the bottom of the pie.",
    "Add the well whisked egg mixture.",
    "Sprinkle the remaining broccoli, bacon, cheese, and caramelized onions on top.",
    "Carefully place into the oven and bake for 40 minutes, or until the top is set and not wiggly and the eggs are cooked through. Don’t overcook!",
    "Let the quiche cool for at least 15 minutes before slicing and serving. Enjoy."
  ],
  "ingredients": [
    "0",
    "2 cups broccoli florets, steamed until for tender, then chopped coarsely",
    "2 slices of bacon, cooked & crumbled",
    "1-2 tsp olive oil (or bacon grease)",
    "½ sweet yellow onion, finely diced",
    "1 pre-made pie crust, unrolled",
    "1½ cup extra sharp white cheddar, shredded",
    "5 eggs",
    "1½ cups milk",
    "Sea salt and freshly cracked pepper, to taste"
  ],
  "__v": 1
}