{
  "hash": "feacf0c0ec552c7068b45b3f4c7280bb40d75e1f",
  "title": "Strawberry Habanero Jam",
  "image": "http://sharedappetite.com/wp-content/uploads/2013/06/IMG_7874-3.jpg",
  "href": "http://sharedappetite.com/breakfast/strawberry-habanero-jam/",
  "extension": "Chrome",
  "firstAdded": "2016-01-03T01:08:01.779000",
  "users": [
    null
  ],
  "keywords": [
    "strawberries",
    "washed",
    "hulled",
    "habaneros",
    "seeds",
    "sugar",
    "lemon",
    "juiced",
    "apple",
    "cider",
    "vinegar",
    "pouch",
    "fruit",
    "pectin",
    "use",
    "certo",
    "make",
    "sure",
    "measure",
    "probably",
    "pints",
    "wear",
    "gloves",
    "mincing",
    "usually",
    "makeshift",
    "mitten",
    "plastic"
  ],
  "directions": [
    "0",
    "Using a potato masher or your hands, crush the strawberries in a large bowl, leaving some bits of the fruit for a good textured jam. Measure out 4 cups of crushed strawberries into a pot.",
    "Stir sugar into fruit, along with the habanero, lemon juice, and apple cider vinegar.",
    "**I know 7 cups of sugar is a lot, but it is necessary for the jam to set properly.",
    "Over high heat, bring mixture to a full rolling boil, which is a boil that doesn't stop boiling when stirred. Stir in pectin quickly and return to a full rolling boil for exactly 1 minute, stirring constantly.",
    "Remove from heat and spoon off any foam with a metal spoon.",
    "From this point, either:",
    "Ladle jam into jars (a funnel helps this process) and let cool. Once cooled, keep refrigerated. Jam will keep for a few weeks refrigerated.",
    "or",
    "Ladle jam into jars and process jars according to the following canning tutorial:",
    "Canning 101: Part 1",
    "Canning 101: Part 2"
  ],
  "ingredients": [
    "0",
    "4 cups crushed strawberries, washed and hulled*",
    "3 habaneros, seeds removed and finely minced**",
    "7 cups sugar",
    "1 lemon, juiced",
    "1 tablespoon apple cider vinegar",
    "1 pouch of Liquid Fruit Pectin (I use Certo)",
    "*make sure to measure out the strawberries crushed. It will probably take between 3 to 4 pints of whole strawberries.",
    "**make sure to wear plastic gloves when mincing the habaneros. I usually just make a makeshift plastic \"mitten\" with a plastic bag."
  ],
  "__v": 1
}