{
  "hash": "f2b2def094c6aae1cdc5059a4f270300212128c6",
  "title": "Buffalo Chicken Soup Recipe - Instant Pot Pressure Cooker",
  "image": "https://www.wholesomeyum.com/wp-content/uploads/2018/01/wholesomeyum-low-carb-buffalo-chicken-soup-recipe-1-150x150.jpg",
  "href": "https://www.wholesomeyum.com/recipes/low-carb-buffalo-chicken-soup-recipe/",
  "extension": "Firefox",
  "firstAdded": "2019-04-08T20:44:45.146000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Instant Pot / Pressure Cooker Instructions",
    "Press the Saute button on the Instant Pot. Add the oil, chopped onion, and celery. Cook for about 5-10 minutes, stirring occasionally, until onions are translucent and start to brown.",
    "Add garlic. Saute for about a minute, until fragrant. Press the Off button.",
    "Add the shredded chicken, broth, and buffalo sauce.",
    "Cover and seal the Instant Pot. Press the Soup button and adjust time to 5 minutes. After cooking is complete, let pressure release naturally for 5 minutes, then switch to quick release and open the lid.",
    "Ladle about a cup of liquid (without chicken) from the edge of the Instant Pot and pour into a blender. Add the cubed cream cheese. Puree until smooth. (If it's hard to blend, you can add a little more liquid.)",
    "Pour the mixture back into the Instant Pot. Add the half & half or heavy cream. Stir until smooth.",
    "Crock Pot / Slow Cooker Instructions",
    "Heat the oil in a pan over medium heat. Add the chopped onion, and celery. Cook for about 5-10 minutes, stirring occasionally, until onions are translucent and start to brown.",
    "Add garlic. Saute for about a minute, until fragrant.",
    "Place the shredded chicken, broth, and buffalo sauce to the slow cooker. Add all the ingredients from the pan and stir.",
    "Cook for 3-4 hours on low.",
    "Ladle about a cup of liquid (without chicken) from the edge of the slow cooker and pour into a blender. Add the cubed cream cheese. Puree until smooth. (If it's hard to blend, you can add a little more liquid.)",
    "Pour the mixture back into the slow cooker. Add the half & half or heavy cream. Stir until smooth."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Click on the underlined text below to buy ingredients!",
    "1 tbsp Olive oil",
    "1/2 large Onion (diced)",
    "1/2 cup Celery (diced)",
    "4 cloves Garlic (minced)",
    "1 lb Shredded chicken (cooked)",
    "4 cup Chicken bone broth (or any chicken broth)",
    "3 tbsp Buffalo sauce (or 2 tbsp for less heat)",
    "6 oz Cream cheese (at room temperature, cubed)",
    "1/2 cup Half & half (or heavy cream)"
  ],
  "__v": 2
}