{
  "hash": "dfcba18f01ca5d58e4eb9b76c252d3ec3dc36e22",
  "title": "Kale with Seaweed, Sesame and Ginger",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2006/01/kale-seaweed-sesame-ginger-horiz-a-1800.jpg",
  "href": "https://www.simplyrecipes.com/recipes/kale_with_seaweed_sesame_and_ginger/",
  "extension": "",
  "firstAdded": "2018-01-28T20:18:56.471000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Prepare the seaweed: Rinse the seaweed in water and let soak, covered in water for 5-7 minutes.",
    "Drain seaweed and place in a large bowl. Add 1 teaspoon of dark sesame oil and the minced ginger.",
    "2 Prepare kale by soaking in water to loosen any dirt, rinsing thoroughly. Chop cross-wise into 1-inch by 2-inch pieces.",
    "3 Sauté garlic, then seaweed and ginger: In a large covered skillet, uncover and heat 1 Tbsp of vegetable oil on medium heat. Add garlic and gently sauté for one minute, until fragrant. Add the seaweed and ginger, gently cook for 1 minute. Remove seaweed/ginger/garlic from pan back to the bowl and set aside.",
    "4 Sauté kale: Add another 1 Tbsp oil to the skillet. When the oil is hot, add the chopped kale. Add 1 Tbsp soy sauce. Gently mix in the pan to coat the kale with the oil and soy sauce. Cover; lower heat to low; let cook for 5-10 minutes or until kale is wilted - soft enough to eat easily, but not so soft as to be mushy.",
    "Remove cover and let cook a minute more to evaporate any excess moisture. Remove from heat.",
    "5 Mix in the kale with the seaweed ginger mixture. Add more dark sesame oil and soy sauce to taste. Garnish with toasted sesame seeds."
  ],
  "ingredients": [
    "0",
    "1/2 cup dried arame sea vegetables (food-grade seaweed)",
    "3 Tbsp vegetable oil",
    "1 teaspoons dark (roasted) sesame oil",
    "1 Tbsp peeled and minced ginger",
    "1 bunch kale (we used dinosaur kale)",
    "1 Tbsp minced garlic",
    "1 Tbsp soy sauce (can sub with Bragg Liquid Aminos)",
    "1 Tbsp Toasted sesame seeds"
  ],
  "__v": 1
}