{
  "hash": "72a77cbfb8b66aca9ad7041c3ad0ef8ac26cbbb7",
  "title": "Gluten Free Chai Apple Cake with Pinenuts (Dairy Free, Gluten Free)",
  "image": "http://i2.wp.com/willfrolicforfood.com/wp-content/uploads/2014/09/apple-chai-cake-pinenuts-gluten-free-9502.jpg?resize=682%2C1024",
  "href": "http://willfrolicforfood.com/2014/09/gluten-free-chai-apple-cake-with-pinenuts-dairy-free.html",
  "extension": "",
  "firstAdded": "2015-11-12T01:25:56.821000",
  "users": [
    null
  ],
  "keywords": [
    "organic",
    "sugar",
    "cardamom",
    "ginger",
    "cinnamon",
    "unsalted",
    "vegan",
    "butter",
    "room",
    "temp",
    "greasing",
    "pan",
    "chai",
    "eggs",
    "white",
    "rice",
    "flour",
    "sorghum",
    "oat",
    "oats",
    "food",
    "processor",
    "buckwheat",
    "baking",
    "salt",
    "kefir",
    "yogurt",
    "vanilla",
    "firm",
    "gala",
    "apples",
    "medium",
    "pine",
    "nuts",
    "lemon",
    "juice"
  ],
  "directions": [
    "0",
    "Position a rack in the upper third of the oven and preheat to 350ºF. Grease a 9″ springform pan with Earth Balance or coconut oil.",
    "In a small bowl, combine the powdered sugar, cardamom, ginger, black pepper, and cinnamon.",
    "In a large bowl cream together the Earth Balance and the chai sugar using an electric hand mixer on low speed until combine and light, about 3 minutes total — scraping down the sides of your mixing bowl about half way through.",
    "Add the eggs one at a time, beating until just incorporated after each addition.",
    "In a medium bowl, combine the rice, sorghum, oat, and buckwheat flours, baking powder, and fine salt.",
    "Add half of your dry ingredients to your creamed butter and fold together until just combined.",
    "Add your kefir and vanilla extract and fold together until just combined.",
    "Add the rest of your dry ingredients and fold together until just combined.",
    "Core your apples. Cut one of your apples up into 1″ cubes, enough for about a cup, give or take. Slice your other apple into wedges, a ½″ wide at the widest part. Mix these wedges with your lemon juice to prevent oxidation (this is for aesthetic purposes only).",
    "Ever so gently, add half of your apple cubes to the batter, and fold them in. Then fold in the rest.",
    "Spread your batter into your greased springform pan evenly.",
    "Place your apple wedges into your cake in a circle, creating a sort of fan with the slices, with the peel facing up. Press them into the batter slightly, just to get the batter pooling up in between the slices.",
    "Bake the cake until the top is golden and cake is set, 45-50 minutes. The sides of the cake will be just pulling away from the edges of the pan and a sharp knife in inserted into the hot cake will come out clean. Let cool to room temperature before serving.",
    "Serve this cake with ice cream or a sweet whipped cream. It really takes it to a whole new level! She’s a beaut as a breakfast cake, too, served with coffee."
  ],
  "ingredients": [
    "0",
    "¾ cup (5¾ ounces) organic powdered sugar",
    "1¼ teaspoons ground cardamom",
    "1 teaspoon ground ginger",
    "1 teaspoon cinnamon",
    "1",
    "8 tablespoons/4 ounces unsalted Vegan butter at room temp plus 1 teaspoon for greasing the pan",
    "*chai sugar",
    "2 large eggs, at room temperature",
    "¾ cup (4 ounces) sweet white rice flour",
    "¼ cup (1¼ ounces) sorghum flour",
    "¼ cup (1 ounce) oat flour (I ground whole oats in a food processor until fine)",
    "¼ cup (1 ounce) buckwheat flour",
    "2 teaspoons baking powder",
    "¼ teaspoon fine sea salt",
    "⅓ cup (2½ ounces) kefir or thin yogurt",
    "2 teaspoons vanilla extract",
    "1¼ pounds ripe but firm gala apples (about 2 medium)",
    "¼ cup pine nuts",
    "2 teaspoons lemon juice"
  ],
  "__v": 1
}