{
  "hash": "da2dc70921b31adec54aa6246eb9f2d5a89a6ac3",
  "title": "Kebab vegano di seitan",
  "image": "https://www.vegolosi.it/wp-content/uploads/2016/09/kebab-vegan_IMG_0145_650.jpg",
  "href": "https://www.vegolosi.it/ricette-vegane/kebab-vegano-ricetta/",
  "extension": "Chrome",
  "firstAdded": "2017-06-03T15:24:09.180000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepariamo il kebab",
    "Tagliate a fettine sottili il seitan al naturale in modo da ottenere degli “straccetti” e metteteli in padella con un cucchiaio di olio, un cucchiaio di spezie per kebab e 100 ml di acqua. Accendete la fiamma e mescolate per far insaporire il tutto, fino a completo assorbimento dell’acqua. Prima di spegnere continuate a far saltare il tutto per qualche minuto.",
    "Prepariamo il contorno",
    "Mentre il seitan è sul fuoco, potete preparare l’occorrente per il vostro panino. Tagliate finemente il cespo di insalata, per ottenere una julienne di insalata, lavatela sotto acqua corrente e asciugatela. Dopo aver mondato i pomodori, tagliateli a fettine spesse circa mezzo centimetro e infine tagliate anche la cipolla con una julienne finissima.",
    "…e il condimento",
    "Mondate e sbucciate il cetriolo e poi grattugiatelo finemente. Mettete la polpa ottenuta in un colino e premete con un cucchiaio per eliminare tutti i liquidi. In una ciotola versate lo yogurt e unite l’olio, l’aceto e lo spicchio di aglio tagliato a metà. Unite il cetriolo e mescolate, riponete in frigorifero per mezz’ora in modo che tutti i sapori si amalgamino per bene. Prima di servire ricordatevi di togliere i due spicchi d’aglio.",
    "Assembliamo il panino",
    "Tagliate il panino a metà lungo il lato orizzontale lasciando un lato unito e procedete con la farcita: prima l’insalata e pomodori, poi il seitan, la cipolla e per finire la salsa yogurt.",
    "Consiglio per i vegolosi: Per la versione piccante, create una salsa di pomodoro piccante con un cucchiaio di concentrato e peperoncino in polvere."
  ],
  "ingredients": [
    "0",
    "Ingredienti per 4 persone:",
    "600 g di seitan fatto a mano",
    "4 panini (tipo pita)",
    "mezza cipolla rossa",
    "mezzo cespo di insalata iceberg",
    "2 pomodori ramati",
    "spezie per kebab (paprika dolce, cumino, pepe nero, aglio, basilico, cipolla, senape)",
    "250 g di yogurt di soia al naturale",
    "1 cetriolo",
    "1 spicchio di aglio",
    "olio extra vergine di oliva",
    "aceto di mele",
    "sale"
  ],
  "__v": 1
}