{
  "hash": "9fe3e9ed5e989bd89ba1de3afeef6695b7b5d85f",
  "title": "Карамельная панакота",
  "image": "http://cook-s.ru/images/stories/deserty/karamelnaya_panakota/karamelnaya_panakota_1.jpg",
  "href": "http://cook-s.ru/karamelnaya-panakota.html",
  "extension": "Chrome",
  "firstAdded": "2015-06-30T14:23:30.360000",
  "users": [
    null
  ],
  "keywords": [],
  "directions": [
    "0",
    "Желатин замочить в холодной воде на 30-40 минут. Оптимальным соотношением «сливки-желатин» считается 500 мл сливок на 10-15 грамм желатина. В таком случае десерт не будет резиновым и, в то же самое время, будет хорошо держать свою форму и медленно таять во рту.",
    "Для приготовления карамели всыпать в глубокий сотейник сахар и специи (кардамон или корицу по вкусу). Поставить на медленный огонь и дать сахару расплавиться, не перемешивая его, а только периодически встряхивая емкость.",
    "Довести карамель до легкого коричневого цвета (но не пережечь!), снять с огня.",
    "Постепенно влить нагретые сливки. Делать это нужно именно постепенно, так как сливки, соединяясь с карамелью, начинают активно бурлить, пениться, подниматься вверх и брызгаться. Калорийность десерта можно выбрать исходя из жирности самих сливок – 10, 20 или 33%. Для тех, кто хочет минимально снизить калорийность блюд можно смешать нежирные питьевые сливки с молоком.",
    "Когда масса станет однородной – добавить желатин и ванилин, перемешать.",
    "Сливочную массу остудить и разлить в керамические или силиконовые формочки (креманки или бокалы). Поставить на охлаждение на 6-8 часов в холодильник.",
    "Затем формочки опустить на несколько секунд в теплую воду и перевернуть десерт на блюдце. Карамельная панакота готова!",
    "Подавайте с любимыми вкусными добавками!"
  ],
  "ingredients": [
    "0",
    "сливки 10, 20 или 33% – 0,5 л",
    "сахар – 120 г",
    "корица или кардамон молотый – 2-3 щепотки",
    "желатин – 2 ч.л.",
    "ванилин – 2 щепотки",
    "мята, ягоды или фрукты – по вкусу"
  ],
  "__v": 1
}