{
  "hash": "981cf1833716b85b78d4b33d3d90e3da8d8475a0",
  "title": "Braised Red Cabbage with Bacon",
  "image": "",
  "href": "http://www.chowhound.com/recipes/braised-red-cabbage-with-bacon-10712",
  "extension": "Chrome",
  "firstAdded": "2016-09-19T21:24:12.875000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "1Slice cabbage in half lengthwise. Use a sharp knife to cut a V-shaped notch around the white core and discard it. Slice both pieces in half again so you have 4 quarters, then thinly slice each piece crosswise into 1/4-inch-thick strips. Set aside.",
    "2Place bacon in a large Dutch oven or other large, heavy-bottomed pot with a tightfitting lid over medium heat and cook, stirring occasionally, until browned and most of the fat has rendered.",
    "3Add onion and stir to coat in the bacon fat. Season with salt and freshly ground black pepper and cook until the onion softens and the edges begin to brown, about 4 to 5 minutes.",
    "4Add the reserved cabbage, stir to coat in bacon fat, and cook until the cabbage begins to wilt, about 4 minutes. Stir in the brown sugar and mustard.",
    "5Deglaze the pan with the cider vinegar, scraping up any browned bits from the bottom of the pan with a spatula. Add the chicken broth and season with a few pinches of salt and more freshly ground pepper. Bring to a simmer, then reduce the heat to medium low and cover the pan tightly. Simmer, stirring occasionally, until the cabbage is soft and soupy and the bacon is tender, about 45 minutes. If the cabbage begins to look dry, add more broth or water."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS (7)",
    "1 medium head red cabbage",
    "6 thick slices applewood-smoked bacon or other smoked bacon, cut into lardons (about 1/4-by-1/4-by-3/4-inch pieces)",
    "1 medium yellow onion, thinly sliced",
    "2 tablespoons packed dark brown sugar",
    "2 tablespoons Dijon mustard",
    "1/3 cup cider vinegar",
    "1 cup low-sodium chicken broth"
  ],
  "__v": 1
}