{
  "hash": "4f83e34fd63daffde6032c408376670bcc3bd29f",
  "title": "Chocolate, Coconut, Macadamia Nut Tart Recipe (Gluten-Free, Paleo, Vegan)",
  "image": "http://gourmandeinthekitchen.com/wp-content/uploads/2013/02/Chocolate-Coconut-Macadamia-Nut-Tart-from-Gourmande-in-the-Kitchen.jpg?c3c4ca",
  "href": "http://gourmandeinthekitchen.com/2013/chocolate-coconut-macadamia-tart-recipe/",
  "firstAdded": "2015-02-05T13:46:45.363000",
  "users": [
    null
  ],
  "keywords": [
    "cupg",
    "coconut",
    "cupsg",
    "almond",
    "flour",
    "oil",
    "salt",
    "maple",
    "syrup",
    "fat",
    "milk",
    "ozg",
    "bittersweet",
    "chocolate",
    "vanilla",
    "raw",
    "macadamia",
    "nuts",
    "coarsely"
  ],
  "directions": [
    "0",
    "Preheat oven to 350 degrees. In a food processor, pulse together almond flour, salt and shredded coconut until finely ground. Melt together coconut oil and maple syrup and add to almond flour and coconut mixture, pulse until coarse crumbs form (dough should clump together when squeezed with fingers).",
    "Transfer dough to a greased 9-inch tart pan with a removable bottom. Using a measuring cup or your fingers, evenly press dough in bottom and up sides of pan.",
    "Bake in center of oven until golden and firm, about 15- 20 minutes. Transfer to a wire rack to cool completely, at least 1 hour.",
    "Spread the chopped macadamia nuts and shredded coconut evenly over a sheet pan and bake until lightly golden (about 3-5 minutes). Set aside.",
    "Place chopped chocolate in a large mixing bowl. In a small saucepan, bring coconut milk to a boil. Pour hot coconut milk over chocolate and let stand 1 minute, then stir until smooth and creamy. Mix in vanilla extract.",
    "Pour chocolate into cooled tart shell. Lightly sprinkle toasted macadamia nuts and toasted coconut across the top. Sprinkle with a pinch of flaky sea salt if desired. Chill for at least one hour or until set and serve."
  ],
  "ingredients": [
    "0",
    "½ cup/40g unsweetened shredded coconut",
    "1 ½ cups/190g almond flour",
    "2 Tablespoons/ 30g coconut oil",
    "¼ tsp salt",
    "2 Tablespoons/30 g Maple Syrup",
    "1 cup/ 240ml full fat coconut milk",
    "12 oz/280g bittersweet chocolate, finely chopped",
    "1 teaspoon vanilla extract",
    "1/2 cup/40g unsweetened coconut flakes",
    "½ cup/68g raw macadamia nuts, coarsely chopped",
    "A pinch of sea salt"
  ],
  "__v": 1
}