{
  "hash": "6ea59840b732abe6761495869ff6839bd99f32be",
  "title": "MAGIC CUSTARD CAKE (魔术卡士垯蛋糕)",
  "image": "http://i302.photobucket.com/albums/nn116/daffdaffdaff/2014/mcc/DSC08385-magic-custard-cake.jpg",
  "href": "http://kitchentigress.blogspot.sg/2014/07/magic-custard-cake-video-recipe.html",
  "firstAdded": "2015-02-20T02:19:52.231000",
  "users": [
    null
  ],
  "keywords": [
    "recipe",
    "cake",
    "icing",
    "sugar",
    "egg",
    "yolks",
    "unsalted",
    "butter",
    "cool",
    "water",
    "vanilla",
    "plain",
    "flour",
    "salt",
    "fullfat",
    "milk",
    "slightly",
    "whites",
    "castor"
  ],
  "directions": [
    "0",
    "Fully line 18 x 18 x 5 cm 1-piece cake pan with parchment paper measuring 30 x 30 cm, without cutting corners of paper. Preheat oven to 160°C. Measure and prep ingredients as detailed above.",
    "Sift icing sugar into mixing bowl. Add egg yolks. Whisk till mixture is ivory pale. Add melted butter, water and vanilla extract. Whisk till combined. Sift plain flour into mixture. Add salt. Whisk till just evenly mixed. Add milk. Whisk till evenly mixed.",
    "Separately whisk egg whites on high speed till thick foam forms. Add castor sugar. Continue whisking at high speed till egg whites are at stiff peak stage – i.e. when whisk is lifted, egg whites form peak that's straight, not hooked – and a bit grainy. Add to yolk mixture. Mix with whisk till fully combined. Scrape down with spatula and mix till even.",
    "Pour batter into cake pan. Level top with spatula. Bake till golden brown and edges of cake don't squish when pressed gently, about 50 minutes. Remove cake from oven. Unmould by lifting cake out of pan. Serve hot (cake may be cut hot from the oven if you use a serrated knife), warm, at room temperature or slightly chilled."
  ],
  "ingredients": [
    "0",
    "(Recipe for one 18 x 18 cm cake)",
    "75 g icing sugar",
    "45 g egg yolks",
    "85 g unsalted butter, melted and cool",
    "12 g water",
    "3/4 tsp vanilla extract",
    "85 g plain flour",
    "1/16 tsp salt",
    "360 g full-fat milk, slightly warm",
    "105 g egg whites",
    "20 g castor sugar"
  ],
  "__v": 2
}