{
  "hash": "2624ad05dae0752caabf3b432bdc537c36ef9827",
  "title": "Maid-Rite Pork Tenderloin Sandwiches",
  "image": "",
  "href": "http://www.cdkitchen.com/recipes/recs/700/Maid-Rite-Pork-Tenderloin-Sand97113.shtml",
  "extension": "",
  "firstAdded": "2015-04-23T07:50:24.924000",
  "users": [
    null
  ],
  "keywords": [
    "size",
    "pork",
    "tenderloin",
    "buttermilk",
    "eggs",
    "purpose",
    "flour",
    "salt",
    "black",
    "pepper",
    "dry",
    "mustard",
    "clove",
    "garlic",
    "cayenne",
    "panko",
    "japanese",
    "bread",
    "crumbs",
    "yellow",
    "corn",
    "meal",
    "breading",
    "canola",
    "oil",
    "buns"
  ],
  "directions": [
    "0",
    "Cut a tenderloin into equal serving pieces, then butterfly each piece. Pound the pieces so they are about 4 inches by 10 inches. (This is to get the classic \"hang over the bun\" look.)",
    "Mix together the eggs, buttermilk, 1/4 cup of the flour, salt pepper, garlic dry mustard and pinch of cayenne. Place the tenderloin pieces in the buttermilk and marinate overnight.",
    "To cook, preheat a deep fat fryer to 360 degrees F. Combine the panko and cornmeal. Remove tenderloin from the marinade and let excess drip off. Press the meat into the panko/cornmeal combination. Fry immediately for 3 minutes or until golden brown. Serve on a bun with mayo, tomato, lettuce and mustard.",
    "Terry's Notes: This is my version. I use Panko bread crumbs because they always give me the best crunch. Most of the time I just dip the pounded tenderloin into the flour, then into some egg with a Tablespoon of dijon mustard, then into the panko. Deep fry and serve on a bun with lots of ball park mustard. But here is the original Pork Tenderloin Sandwich. I believe that Maid-Rite was a restaurant chain."
  ],
  "ingredients": [
    "0",
    "1 (20-24 ounce size) pork tenderloin",
    "1 quart buttermilk",
    "2 whole eggs",
    "1/4 cup all purpose flour",
    "1 pinch each salt and black pepper",
    "1 tablespoon dry mustard",
    "1 clove garlic, freshly chopped",
    "1 pinch cayenne pepper",
    "3 cups panko (Japanese bread crumbs)",
    "1/4 cup yellow corn meal for breading",
    "1 quart canola oil",
    "4 buns"
  ],
  "__v": 1
}