{
  "hash": "c8dba19defdf36d3c8857c8c4ad0c4dcf1b926e3",
  "title": "Fish pie",
  "image": "//www.bbcgoodfood.com/sites/default/files/styles/recipe/public/user-collections/my-colelction-image/2015/12/recipe-image-legacy-id--1001520_10.jpg?itok=i9aYFHY5",
  "href": "https://www.bbcgoodfood.com/recipes/fish-pie-four-steps",
  "extension": "Chrome",
  "firstAdded": "2020-02-12T21:26:37.569000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Poach 400g skinless white fish fillets and 400g skinless smoked haddock fillets. Put the fish in the frying pan and pour over 500ml of the full-fat milk. Quarter 1 small onion and stud each quarter with a clove, then add to the milk, with 2 bay leaves. Bring the milk just to the boil – you will see a few small bubbles. Reduce the heat and simmer for 8 mins. Lift the fish onto a plate and strain the milk into a jug to cool. Flake the fish into large pieces in the baking dish.",
    "Hard-boil 4 eggs. Bring a small pan of water to a gentle boil, then carefully lower the eggs in with a slotted spoon. Bring the water back to a gentle boil, with just a couple of bubbles rising to the surface. Set the timer for 8 mins, cook, then drain and cool in a bowl of cold water. Peel, slice into quarters and arrange on top of the fish, then scatter over the chopped leaves of a small bunch of parsley.",
    "Make the sauce. Melt 50g butter in a pan, stir in 50g plain flour and cook for 1 min over moderate heat. Take off the heat, pour in a little of the cold poaching milk, then stir until blended. Continue to add the milk gradually, mixing well until you have a smooth sauce. Return to the heat, bring to the boil and cook for 5 mins, stirring continually, until it coats the back of a spoon. Remove from the heat, season with salt, pepper and a pinch of freshly grated nutmeg, then pour over the fish.",
    "Assemble and bake. Heat oven to 200C/fan 180C/gas 6. Boil 1kg floury potatoes, cut into even-sized chunks, for 20 mins. Drain, season and mash with the remaining 50g butter and 100ml full-fat milk. Use to top the pie, starting at the edge of the dish and working your way in – push the mash right to the edges to seal. Fluff the top with a fork, sprinkle over 50g grated cheddar, then bake for 30 mins. Make up to a day ahead, chill, then bake for 40 mins."
  ],
  "ingredients": [
    "0",
    "400g skinless white fish fillet",
    "400g skinless smoked haddock fillet",
    "600ml full-fat milk Milk mill-kOne of the most widely used ingredients, milk is often referred to as a complete food. While cow…",
    "1 small onion Onion un-yunOnions are endlessly versatile and an essential ingredient in countless recipes. Native to Asia… , quartered",
    "4 cloves Clove klo-veThe dry, unopened flower bud of the tropical myrtle tree family used to flavour a wide variety…",
    "2 bay leaves",
    "4 eggs Egg eggThe ultimate convenience food, eggs are powerhouses of nutrition packed with protein and a…",
    "small bunch parsley Parsley par-sleeOne of the most ubiquitous herbs in British cookery, parsley is also popular in European and… , leaves only, chopped",
    "100g butter Butter butt-errButter is a dairy product made from separating whole milk or cream into fat and…",
    "50g plain flour",
    "pinch freshly grated nutmeg Nutmeg nut-megOne of the most useful of spices for both sweet and savoury…",
    "1kg floury potato Potato po-tate-ohThe world's favourite root vegetable, the potato comes in innumerable varieties. A member of… , peeled and cut into even-sized chunks",
    "50g cheddar Cheddar Ched-ahOnce cheddar was 'Cheddar', a large, hard-pressed barrel of cheese made by a particular… , grated"
  ],
  "__v": 1
}