{
  "hash": "ab56b40e3ae33a5c4f7eac67d5936e92cbe94ad0",
  "title": "Heavenly Harira",
  "image": "http://serenae.com/wp-content/uploads/2011/08/harira1.jpg",
  "href": "http://serenae.com/2011/08/19/heavenly-harira/",
  "extension": "Chrome",
  "firstAdded": "2015-06-23T12:00:34.472000",
  "users": [
    null
  ],
  "keywords": [
    "tomato",
    "lentils",
    "chickpeas",
    "rice",
    "vermicelli",
    "parsley",
    "saffron",
    "black",
    "pepper",
    "cumin",
    "paprika",
    "ginger",
    "flour",
    "bouillon",
    "cube",
    "chicken",
    "stock",
    "oil"
  ],
  "directions": [
    "0",
    "Chop the parsley. Rinse and drain the chickpeas (if using canned) then remove the skins. Rinse your lentils in cold water.",
    "Heat the vegetable oil in a large pot. Add the chickpeas to the hot oil, stirring frequently. Add your lentils, reduce heat to medium/low. Rinse the rice in cold water, then add to the pot. Keep stirring!",
    "In a small bowl, blend the tomato paste with 2 tablespoons of cold water until smooth.7 Mix into the pot. Add saffron. Add 1 1/2 cups of water and stir well. (This is where it starts to smell very good.)",
    "Add the pepper, parsley, cumin, paprika, ginger, and vermicelli. Add another 2.5 cups of water and bring to a boil. (At this stage, neighbors will be knocking on your door demanding to know why you are torturing them with delicious smells.)",
    "Crumble in your bouillon cube. Simmer for 10 minutes. If it’s too thin, dissolve 2 tablespoons of flour in 1 cup of warm water. Squish any lumps and add the mixture to your soup. I usually find that I don’t need to do this, as the soup is pretty thick on its own at this point.8 Simmer, covered, for 30 minutes or until everything is cooked. (Taste the lentils and chickpeas, as they’ll be the slowest to cook.)"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "1 small can tomato paste (70g or 2.5oz)",
    "1 cup lentils",
    "1/2 can chickpeas3",
    "2/3 cup rice",
    "1/2 cup rice vermicelli",
    "1 cup parsley",
    "1 packet saffron (1/2 tsp)4",
    "1/2 tsp ground black pepper",
    "1/2 tsp cumin",
    "1/2 tsp paprika",
    "1/2 tsp ginger",
    "2 tbsp flour",
    "1 bouillon cube5 or 1 cup chicken stock6",
    "2 tbsp vegetable oil"
  ],
  "__v": 1
}