{
  "__v": 1,
  "directions": [
    "0",
    "Bring a large pot of salted water to a boil.",
    "While water is boiling prepare hash ingredients.",
    "Rinse green onions, chop off white roots and slice into thin rounds.",
    "Clean asparagus, chop approximately one inch off the bottoms and discard. Chop remaining asparagus into 1\"pieces.",
    "Once water has come to a full boil cook potatoes for 5-7 minutes or until slightly soft.",
    "After 5 minutes add asparagus to potatoes and cook for remaining 2 minutes.",
    "Sauté green onions in 1 tablespoon coconut oil over med-low heat, adding 1 hearty pinch of salt.",
    "Drain sweet potatoes and asparagus.",
    "Combine asparagus and sweet potatoes with the green onions adding an additional 1 tablespoon of coconut oil, .5 teaspoons of salt and some fresh cracked pepper.",
    "Sauté over med heat, turning every 4-5 minutes, allowing vegetables time to brown. Add an additional 1 tablespoon of coconut oil if vegetables begin to stick or become dry.",
    "Plate as desired and top with chimichurri sauce.",
    "Chimichurri Sauce: In a small mixing bowl combine parsley, cilantro, garlic, shallots, lemon juice, olive oil, vinegar and 3/4 teaspoon salt (more to taste), stir thoroughly. This is best if made in advance and given time for the flavors to develop!)"
  ],
  "firstAdded": "2014-07-10T22:28:37.375000",
  "hash": "fb660957937177e8ae917308a5269aebf7bf7ebd",
  "href": "http://ahouseinthehills.com/2014/04/23/asparagus-and-sweet-potato-hash-with-chimichurri/",
  "image": "http://ahouseinthehills.com/wp-content/uploads/2014/04/Asparagus_sweet_potato_hash_a_house_in_the_hills_100.jpg",
  "ingredients": [
    "0",
    "3 small white sweet potatoes (approximately 5 cups chopped)",
    "1 large bunch of asparagus",
    "5 medium green onions",
    "2 tablespoons coconut oil",
    "1 scant cup of wide leaf parsley, finely chopped",
    "1.5 full cups of cilantro, finely chopped",
    "3 large cloves of garlic, crushed",
    "5 tablespoons finely minced shallot",
    "2 tablespoons fresh lemon juice",
    "1 1/2 cups high quality olive oil",
    "1/4 cup red wine vinegar",
    "salt",
    "pepper"
  ],
  "keywords": [
    "white",
    "potatoes",
    "bunch",
    "asparagus",
    "medium",
    "green",
    "onions",
    "coconut",
    "oil",
    "scant",
    "wide",
    "leaf",
    "parsley",
    "cilantro",
    "garlic",
    "shallot",
    "lemon",
    "juice",
    "high",
    "quality",
    "olive",
    "red",
    "wine",
    "vinegar",
    "salt",
    "pepper"
  ],
  "title": "ASPARAGUS AND SWEET POTATO HASH WITH CHIMICHURRI",
  "users": [
    null
  ]
}