{
  "hash": "c3ce7861b7b33bfd067686ee68202bda7f69663b",
  "title": "Citrus Chicken with Raspberry Barbecue Sauce",
  "image": "//media.foodnetwork.ca/recipetracker/5a955125-626c-44ee-9aec-5eab3957a3e3_Citrus-chicken-with-raspberry-barbecue-sauce_WebReady.jpg",
  "href": "https://www.foodnetwork.ca/recipe/citrus-chicken-with-raspberry-barbecue-sauce/18058/",
  "extension": "Chrome",
  "firstAdded": "2018-08-21T11:53:51.135000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Citrus chicken: In a large bowl, whisk together the lime and orange juices, garlic, chipotle pepper, salt, pepper and honey until well combined. Transfer the marinade to a resealable plastic bag or a glass container large enough to contain the chicken. Place the chicken in the marinade and refrigerate it for at least 2 hours or overnight.",
    "1. Raspberry barbecue sauce: Melt the butter in a medium saucepan on medium heat, and add the garlic. Sauté until fragrant, about 2 minutes, and then add the raspberries and the orange juice and bring to a boil. Reduce the heat to low and add the honey and the BBQ sauce. Simmer for 20 minutes, or until the sauce becomes thickened.",
    "2. If you prefer a smooth barbecue sauce, strain the mixture through a fine-mesh sieve into a clean bowl.",
    "3. Discard any raspberry seeds or solids. For a slightly chunky sauce, just purée it, without straining it first, using an immersion blender. Or, for an even more rustic sauce, serve it as is in the pan with chunks of raspberries, seeds and all. Whichever way you choose, spoon half the sauce into a serving bowl and set aside.",
    "4. Finish chicken: Prepare your grill for indirect cooking on medium heat. Remove the chicken from the marinade, and place it on the cool side of the grill. Close the lid and cook for 30 to 45 minutes until the internal temperature of the meat reaches about 140°F. There is no need to turn the chicken if you are cooking indirectly. Using a silicone brush, glaze the chicken with the raspberry barbecue sauce. Continue cooking the chicken with the lid closed until it reaches 165°F. Remove from the grill and allow to rest for a few minutes.",
    "5. To serve, heap the chicken onto a family-style platter, and serve with the reserved raspberry barbecue sauce.",
    "1",
    "Recipe courtesy of Brian Misko, Grilling With House Of Q © 2015 Figure 1 Publishing Inc."
  ],
  "ingredients": [
    "0",
    "⅓ cup lime juice",
    "⅓ cup orange juice",
    "5 cloves garlic, crushed",
    "1 chipotle pepper (from a can of peppers in adobo sauce; use more if you want to spice it up), finely chopped",
    "1 - 2 tsp sea salt or Kosher salt",
    "1 tsp black pepper",
    "1 Tbsp honey",
    "2 - 3 lbs chicken pieces, bone-in and skin on",
    "1 Tbsp butter",
    "3 - 4 cloves garlic, crushed",
    "2 cups fresh raspberries",
    "½ cup orange juice",
    "¼ cup honey",
    "¼ cup House of Q Sugar & Spice BBQ Sauce (or more for a spicier sauce) or your favourite sweet barbecue sauce"
  ],
  "__v": 1
}