{
  "hash": "a9a7c8a01bf6717b5dccc7ae4a609c230be829b6",
  "title": "Braised Short Ribs",
  "image": "",
  "href": "http://www.foodandwine.com/recipes/braised-short-ribs",
  "extension": "Chrome",
  "firstAdded": "2015-11-04T23:43:52.752000",
  "users": [
    null
  ],
  "keywords": [
    "canola",
    "oil",
    "short",
    "ribs",
    "bones",
    "kosher",
    "salt",
    "pepper",
    "onion",
    "carrots",
    "celery",
    "garlic",
    "thickly",
    "bottle",
    "dry",
    "red",
    "wine",
    "cabernet",
    "sauvignon",
    "thyme",
    "sprigs",
    "chicken",
    "stock"
  ],
  "directions": [
    "0",
    "In a large skillet, heat the oil. Season the ribs with salt and pepper. Add them to the skillet and cook over moderate heat, turning once, until browned and crusty, about 18 minutes. Transfer the ribs to a shallow baking dish in a single layer.",
    "Add the onion, carrots, celery and garlic to the skillet and cook over low heat, stirring occasionally, until very soft and lightly browned, about 20 minutes. Add the wine and thyme sprigs and bring to a boil over high heat. Pour the hot liquid over the ribs and let cool. Cover and refrigerate overnight, turning the ribs once.",
    "Preheat the oven to 350°. Transfer the ribs and marinade to a deep hotel pan. Add the chicken stock and bring to a boil. Cover and cook in the lower third of the oven for 1 1/2 hours, until the meat is tender but not falling apart. Uncover and braise for 45 minutes longer, turning the ribs once or twice, until the sauce is reduced by about half and the meat is very tender.",
    "Remove from oven, and cool in walk-in, keeping in the liquid. Once Cooled, strain off liquid into pan, and reduce by half. This will be the liquid to heat the short ribs in."
  ],
  "ingredients": [
    "0",
    "2 tablespoons canola oil",
    "(4#) 6 short ribs with bones, cut 2 inches thick",
    "Kosher salt and freshly ground pepper",
    "1 large onion, finely chopped",
    "2 carrots, chopped",
    "3 celery ribs, chopped",
    "3 garlic cloves, thickly sliced",
    "One bottle dry red wine, such as Cabernet Sauvignon",
    "4 thyme sprigs",
    "3 cups chicken stock"
  ],
  "__v": 3
}