{
  "hash": "230db6b35fa4366abb6acc174eafe08273833dce",
  "title": "quiche",
  "image": "http://www.brokepedia.com/wp-content/uploads/2014/01/IMG_0772-300x200.jpg",
  "href": "http://www.brokepedia.com/try-cheap-easy-quiche-recipe/",
  "extension": "Chrome",
  "firstAdded": "2015-07-02T10:09:43.400000",
  "users": [
    null
  ],
  "keywords": [
    "rust",
    "dat",
    "crust",
    "tho",
    "flour",
    "sugar",
    "salt",
    "cooking",
    "oil",
    "milk",
    "stir",
    "dry",
    "pie",
    "combine",
    "wet",
    "pat",
    "right",
    "pan",
    "easy",
    "poke",
    "holes",
    "fork",
    "prebake",
    "minutes",
    "degrees",
    "quiche",
    "filling",
    "spinach",
    "shouldve",
    "used",
    "mushrooms",
    "slices",
    "turkey",
    "bacon",
    "cause",
    "thats",
    "cheese",
    "jarlsberg",
    "magnificent",
    "eggs",
    "garlic",
    "paprika",
    "pepper",
    "butter"
  ],
  "directions": [
    "0",
    "Ready for how easy this is? Sauté the spinach and mushrooms with some butter, garlic, salt and pepper. How much butter, garlic, salt and pepper? I dunno, ask your taste buds. I usually add a teaspoon of garlic and maybe half a teaspoon of salt and pepper.",
    "Set that mixture aside, then fry up the bacon. I cut the bacon into smaller pieces, and then I tossed it in with the spinach/mushroom mix.",
    "In a bowl, mix together the eggs and milk, adding salt, pepper and paprika. Again, confer with your taste buds. I also tossed in a bit of shredded cheese. I love cheese.",
    "Sprinkle a layer of cheese onto the bottom of the pie crust. Layer the spinach/mushroom sauté mixture on top of that. If you love cheese as much as I do, sprinkle more cheese on top.",
    "Then, pour the egg mixture into the pie crust, and, if you have any left, sprinkle the rest of the cheese on top of the whole shebang. Bake for 40 minutes at 375 degrees, until the egg top is golden brown."
  ],
  "ingredients": [
    "0",
    "rust",
    "Dat crust tho.",
    "1 ½ cups of flour",
    "1 teaspoon of sugar",
    "2 teaspoons of salt",
    "½ cup of cooking oil",
    "2 tablespoons of milk",
    "Stir all of the dry ingredients together in a 9″ pie pan, then combine the wet ingredients. Pat your crust right there in the pan. It’s that easy.",
    "I poke some holes in it with a fork, then pre-bake it for 10 minutes at 375 degrees.",
    "Quiche filling",
    "Handful or two of spinach (I should’ve used more)",
    "1 cup of mushrooms",
    "A few slices of bacon (I used turkey bacon, cause that’s what I had.)",
    "3/4 cup shredded cheese (I shredded some Jarlsberg. It was magnificent.)",
    "5 eggs",
    "1 cup milk",
    "Chopped garlic",
    "Paprika",
    "Salt and pepper",
    "Butter"
  ],
  "__v": 1
}