{
  "hash": "022848ee1643eb4776104e1d7af3924f8bb24483",
  "title": "Wafels",
  "image": "",
  "href": "http://recipe-folder.com/recipe/5c82ac76a4523a07f65bef2a",
  "extension": "User Added",
  "firstAdded": "2019-03-08T17:55:02.295000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Van Kempen hielp als klein meisje haar vader op Oudjaarsdag met wafels bakken in de schuur. \"Nou ja, helpen, ik hielp vooral met opeten en kijken\", vertelt ze. \"De eerste twee mislukten altijd, dus dat was snoepen.\" Het recept voor de wafels kwam van de moeder van haar moeder, die ze ook bakte rond de jaarwisseling.",
    "1",
    "Toen Van Kempen ging samenwonen, ging ze snel op zoek naar een ouderwets wafelijzer. \"Zodra ik dat had, ben ik zelf begonnen met bakken. De vele eieren maken deze wafels zo lekker. Ik zie er niet zo veel bij andere wafelrecepten. Belgische wafels zijn hard. Deze worden als je ze uit het ijzer haalt wel even hard, maar daarna weer lekker zacht.\"",
    "2",
    "“Nu ik eraan denk, krijg ik gelijk zin om ze te maken.”",
    "3",
    "Alice van Kempen",
    "4",
    "Van bij haar oma tot afgelopen jaar: de wafels worden altijd gegeten met een laag roomboter en basterdsuiker. \"Ik krijg er gelijk zin in als ik eraan denk. Ik maak ze alleen met Oudjaar. Raar eigenlijk, want je kunt ze het hele jaar wel eten, ze zijn zo ontzettend lekker.\"",
    "5",
    "Recept voor wafels",
    "6",
    "Voor ongeveer twintig wafels",
    "7",
    "Bereidingstijd: uur en tien minuten",
    "8",
    "Bereidingswijze",
    "9",
    "Voeg het bakmeel, de eieren, het zout en de suiker bij elkaar in een kom. Doe de boter er gesmolten en iets afgekoeld bij. Voeg daarna melk en water toe, tot het beslag goed is. Doe dit op gevoel; het moet niet te dun zijn, maar vloeibaar genoeg om ze makkelijk over het wafelijzer te kunnen verdelen.",
    "10",
    "De wafels kunnen warm en koud gegeten worden. Heerlijk met roomboter en basterdsuiker."
  ],
  "ingredients": [
    "0",
    "500 gram zelfrijzend bakmeel",
    "1",
    "7 eieren",
    "2",
    "snufje zout",
    "3",
    "2 pakjes vanillesuiker",
    "4",
    "1 eetlepel basterdsuiker",
    "5",
    "200 gram boter",
    "6",
    "1 theelepel kaneel",
    "7",
    "melk",
    "8",
    "water"
  ],
  "__v": 1,
  "hidden": true
}