{
  "hash": "9f3de788f3bce835bb58d6785e57ec65a93f7559",
  "title": "Chicken Satay",
  "image": "https://www.recipe30.com/wp-content/uploads/2017/05/Chicken-satay-848x477.jpg",
  "href": "https://www.recipe30.com/chicken-satay-recipe.html/",
  "extension": "Chrome",
  "firstAdded": "2017-05-29T23:25:12.716000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the Satay paste, You will need a good quality blender or food processor. First chop up the lemon grass, use the white part only as the green is very woody. Peel the shallots and give them a rough chop. Peel the fresh garlic cloves. Peel the ginger and roughly chop, add to a food processor along with the brown sugar, coriander, cumin, turmeric, soy sauce and vegetable oil. Blitz until a smooth paste, the smoother the better. Transfer to a container.",
    "Slice the chicken thighs into long thin strips. Add to satay paste, mix well, cover and refrigerate at least 4 hours, ideally overnight.",
    "If using bamboo skewers, soak them in water to reduce burning.",
    "Cut your cucumber in half, trim off the ends, then split in half and slice on an angle fairly thick slices.",
    "Thread the chicken meat on each stick, a good method is shaping each strip like the letter “S” the place the stick through it so you have a wider span. You only want two sides when cooking, so the chicken has to be flat. Use approx 3 pieces per stick.",
    "Using a hot BBQ or a griddle pan, lightly oil the grill first, then place the chicken skewers across the grill. You want a little bit of char for the perfect Satay but of course not burnt. They should only take 2 to 3 minutes each side.",
    "Serve over hot rice with hot peanut sauce, a cheek of lime and a few chopped spring onions."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4 chicken thighs",
    "2 lemon grass sticks",
    "2 shallots",
    "4 garlic cloves",
    "2 tbsp brown sugar or honey",
    "1 thumb size piece of fresh ginger",
    "2 tbsp soy sauce or kecap manis",
    "2 tsp turmeric powder",
    "1 tsp coriander",
    "1 tsp cumin",
    "¾ cup vegetable oil",
    "Half cucumber"
  ],
  "__v": 1
}