{
  "hash": "b66039bc040082964c5bd0c560b94facee96a56a",
  "title": "Red Beans and Rice",
  "image": "https://www.washingtonpost.com/rf/image_982w/2010-2019/WashingtonPost/2018/02/02/Food/Images/FD-studio_060.JPG",
  "href": "https://www.washingtonpost.com/recipes/red-beans-and-rice/16288/",
  "extension": "Firefox",
  "firstAdded": "2020-04-01T00:44:46.220000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cut the sausage lengthwise in half, then invert and cut into 1/4-inch thick half moons. Drain and rinse the beans.",
    "Heat the oil in a soup pot or Dutch oven over medium heat. Add the sausage and cook for 6 to 8 minutes, stirring a few times, so some of its fat renders. Use a slotted spoon to transfer the sausage to a plate.",
    "While the sausage cooks, cut the flesh of the green bell pepper into 1/2-inch dice, discarding the stem and seeds. Dice the onion. Trim the scallions and then coarsely chop (enough to yield 1/2 cup). Mince the garlic. Add those ingredients to the pot (after the sausage has been removed) and stir to coat. Increase the heat to medium-high; cook for 2 minutes, stirring, until just softened, then add beans, broth, thyme, bay leaves and the black and cayenne peppers. Reduce the heat to medium; cover and cook for 25 minutes.",
    "Uncover; use a slotted spoon to fish out and discard the bay leaves. Use the back of a wooden spoon to mash about a cup’s worth of the beans against the side of the pot; this will thicken the mix a bit. Coarsely chop the parsley.",
    "Return the reserved sausage to the pot, as soon as it’s heated through, turn off the heat and stir in the parsley. Taste, and add the salt, as needed. Serve hot, with white rice; pass the hot sauce at the table."
  ],
  "ingredients": [
    "0",
    "8 ounces smoked, cooked pork sausage",
    "Two 15-ounce cans no-salt-added kidney beans",
    "1 tablespoon canola or vegetable oil",
    "1 medium green bell pepper",
    "1 medium sweet onion",
    "6 or 7 scallions",
    "2 cloves garlic",
    "3 cups low-sodium chicken broth",
    "Leaves from 3 full stems fresh thyme (may substitute 1 teaspoon dried thyme leaves)",
    "3 bay leaves",
    "1/2 teaspoon freshly ground black pepper",
    "1/4 teaspoon ground cayenne pepper",
    "Leaves from 2 or 3 stems fresh parsley",
    "1 to 2 teaspoons kosher salt",
    "Cooked long-grain rice, for serving",
    "Hot sauce, for serving"
  ],
  "__v": 1
}