{
  "hash": "36da4687d48b7d6b50187cf9ca6b658de122410e",
  "title": "BERGERS-STYLE COOKIES",
  "image": "https://www.browneyedbaker.com/wp-content/uploads/2017/09/bergers-style-cookies-27-754.jpg",
  "href": "https://www.browneyedbaker.com/bergers-style-cookies/",
  "extension": "Chrome",
  "firstAdded": "2018-01-02T16:53:24.634000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS:",
    "Make the Cookies: Preheat oven to 350 degrees F. Line two baking sheets with parchment paper or silicone baking mats.",
    "In a medium bowl, whisk together the flour, baking powder, and salt; set aside.",
    "Using an electric mixer, beat the butter and sugar on medium-high speed until pale and fluffy, about 3 minutes. Add the egg white, heavy cream, and vanilla, and beat until combined. Reduce the speed to low and add the flour mixture in three additions, mixing until incorporated, scraping down the bowl as needed.",
    "Working with 1 heaping tablespoon of dough at a time (my small cookie scoop was the perfect size), roll into balls and space 2 inches a part on the prepared baking sheets, 12 per sheet. Using moistened fingers, press dough balls to form disks about ¼-inch thick and 2 inches in diameter.",
    "Bake, 1 sheet at a time, until the cookies are just beginning to brown around the edges, 8 to 10 minutes, rotating the sheet halfway through baking. Let the cookies cool completely on the baking sheet.",
    "Make the Frosting: Once the cookies have cooled, combine the chocolate chips, heavy cream, and salt in a large bowl. Microwave the chocolate mixture at 50 percent power, stirring occasionally, until melted and smooth, 1 to 3 minutes. Whisk the cocoa powder, powdered sugar, and vanilla into the chocolate mixture until smooth. (The frosting should the texture of thick brownie batter and register about 95 degrees.)",
    "Turn the cookies over on the baking sheets. Spoon 2 tablespoons of frosting over the flat side of each cookie to form a mound. Let the cookies sit at room temperature until the frosting is set, about 3 hours. The cookies can be stored in an airtight container at room temperature for up to 3 days.",
    "RECIPE NOTES:",
    "The temperature and consistency of the frosting are important. It should register between 90 and 100 degrees and should resemble thick brownie batter when you spoon it onto the cookie. It should mound and slowly spread over the cookies. It’s okay if some of the frosting drips down the sides of the cookies. If the frosting is too thick, that means it is too cool. To make it spreadable, microwave it in 5-second intervals, whisking after each interval, until it registers between 90 and 100 degrees. If it gets too hot, it will thin and run off the cookies; in this case, simply let it cool a bit.",
    "I use the Thermapen instant digital thermometer.",
    "I used Ghiradelli milk chocolate chips."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS:",
    "For the Cookies",
    "2 cups (227 grams) cake flour",
    "1½ teaspoons baking powder",
    "¼ teaspoon salt",
    "½ cup (113 grams) unsalted butter, at room temperature",
    "¾ cup (149 grams) granulated sugar",
    "1 egg white",
    "1½ tablespoons heavy cream",
    "1½ teaspoons vanilla extract",
    "For the Frosting",
    "3 cups (18 ounces) milk chocolate chips",
    "1¼ cups (300 ml) heavy cream",
    "¼ teaspoon salt",
    "1⅔ cups (142 grams) Dutch-processed cocoa powder",
    "1¼ cups (142 grams) powdered sugar",
    "1½ teaspoons vanilla extract"
  ],
  "__v": 1
}