{
  "hash": "0013a549cbc3ead6f2c713faf2cd6c41391cb847",
  "title": "CHOCOLATE CLOUD CAKE",
  "image": "https://www.nigella.com/assets/uploads/recipes/public-thumbnail/chocolate-cloud-cake-562a34d0d795c.jpg",
  "href": "https://www.nigella.com/recipes/chocolate-cloud-cake",
  "extension": "Chrome",
  "firstAdded": "2018-11-22T21:35:29.477000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 180°C/160°C Fan/gas mark 4/350ºF.",
    "Line the bottom of a 23cm / 9 inch springform cake tin with baking parchment.",
    "Melt the chocolate either in a double boiler or a microwave, and then let the butter melt in the warm chocolate.",
    "Beat the 2 whole eggs and 4 egg yolks with 75g / ¼ cup of the caster sugar, then gently add the chocolate mixture, the Cointreau and orange zest.",
    "In another bowl, whisk the 4 egg whites until foamy, then gradually add the 100g / ½ cup of sugar and whisk until the whites are holding their shape but not too stiff.",
    "Lighten the chocolate mixture with a dollop of egg whites, and then fold in the rest of the whites. Pour into the prepared tin and bake for 35-40 minutes or until the cake is risen and cracked and the centre is no longer wobbly. Cool the cake in its tin on a wire rack; the middle will sink as it cools.",
    "When you are ready to eat, place the still tin-bound cake on a cake stand or plate for serving and carefully remove the cake from its tin. Don't worry about cracks or rough edges: it's the crater look we're going for here. Whip the cream until it's soft and then add the vanilla and Cointreau and continue whisking until the cream is firm but not stiff.",
    "Fill the crater of the cake with the whipped cream, easing it out gently towards the edges of the cake, and dust the top lightly with cocoa powder pushed through a tea-strainer."
  ],
  "ingredients": [
    "0",
    "250 grams dark chocolate (minimum 70% cocoa solids)",
    "125 grams unsalted butter (softened)",
    "6 large eggs (2 whole, 4 separated)",
    "175 grams caster sugar",
    "2 tablespoons cointreau (optional)",
    "grated zest of 1 orange (optional)"
  ],
  "__v": 1
}