{
  "hash": "0232833698d698804a8b5fd38b8a0984eb2bfb84",
  "title": "PEANUT BUTTER CHOCOLATE MOUSSE CAKE",
  "image": "http://www.lifeloveandsugar.com/wp-content/uploads/2015/02/Peanut_Butter_Chocolate_Mousse_Cake10.jpg",
  "href": "http://www.lifeloveandsugar.com/2015/02/09/peanut-butter-chocolate-mousse-cake/",
  "extension": "",
  "firstAdded": "2017-07-14T01:32:51.206000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "BROWNIE:",
    "1. Make brownie dough according to instructions on back of box.",
    "2. Grease a 9 inch pan (preferably springform pan, see above) and line the bottom with parchment paper to allow for easy removal. Pour brownie batter into pan and bake according to box instructions.",
    "3. When brownie is done baking, remove from pan and allow to completely cool.",
    "4. Once brownie has cooled, place brownie back into the bottom of the springform pan. Line the sides of the pan with parchment paper that sticks a few inches above the top edge of the pan.",
    "5. Top brownie with an even layer of mini Reese’s. Set aside.",
    "TO MAKE PEANUT BUTTER MOUSSE:",
    "1. In a small bowl, sprinkle the gelatin over the water, let stand for about 5 minutes.",
    "2. Place the peanut butter chips in a medium bowl",
    "3. Microwave 3/4 cup of heavy cream until it comes to a full boil.",
    "4. Add gelatin mixture to the heavy cream and whisk until dissolved.",
    "5. Pour cream over the peanut butter chips and let sit for about a minute.",
    "6. Whisk until peanut butter chips are melted and mixture is smooth. Set aside, cooling for about 5 minutes.",
    "7. Whisk remaining 1 1/2 cups heavy cream at high speed with a mixer until it begins to thicken.",
    "8. Add powdered sugar then continue to whip until stiff peaks form.",
    "9. Fold about a third of the whipped cream to the lightly cooled peanut butter mixture until well combined.",
    "10. Add remaining whipped cream and fold in until well combined.",
    "11. Spoon mousse evenly over the brownie and mini Reese’s and spread evenly. Place in refrigerator for about 1-2 hours, until firm enough to add another layer.",
    "TO MAKE CHOCOLATE MOUSSE:",
    "1. In a small bowl, sprinkle the gelatin over the water, let stand for about 5 minutes.",
    "2. Place the chocolate chips in a medium bowl",
    "3. Microwave 3/4 cup of heavy cream until it comes to a full boil.",
    "4. Add gelatin mixture to the heavy cream and whisk until dissolved.",
    "5. Pour cream over the chocolate chips and let sit for about a minute.",
    "6. Whisk until chocolate is melted and mixture is smooth. Set aside, cooling for about 5 minutes.",
    "7. Whisk remaining 1 1/2 cups heavy cream at high speed with a mixer until it begins to thicken.",
    "8. Add powdered sugar then continue to whip until stiff peaks form.",
    "9. Fold about a third of the whipped cream to the lightly cooled chocolate mixture until well combined.",
    "10. Add remaining whipped cream and fold in until well combined.",
    "11. Spoon chocolate mousse evenly over the peanut butter mousse and spread evenly. Place in refrigerator for about 2-3 hours, until completely firm.",
    "TO FINISH OFF CAKE:",
    "1. Make the chocolate whipped cream: Whisk 1 1/2 cups heavy cream at high speed with a mixer until it begins to thicken.",
    "2. Add powdered sugar and cocoa and continue to whip until stiff peaks form.",
    "3. Take mousse cake out of the springform pan and place it on serving plate or cake circle.",
    "4. Icing the outside of the cake with the chocolate whipped cream.",
    "5. Garnish with additional mini Reeses. Refrigerate until ready to serve."
  ],
  "ingredients": [
    "0",
    "18.4 oz box brownie mix (for 8×8 pan)",
    "8 oz bag mini Reese’s",
    "PEANUT BUTTER MOUSSE",
    "1 tsp + 1/8 tsp powdered gelatin",
    "1 1/2 tablespoon water",
    "9 ounces peanut butter chips",
    "2 1/4 cups heavy whipping cream",
    "1/4 cup powdered sugar",
    "CHOCOLATE MOUSSE",
    "1 tsp + 1/8 tsp powdered gelatin",
    "1 1/2 tablespoon water",
    "9 ounces semi sweet chocolate chips",
    "2 1/4 cups heavy whipping cream",
    "1/4 cup powdered sugar",
    "CHOCOLATE WHIPPED CREAM",
    "1 1/2 cups heavy whipping cream",
    "1/4 cup powdered sugar",
    "1/4 cup cocoa"
  ],
  "__v": 1
}