{
  "hash": "75e2c3276ee5bbbc917fc5991e41f17531eb87da",
  "title": "ROASTED BEET BURGER PATTIES",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2013/11/Beet-Burgers1-1071x800.jpg",
  "href": "http://www.onegreenplanet.org/plant-based-recipes/roasted-beet-burger-patties/",
  "firstAdded": "2015-01-06T13:43:43.521000",
  "users": [
    null
  ],
  "keywords": [
    "mediumsize",
    "beets",
    "head",
    "garlic",
    "tbs",
    "extravirgin",
    "olive",
    "oil",
    "divided",
    "kosher",
    "salt",
    "millet",
    "water",
    "flaxseed",
    "onion",
    "black",
    "beans",
    "rinsed",
    "balsamic",
    "vinegar",
    "parsley",
    "coriander",
    "cumin",
    "dry",
    "mustard",
    "thyme",
    "pepper",
    "walnuts",
    "glutenfree",
    "bread",
    "crumbs",
    "canola",
    "frying",
    "toppings",
    "lettuce",
    "tomato",
    "avocado"
  ],
  "directions": [
    "0",
    "Preheat the oven to 375 degrees. Scrub the beets so they are clean. Trim the ends. Lay each beet on a small piece of foil. Drizzle with 1 tsp. oil and sprinkle with salt. Loosely wrap the beets in the foil. Place on a baking sheet and roast for 1 hour. They should be fork-tender. Remove from the oven, carefully open the foil (there will be steam), and allow the beets to cool so you can handle them. When they are cool enough to touch, remove the peels. You can do this by holding a beet in a piece of paper towel and lightly rubbing it. The peel will easily rub off. Cut each beet into chunks and transfer to a food processor.",
    "As long as the oven is on, roast a head of garlic. Cut the end of the head of garlic, exposing the cloves. Drizzle with 1 tsp. olive oil, sprinkle with salt and wrap loosely with foil. Roast in the oven with the beets. Remove from the oven, open the foil and allow the garlic to cool. When it is cool enough to touch, simply squeeze the garlic out from the peel into the food processor.",
    "While the beets and garlic are roasting, prepare the millet. Rinse the millet in a mesh strainer and transfer to a small saucepan. Add the water and salt. Cook over medium-high heat until the water comes to a boil. Lower the heat and simmer for about 20 minutes until all the water has been absorbed. Remove from the heat and allow the millet to cool. When it has cooled, add 1 cup of the millet to the food processor.",
    "Prepare the flax gel which will be your binder. Combine the flaxseed and warm water in a mug, stir and let sit for 10 minutes until it thickens into a gel.",
    "While the millet is cooking, heat a tablespoon of oil in a medium-size skillet over medium-high heat. Add the onion and cook for 4-5 minutes until softened and translucent. Add the black beans and cook until the moisture has cooked out. Allow to cool and then add to the food processor.",
    "At this point the food processor should contain the beets, roasted garlic, millet, onions and black beans. Pulse until the ingredients are chopped up and incorporated. Add the flax gel, balsamic vinegar, parsley and spices. Add the walnuts and process until you have a thick mixture. You don’t want it to be too smooth, just well-mixed. There should be some texture. Taste for seasoning adjustments.",
    "Transfer the burger mixture to a bowl. Add the bread crumbs, ¼ cup at a time, mixing it in gently until the burger mixture feels like it is holding together well. I use the whole cup of crumbs. Put the mixture into the refrigerator for at least ½ hour.",
    "When you are ready to cook, remove the mixture from the fridge and make the patties. Using a 3 ½” cookie cutter ensures a perfectly formed, dense, thick burger patty. This made 6 big burgers but it could make 8 smaller ones.",
    "Heat the oil in a cast iron skillet over medium-high heat. Cook the burgers until browned, about 6 minutes per side. You may want to flip them carefully several times to ensure that the inside cooks while the outside doesn’t burn. You do, however, want the outside to char a bit and form a nice crust. If your skillet is small, cook 2 burgers at a time so there is room in the pan. Serve on a bun with your favorite toppings."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "2 medium-size beets",
    "1 head garlic",
    "2 tsp.+ 1 Tbs. extra-virgin olive oil, divided",
    "Kosher salt",
    "½ cup millet",
    "1 ½ cups water",
    "2 Tbs. flaxseed + 6 Tbs. warm water",
    "1 medium-size onion, diced",
    "1-15 oz. can black beans, rinsed and drained",
    "1 tsp. balsamic vinegar",
    "2 Tbs. fresh parsley, chopped",
    "1 tsp. ground coriander",
    "1 tsp. ground cumin",
    "1 tsp. dry mustard",
    "1 tsp. dried thyme",
    "1 tsp. Kosher salt",
    "½ tsp. black pepper",
    "½ cup walnuts",
    "1 cup gluten-free bread crumbs",
    "Canola oil for frying",
    "Toppings: lettuce, tomato, avocado"
  ],
  "__v": 1
}