{
  "hash": "6b5a5fc58833fc5fca46fa0c726b2ce17b60a19c",
  "title": "Spicy Braised Chicken with Citrus and Rhubarb",
  "image": "https://images.food52.com/78enlSlO2hROhxPJR2p_Wzw7G8E=/753x502/72773f65-7a91-459a-a3ed-b64b14efcd7b--2015-0526_spicy-braised-chicken-with-rhubarb_armando-rafael_130.jpg",
  "href": "https://food52.com/recipes/11844-spicy-braised-chicken-with-citrus-and-rhubarb",
  "extension": "Chrome",
  "firstAdded": "2018-01-05T13:03:31.536000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To prepare the chicken thighs, pat them dry, then sprinkle them with the fennel or pollen and peppercorns.",
    "In a large pan, add a splash of olive oil over medium-high heat. Add the Speck and ginger then add the chicken thighs and cook until evenly browned on one side, about 3 minutes. Season with salt. Flip the chicken thighs to brown on the other side. When both sides are golden brown, transfer the chicken, Speck, and ginger from the pan to a platter and let rest. Wipe out the pan with a paper towel.",
    "Return the pan to medium-high heat and add another splash of olive oil. Add the onion and fennel bulb, if using, and sauté until translucent, about 6 minutes. Stir in the orange and lemon peels and cook for another 3 minutes. Remove the pan from the heat. Stir in the rhubarb and cinnamon.",
    "Return the chicken, Speck, and ginger to the pan. Return to heat. Pour in the wine, stirring to deglaze the pan. In a small bowl, whisk together the mustard, maple syrup, and chicken broth. Add the mustard mixture to the pan and bring to a gentle simmer. Cook over medium-low heat for about 40 to 50 minutes, until the liquid reduces by almost half. Add more broth as needed. Taste and adjust for the sweet/sour balance you like: Add the cider vinegar if too sweet or a touch of maple syrup if too tart.",
    "Divide the rice evenly over four plates and serve the thighs with the onions, rhubarb, and citrus peel on top. Pour some fresh lemon over each plate, season with salt to taste, and garnish with cilantro or parsley and the quartered lemon and orange."
  ],
  "ingredients": [
    "0",
    "2 pounds free-range bone-in, skin-on chicken thighs",
    "1/2 teaspoon ground fennel seeds or pollen",
    "1/4 teaspoon fresh-ground peppercorns, preferably pink",
    "Olive oil, as needed",
    "1 ounce German Speck or pancetta, cut up (optional)",
    "One 3-inch knob peeled ginger, cut into matchsticks",
    "1 pinch sea salt, plus more as needed",
    "1 1/2 cups quartered rings of vidalias or other sweet onion",
    "1/2 cup matchstick-cut fresh fennel bulb (optional)",
    "1 sweet orange, pith removed and peel cut into matchsticks, meat quartered",
    "Peel and juice of 1 Meyer lemon, pith removed and cut into matchsticks",
    "2 to 3 ample stalks fresh rhubarb, diced",
    "1 pinch Saigon cinnamon",
    "1 cup dry white cooking wine",
    "1 tablespoon Dijon mustard",
    "1 teaspoon maple syrup, plus more as needed",
    "2 cups chicken broth (preferably homemade), plus more as needed",
    "1 teaspoon cider vinegar, or as needed",
    "3 cups cooked, warm medium-grain brown rice",
    "1 squeeze Meyer lemon, to serve",
    "Quartered slices orange and lemon, for garnish (optional)",
    "1 handful chopped cilantro or flat-leaf parsley, for garnish"
  ],
  "__v": 1
}