{
  "hash": "f2ff5a86745f31c85462b7b3d68eefdfbad1b9e0",
  "title": "Butternut Squash Falafel with Maple Tahini Sauce",
  "image": "http://www.shelikesfood.com/wp-content/uploads/2015/10/Butternut-Squash-Falafel-with-Maple-Tahini-Sauce-Main.jpg",
  "href": "http://www.shelikesfood.com/1/post/2015/12/butternut-squash-falafel-maple-tahini-sauce.html",
  "extension": "",
  "firstAdded": "2015-12-24T14:31:07.775000",
  "users": [
    null
  ],
  "keywords": [
    "butternut",
    "squash",
    "salt",
    "divided",
    "black",
    "pepper",
    "olive",
    "oil",
    "baking",
    "chickpeas",
    "rinsed",
    "cilantro",
    "cumin",
    "garlic",
    "gluten",
    "free",
    "regular",
    "flour",
    "cayenne",
    "tahini",
    "water",
    "maple",
    "syrup",
    "apple",
    "cider",
    "vinegar"
  ],
  "directions": [
    "0",
    "Pre-heat oven to 400 degrees Fahrenheit. Peel butternut squash, cut in half, lengthwise, remove seeds and chop into bite size pieces. You should get about 6 cups. Place butternut squash on a large sheet pan and toss with 1½ teaspoons olive oil, ½ teaspoon salt and ⅛ teaspoon black pepper. Roast butternut squash until fork tender, 40-45 minutes. Let cool for a few minutes.",
    "Place butternut squash and chickpeas in a food processor and process for 10-15 seconds, until everything is mixed together and slightly resembles a thick hummus. Add mixture to a large bowl.",
    "Next, add the cilantro, cumin, 1 teaspoon salt, garlic, flour and cayenne to bowl and use your hands to mix until everything is evenly combined. Form the mixture into patties (however large or small your like) and place them on a baking sheet lined with parchment paper. *For firmer patties you can refrigerate for at least an hour before baking. Brush the top of each falafel with a small amount of olive oil and bake falafel patties in a 400 degree oven until browned on both sides, flipping once, 35-40 minutes.",
    "Make the sauce while the falafel is baking. Mix all ingredients together in a small bowl and set aside. Drizzle desired amount of sauce on top of falafel before enjoying and eat with salad or in a pita if desired."
  ],
  "ingredients": [
    "0",
    "1 large butternut squash (you should get about 6 cups when diced)",
    "1½ teaspoon salt, divided",
    "⅛ teaspoon black pepper",
    "1½ teaspoons olive oil, plus more for baking",
    "4 cups cooked chickpeas, or 3 cans rinsed and drained",
    "¼ cup chopped cilantro",
    "2 teaspoons ground cumin",
    "2 cloves garlic, minced",
    "¼ cup gluten free flour, or regular flour",
    "Cayenne pepper, to taste",
    "1",
    "½ cup plus 2 tablespoons tahini",
    "¼ cup water",
    "2 tablespoons pure maple syrup",
    "1 tablespoons apple cider vinegar",
    "1 teaspoon salt",
    "¼ teaspoon black pepper"
  ],
  "__v": 1
}