{
  "hash": "93db3eeaf7ca9c6a5d72f5363e019c3738b2551f",
  "title": "english muffins",
  "image": "http://lh3.ggpht.com/_OaYG005JPDs/TETEV09r-FI/AAAAAAAABiw/Cjz6nRakWtA/s640/English%20Muffins.jpg",
  "href": "http://www.budgetbytes.com/2010/07/english-muffins/",
  "extension": "Chrome",
  "firstAdded": "2016-02-12T15:28:59.864000",
  "users": [
    null
  ],
  "keywords": [
    "active",
    "dry",
    "yeast",
    "sugar",
    "milk",
    "butter",
    "flour",
    "divided",
    "salt",
    "cornmeal",
    "needed",
    "spray"
  ],
  "directions": [
    "0",
    "In a small bowl, combine the yeast, sugar and ½ cup of warm water. Stir to dissolve the sugar and yeast. Let sit about 5 minutes or until foamy on top.",
    "While the yeast/sugar mixture is resting, combine 1.5 cups of the flour and salt in a large bowl. Stir well to evenly distribute the salt. In a second small bowl, combine the milk and butter. Microwave the milk/butter for 30 seconds, stir and microwave again for 30 seconds. Stir the butter until it melts into the warm milk.",
    "Pour the yeast mixture and the milk mixture into the flour. Stir until it has combined into a pasty mix. Adding ¼ cup at a time, stir in more flour until the dough forms a soft, slightly sticky ball that pulls away from the bowl. I added about ¾ cup to get it to this point.",
    "Sprinkle a little bit of flour onto a clean countertop and coat your hands in flour. Dump the soft ball of dough out of the bowl and knead it for about 5 minutes. Add as little flour as possible to the countertop while kneading. Adding too much flour will yield tough muffins. I found that a very slight sprinkle was all that was needed to keep it from sticking (see photos below for an example).",
    "Shape the dough into a ball and place it in a bowl that has been coated in non-stick spray. Lightly spray the top of the dough and cover with plastic wrap. Let rise until double in size (about 45 min – 1 hr).",
    "Punch the dough down, shape it into another ball, cover the bowl/dough and let rise a second time (45 min – 1 hr or until double).",
    "Punch down the dough again and turn it out onto a well floured countertop. Using a rolling pin, lightly roll the dough until it is about ¾ inch thick. Using a cookie cutter, biscuit cutter, opened (and cleaned) can, or a large round glass, cut the dough into circles. When you can’t cut out any more circles, gently ball the remaining dough, roll again and cut more. It gets more difficult to ball and roll out each time so fit as many circles in the dough as possible before balling it up again.",
    "Place the cut dough circles onto a sheet pan that has been liberally covered in cornmeal. Sprinkle more cornmeal on top of the muffins. Cover loosely with a damp towel and let rise, once more, until double in size (another 45 minutes).",
    "Heat a large skillet over medium-low heat. Spray the pan with non-stick spray. Carefully transfer the fluffy, risen muffins to the hot skillet with a spatula. Cook the muffins, in batches, in the skillet until they are golden brown and crispy on each side. Make sure to keep the heat low so that the outside browns slowly, allowing time for the inside to “bake.” I cooked mine for about 7 minutes on each side but this will vary from stove top to stove top.",
    "Let the muffins cool on a wire rack before attempting to slice open. Toast the split muffins in a toaster, slather with butter and jam then ooze with happiness!"
  ],
  "ingredients": [
    "0",
    "1 tsp active dry yeast $0.11",
    "1 Tbsp sugar $0.05",
    "½ cup milk $0.18",
    "2 Tbsp butter $0.05",
    "3 cups flour, divided $0.18",
    "¾ tsp salt $0.05",
    "¼ cup cornmeal $0.05",
    "as needed non-stick spray $0.05"
  ],
  "__v": 1
}