{
  "hash": "ec5527b358e49c5c4011c7fecc58e59b037a337b",
  "title": "Pineapple Upside-Down Cake",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2013/3/4/2/FNM_040113-Pineapple-Upside-Down-Cake-Recipe_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/ree-drummond/pineapple-upside-down-cake-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-10-20T09:05:58.425000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees F. Make the cake batter: Combine the flour, baking powder, salt, granulated sugar, 1/2 stick butter, the shortening, milk, eggs, vanilla and 2 tablespoons pineapple juice in a large bowl. Beat with a mixer on medium speed until well combined. (There will still be a few small lumps in the batter.) Set aside.",
    "Melt the remaining 1/2 stick butter in a 12-inch cast-iron skillet over medium heat; swirl to thoroughly coat the skillet. Sprinkle the brown sugar over the butter, making sure it's evenly distributed-you want the entire surface of the butter to be covered in brown sugar. Do not stir. As soon as the sugar dissolves, remove from the heat and layer the pineapple slices over the top. If desired, place maraschino cherries in the centers of the pineapple slices.",
    "Pour the batter evenly over the pineapple slices and gently spread to even out the top. Bake the cake 30 to 40 minutes, or until a toothpick inserted into the center comes out clean.",
    "Immediately run a knife around the edge of the cake, then put a plate upside down on top of the skillet. Carefully invert the skillet so the cake is turned onto the plate. It should come out pretty easily; if bits of cake stick to the skillet, use a small knife to patch it together. Let cool slightly before cutting into wedges. It's best served warm.",
    "Photograph by Yunhee Kim",
    "Recipe courtesy of Ree Drummond for Food Network Magazine"
  ],
  "ingredients": [
    "0",
    "2 1/2 cups all-purpose flour",
    "1 tablespoon baking powder",
    "1 teaspoon salt",
    "2 cups granulated sugar",
    "1 stick unsalted butter, at room temperature",
    "1/4 cup vegetable shortening",
    "1 1/2 cups whole milk",
    "2 large eggs",
    "2 teaspoons vanilla extract",
    "1 20 -ounce can sliced pineapple,",
    "2 tablespoons juice reserved (drink the rest!)",
    "1 1/3 cups packed light brown sugar",
    "Maraschino cherries, stemmed (optional)"
  ],
  "__v": 1
}