{
  "hash": "d52d5cb3004c2367b48ea69faa139b2f1e648ff2",
  "title": "Tomato-n-Grilled Cheese Soup",
  "image": "http://thecozyapron.com/wp-content/uploads/2015/01/tomato-grilled-cheese-soup_01-11-15_8_ca.jpg",
  "href": "http://thecozyapron.com/tomato-n-grilled-cheese-soup/",
  "extension": "Chrome",
  "firstAdded": "2017-02-18T20:59:51.987000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place a soup pot over medium-high heat, and add in about 3-4 tablespoons of olive oil; once hot, add in the diced onion and saute for few minutes until the onion begins to slightly brown.",
    "-Add in Italian seasoning, the black pepper, the red pepper flakes and a pinch of salt, and stir to combine; add in the garlic, and stir that in to incorporate.",
    "-Once the garlic become aromatic (about 30 seconds or so), add in the tomato paste and allow it cook for a minute or so to cook out the raw flavor; then, add in the canned tomatoes, the fresh basil and parsley, and the sugar, and stir to combine.",
    "-Add in the chicken stock, and then simmer the soup, partially covered, for 20 minutes.",
    "-After the 20 minutes, turn off the heat and add in the grated parmesan, and stir; then, using a hand-held immersion blender (or even your blender, but work in batches!), puree the soup until completely smooth; check the seasoning to see if any additional salt/pepper is needed.",
    "-Make some garlic toasts by drizzling some oil over the baguette slices, then placing them onto a baking sheet and under the broiler just until golden and toasty; then, rub the clove of garlic over each slice and add a pinch of salt. (You can leave your broiler on for the next step.)",
    "-To assemble your bowls, ladle some soup into oven-safe bowls, and top each with about 2-3 garlic toasts; then, sprinkle on about ¼ cup (or more) of the cheese, and place under the broiler to melt and become bubbly; carefully remove and garnish with a sprinkle of parsley before serving."
  ],
  "ingredients": [
    "0",
    "• Olive oil",
    "• 1 onion, diced",
    "• 1 teapsoon Italian seasoning",
    "• ¼ teaspoon black pepper",
    "• ¼ teaspoons red pepper flakes",
    "• Pinch salt",
    "• 6 large cloves garlic, or 8 small cloves), pressed through garlic press",
    "• 3 ounces (½ can) tomato paste",
    "• 1 (28 ounce) can whole, San Marzano-style tomatoes",
    "• 1 ounce fresh basil leaves",
    "• ¼ heaping cup flat-leaf parsley",
    "• 1 tablespoon sugar",
    "• 4 cups chicken stock, hot",
    "• ½ cup grated parmesan cheese",
    "• French baguette, sliced into about 12 (½”) slices",
    "• 1 small clove garlic, peeled but whole",
    "• 1 – 1 ½ cups shredded, Italian-style 4 Cheese blend",
    "• 1 tablepsoon chopped parsley, for garnish"
  ],
  "__v": 1
}