{
  "hash": "86c387c7af8fa01cdb9b35dfe61af405012f4a8b",
  "title": "Cauliflower Frittata Ingredients",
  "image": "http://cdn.freshbitesdaily.com/wp-content/uploads/2015/01/cauliflower-frittata-425-WM.jpg",
  "href": "http://www.freshbitesdaily.com/cauliflower-frittata/",
  "firstAdded": "2015-01-22T07:02:37.342000",
  "users": [
    null
  ],
  "keywords": [
    "head",
    "cauliflower",
    "olive",
    "oil",
    "white",
    "onion",
    "garlic",
    "smoked",
    "paprika",
    "eggs",
    "cream",
    "dijon",
    "mustard",
    "mediumsharp",
    "cheddar",
    "cheese",
    "salt",
    "pepper",
    "drizzle"
  ],
  "directions": [
    "0",
    "Fill a large saucepan with water and bring it to a boil. In a medium bowl mix the eggs, mustard, cream, half the cheese, salt, and pepper and set aside.",
    "While the water heats, break the cauliflower into medium sized flowerettes. You may have to cut the pieces up to get the flowerettes about the same size.",
    "Add a sprinkle of salt to the boiling water, then add the cauliflower. Cook for about 4 minutes. You are going for ‘partially done.’",
    "Drain the cauliflower and pat dry on some paper towels or a clean tea towel.",
    "Heat the olive oil in a medium oven-ready skillet over medium heat until the oil shimmers. (I love my black iron skillet for adventures like this.) Add the onion and saute until the onion is translucent.",
    "Add the garlic. Stir for thirty seconds. Do not brown the garlic. Toss in the partially cooked cauliflower. Toss, toss, toss. Get the cauliflower coated with those heady flavors.",
    "If the skillet seems too dry, add a little olive oil. Stir and cook the cauliflower mixture for another 2-3 minutes. Do not burn!",
    "Sprinkle on the smoked paprika and stir well.",
    "Pour the egg mixture over the cauliflower mixture. Use a fork to distribute the cauliflower evenly over the pan if necessary. Cook over medium-low heat for about five minutes.",
    "Sprinkle the remaining cheese over the egg mixture and place the skillet in a 375 degree oven for about ten minutes, until the frittata is set and the cheese is melted.",
    "Remove the frittata from the oven an allow it to cool for about 10 minutes. During this time the frittata will firm up, making it possible to produce neat, even slices. Drizzle the slices with a little extra virgin olive oil and garnish with something green like cilantro or parsley."
  ],
  "ingredients": [
    "0",
    "1 small head of cauliflower or half a large one",
    "1 tablespoon olive oil",
    "1 cup finely diced white onion",
    "2 cloves finely minced garlic",
    "2 teaspoons smoked paprika",
    "6 eggs",
    "4 tablespoons heavy cream",
    "1 1/2 tablespoons dijon mustard",
    "1 1/2 cup shredded medium-sharp cheddar cheese",
    "1 teaspoon sea salt and 1/2 teaspoon freshly ground pepper",
    "A drizzle of olive oil for serving"
  ],
  "__v": 1
}