{
  "hash": "7009bd6cb99f96f509787ce9a53987789f3d5d61",
  "title": "Not Lasagna",
  "image": "https://scontent-iad3-1.xx.fbcdn.net/v/t1.0-9/17903990_10212359340841305_4501326250333290227_n.jpg?oh=f535139eebab4ba415f911d46cc845e9&oe=5980F072",
  "href": "https://www.facebook.com/groups/194567564254103/permalink/410316119345912/",
  "extension": "Chrome",
  "firstAdded": "2017-04-19T23:41:08.297000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees",
    "Brown the hamburger, drain excesses fat and return to the pan or a large bowl. Add the crushed tomatoes and all the seasonings. Mix well. You can taste and adjust seasonings at this point. Add more or less of what you like. I'm pretty heavy-handed with a salt and garlic.",
    "Spray a 9x13 baking dish with a cooking spray or butter the dish well. Add half of the beef tomato mixture and smooth out so you have an even later. Top this with fresh spinach leaves or omit if you desire. Top spinach with mushroom slices or omit if you desire.",
    "Spread the ricotta on top of all of this so that you have an even layer. Do not omit this are you will just have hamburger meat. LOL Top the ricotta with about a cup and a half of mozzarella. You really don't want too much. Just enough cover the dish. Top this with the remaining meat mixture and spread out to cover and make an even layer.",
    "Place in the oven for 30 minutes. After baking time pull out and top of the remaining shredded cheese and put it back into the oven for another 15 minutes or until cheese is completely melted and bubbly.",
    "Remove from oven and allow to set 10 to 15 minutes",
    "Approximately 8 servings (unless your serving husband!) and 4.8 carbs per serving."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "3 lb hamburger",
    "1/28oz can crushed tomatoes",
    "Salt a tsp or so",
    "Pepper a tsp or so",
    "Garlic powder a tsp or so",
    "Dried minced onions a tsp or so",
    "Italian seasoning a tsp or so",
    "Red pepper flakes",
    "Fresh spinach about 2 cups",
    "8oz fresh mushrooms, sliced (I use Portobello)",
    "32 oz ricotta",
    "2 eggs",
    "3 c shredded mozzarella or Italian blend"
  ],
  "__v": 1
}