{
  "hash": "f842d6a1f5c1d9374b0bb92229cab6b9475a69c5",
  "title": "Strawberry Cheesecake French Toast Casserole",
  "image": "http://www.momontimeout.com/wp-content/uploads/2014/04/strawberry-cheesecake-french-toast-casserole-recipe.jpg",
  "href": "http://www.momontimeout.com/2014/04/overnight-strawberry-cheesecake-french-toast-casserole/",
  "extension": "",
  "firstAdded": "2017-05-21T00:20:39.016000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Lightly grease a 9 x 13 baking dish.",
    "Beat cream cheese until light and fluffy.",
    "Beat in sugar until thoroughly combined.",
    "Beat in 1 egg and lemon juice until thoroughly combined. Set aside.",
    "Whisk together 10 eggs, milk, half-and-half, maple syrup, vanilla extract, cinnamon and nutmeg. Set aside.",
    "Schmear bread with cream cheese mixture. Layer on sliced strawberries. Place another slice of bread on top to create a sandwich. Repeat for all slices of bread.",
    "Cut into cubes and place approximately two-thirds of the sandwich cubes into baking dish.",
    "Top with remaining strawberries and drizzle remaining cream cheese mixture over the top. Coupons",
    "Place remaining sandwich cubes on top.",
    "Finally, pour egg mixture over the top.",
    "Press down lightly and cover with plastic wrap.",
    "Refrigerate over night.",
    "Remove from refrigerator and let rest while you preheat the oven to 350 degrees.",
    "Cover with foil and bake for 30 minutes.",
    "Remove foil and bake for another 25-35 minutes or until the surface is golden and the center is set.",
    "Serve with maple syrup or additional fresh strawberries and whipped cream.",
    "1",
    "Combine equal parts strawberry jam (or jelly or preserves) and maple syrup. Heat on medium-high heat in microwave in 30 second intervals, stirring in between until the jam has dissolved into the syrup."
  ],
  "ingredients": [
    "0",
    "10-12 slices day old Challah, French, Italian or any other bread good for French Toast",
    "12 oz light cream cheese",
    "⅔ cup granulated sugar",
    "1 egg",
    "1 tsp lemon juice",
    "10 eggs",
    "¾ cup milk",
    "¾ cup half-and-half",
    "⅓ cup maple syrup",
    "2 tsp vanilla extract",
    "1 tsp cinnamon",
    "½ tsp ground nutmeg",
    "2 cups sliced strawberries",
    "1",
    "½ cup strawberry jam",
    "½ cup maple syurp"
  ],
  "__v": 1
}