{
  "hash": "7154b6722e42da8501cbaad0ecc29f0e8ee40e6a",
  "title": "Spicy Shrimp Tacos with Avocado Salsa",
  "image": "http://gimmedelicious.com/wp-content/uploads/2016/03/Spicy-Shrimp-Tacos-with-Avocado-Salsa-Sourcream-Cilantro-Sauce-18-of-26.jpg",
  "href": "http://gimmedelicious.com/2016/03/10/spicy-shrimp-tacos-with-avocado-salsa-sour-cream-cilantro-sauce/",
  "extension": "",
  "firstAdded": "2017-06-04T17:57:38.415000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To cook the shrimp: In a medium bowl whisk together olive oil, garlic, cumin, chili and onion powders, and salt. Add in shrimp and toss to coat completely. Cover and refrigerate for for at least 10 minutes or up to 24 hours. Heat a large heavy-duty or cast iron skillet on high heat for 2 minutes. Add the olive oil and shrimp. Cook shrimp in a skillet on medium-high heat until pink and cooked through, about 5 minutes. Turn off heat and finish with a squeeze of lime (optional).",
    "To make salsa: Combine tomato, avocado, jalapeno, salt, pepper, lime juice, and cilantro in a small bowl and stir to combine. Set aside. (If not using right away, place a piece of plastic wrap inside the bowl and directly over salsa to prevent discoloration and refrigerate.)",
    "To assemble: Stir sour-cream with cilantro and lime juice in a small bowl; set aside. Grill tortillas on stovetop over flame until lightly charred (this step is optional). Spoon avocado salsa generously over warm tortillas, then top with 3 shrimp and drizzle with sour cream sauce. Serve tacos with lime wedges on the side. Enjoy!!"
  ],
  "ingredients": [
    "0",
    "Spicy Shrimp:",
    "20 medium shrimp, peeled and deveined",
    "1½ tablespoon olive oil",
    "1 clove garlic, minced",
    "½ teaspoon ground cumin",
    "½ teaspoon chili powder",
    "¼ teaspoon onion powder (optional)",
    "¼ teaspoon kosher salt Coupons",
    "1 tablespoon olive oil",
    "squeeze of lime (optional)",
    "******************",
    "Avocado Salsa:",
    "1 tomato, seeded and chopped",
    "1 avocado, peeled, seeded and cut into chunks",
    "1 jalapeno, seeded and chopped",
    "½ teaspoon salt",
    "¼ teaspoon black pepper",
    "1 tablespoon fresh lime juice, from half a lime",
    "¼ cup loosely packed fresh cilantro leaves, coarsely chopped",
    "*******************",
    "6 small flour tortillas (corn tortillas can also be used)",
    "¼ cup sour cream",
    "2 tablespoons finely chopped cilantro",
    "1 tablespoon fresh lime juice"
  ],
  "__v": 3
}