{
  "hash": "c8088dc23dd96c469e7eddd7d22ad566173c3ca1",
  "title": "Smoked Pork Belly Marinated in Char Siu Sauce",
  "image": "http://www.seriouseats.com/recipes/assets_c/2011/07/20110703-159583-smoked-pork-belly-thumb-625xauto-170735.jpg",
  "href": "http://www.seriouseats.com/recipes/2011/07/grilling-smoked-pork-belly.html",
  "firstAdded": "2015-01-28T15:43:44.902000",
  "users": [
    null
  ],
  "keywords": [
    "char",
    "siu",
    "pineapple",
    "juice",
    "garlic",
    "kosher",
    "salt",
    "black",
    "pepper",
    "lbs",
    "pork",
    "belly",
    "skin",
    "chunks",
    "apple",
    "wood",
    "type",
    "indirect",
    "grill",
    "heat",
    "low"
  ],
  "directions": [
    "0",
    "1 In a medium bowl, mix together char siu sauce, pineapple juice, garlic, salt, and black pepper.",
    "2 Score the skin of the pork diagonally every 2-inches, repeat in the opposite direction, making a diamond pattern. Place pork in a large resealable plastic bag and pour in marinade. Seal and toss to evenly coat. Marinate in the refrigerator for at least 4 hours to overnight.",
    "3 Remove pork belly and allow to come to room temperature while preparing the smoker or grill. Fire up smoker or grill to 225°F for indirect heat, adding chunks of apple wood when at temperature. When the wood is ignited and producing smoke, place the pork in the smoker or grill, skin side up, and smoke until pork registers 160 degrees on an instant read thermometer inserted into the center of the belly, about 4 to 5 hours.",
    "4 Place pork belly on a medium hot grill, skin side down, or in a broiler, skin side up, and cook until skin is crisp. Remove to a cutting board, let rest for 10 to 15 minutes, then slice and serve."
  ],
  "ingredients": [
    "0",
    "1/2 cup char siu sauce",
    "1/2 cup pineapple juice",
    "5 cloves garlic, finely minced",
    "1 tablespoon Kosher salt",
    "1 teaspoon freshly ground black pepper",
    "4lbs pork belly, skin on",
    "4-6 chunks apple wood",
    "Type of fire: Indirect",
    "Grill heat: Low"
  ],
  "__v": 1
}