{
  "hash": "91872739e6b54fff61ba25c7205136ffeae1fbc7",
  "title": "Pork Chops with Pepper Pan Gravy",
  "image": "",
  "href": "http://abc.go.com/shows/the-chew/recipes/pork-chops-with-pepper-pan-gravy-michael-symon",
  "extension": "Firefox",
  "firstAdded": "2015-10-02T16:02:31.194000",
  "users": [
    null
  ],
  "keywords": [
    "pork",
    "chops",
    "pepper",
    "pan",
    "gravy",
    "olive",
    "oil",
    "bonein",
    "allpurpose",
    "flour",
    "paprika",
    "unsalted",
    "butter",
    "lowsodium",
    "chicken",
    "stock",
    "bundle",
    "thyme",
    "bay",
    "leaf",
    "cayenne",
    "hot",
    "jalapenos",
    "fresnos",
    "kosher",
    "salt",
    "black"
  ],
  "directions": [
    "0",
    "Place a large sauté pan over medium-high heat and add 2 tablespoons of olive oil.",
    "Season the pork chops on both sides with salt and pepper.",
    "In a baking dish, add ½ cup flour and paprika, season with salt and pepper, and whisk to combine. Dredge the pork chops in the flour, shaking off any excess. To the preheated pan, add the dredged pork. Cook until a golden brown, about 5 minutes. Flip the chops, reduce the heat to medium and continue to cook until golden on the other side, 5 minutes. Remove to a platter to rest and tent with aluminum foil.",
    "Drain excess oil from the pan and wipe clean. Place pan over medium-high heat and add the butter. To the melted butter, add 3 tablespoons of flour, and whisk to combine. Cook the roux for a minute then whisk in the stock. Bring to a gentle boil then reduce to a simmer. Tie the thyme and bay leaf together with a piece of butchers twine then drop it in to the gravy. Add the cayenne, hot sauce and chiles, and whisk to combine. Simmer, stirring occasionally for 15 minutes. Season with ¾ teaspoon of salt and ¾ teaspoon of freshly ground black pepper. Add any drippings from the pork. Remove the herb bundle. Set aside and keep warm.",
    "Serve the chops with the gravy spooned over the top."
  ],
  "ingredients": [
    "0",
    "ts",
    "Pork Chops with Pepper Pan Gravy",
    "2 tablespoons olive oil",
    "4 pork chops (bone-in, 1-inch thick)",
    "1/2 cup all-purpose flour (plus 3 tablespoons)",
    "1/2 teaspoon paprika",
    "2 tablespoons unsalted butter",
    "2 cups low-sodium chicken stock",
    "1 small bundle thyme",
    "1 bay leaf",
    "1/4 teaspoon cayenne pepper",
    "2 teaspoons hot sauce",
    "2 jalapenos or fresnos (thinly sliced)",
    "kosher salt and freshly ground black pepper (to taste)"
  ],
  "__v": 1
}