{
  "hash": "267fcf68a06f01ca6c5a41d28e4dc452f6659799",
  "title": "Chocolate Guinness Cake",
  "image": "//img.jamieoliver.com/jamieoliver/recipe-database/xtra_med/46263060.jpg?tr=w-414,",
  "href": "https://www.jamieoliver.com/recipes/chocolate-recipes/chocolate-guinness-cake/",
  "extension": "Chrome",
  "firstAdded": "2018-11-22T16:25:02.068000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cube the butter and chop the chocolate.",
    "Put the butter and chocolate in a heatproof bowl over a pan of simmering water and allow to melt. Remove from the heat and let it cool to room temperature.",
    "Stir in the Guinness – don’t worry if it seizes or splits, it’ll come back together when mixed with the other ingredients.",
    "Preheat the oven to 180°C/350°F/gas 4. Grease a 23cm cake tin with butter.",
    "In a medium bowl, mix the flour, cocoa and baking powder until combined.",
    "In another bowl, beat the eggs and sugar for about 3 minutes with an electric mixer until fluffy.",
    "Beat half the chocolate mixture into the eggs until combined. Add half the flour, then combine again. Repeat with the remaining flour and chocolate.",
    "Pour the mixture into the tin and bake for 40 to 45 minutes, or until a skewer comes out clean. If the top is colouring too much after 30 minutes, cover it with tin foil.",
    "Take the cake out of the oven, cool in the tin for 10 minutes, then transfer to a wire rack.",
    "For the icing, beat together the sour cream and icing sugar until smooth, then stir in 2 tablespoons of Guinness. If it becomes too loose, add more icing sugar.",
    "Spread over the cooled cake and serve."
  ],
  "ingredients": [
    "0",
    "100 g unsalted butter , plus extra for greasing",
    "75 g dark chocolate (70% cocoa solids)",
    "200 ml Guinness , plus extra for the icing",
    "200 g plain flour",
    "20 g cocoa powder",
    "1 teaspoon baking powder",
    "2 large free-range eggs",
    "200 g golden caster sugar",
    "SOUR CREAM ICING",
    "3 tablespoons sour cream",
    "200 g icing sugar"
  ],
  "__v": 1
}