{
  "__v": 1,
  "directions": [
    "0",
    "Preheat the oven to 400&degF. Prick each sweet potato several times with a fork and place on a baking sheet. Roast for 45 minutes to 1 hour, or until very soft to the touch. Set aside to cool.",
    "In a medium pot, combine the lentils, oats, bay leaf and salt with 5 cups of water. Bring to a boil and lower heat. Simmer uncovered for 15-20 minutes or until lentils are soft but not mushy, stirring occasionally to keep the oats from sticking to the bottom of the pot. Discard bay leaf and drain mixture into a colander or sieve.",
    "While the lentils and oats are cooking, finely chop half of the mushrooms and set aside. Cut the remaining mushrooms into quarters. Warm the olive oil in a large pot over medium-high heat. Add the quartered mushrooms and a pinch of salt and cook until browned and soft. Add the chopped mushrooms, onion, carrot, celery and garlic and cook, stirring occasionally, until onions are soft and translucent. Lower heat to medium and add the lentil and oat mixture, followed by the vegetable stock, wine, tomato paste, soy sauce, paprika, and parsley. Taste and add salt if needed. Simmer mixture for 5 minutes. Remove from heat and add a few grinds of black pepper.",
    "Preheat oven to 350°F. Peel sweet potatoes with your hands and place in a medium bowl. Use a fork to mash them into a smooth paste and season to taste with salt and pepper.",
    "Evenly spread the lentil mixture into a 9x13-inch baking dish. (For thicker layers, use a 9x9-inch pan.) Spoon the sweet potato mixture on top and smooth with a spatula. Bake for 30 minutes, or until the filling is bubbling at the edges.",
    "Additional Notes:",
    "• Both the filling and the roasted sweet potatoes can be made ahead and refrigerated up to 2 days before assembling and baking.",
    "• This recipe freezes well; after assembling, cover and freeze. Thaw overnight in the refrigerator and bake uncovered at 350°F for 35-45 minutes, or until filling is bubbling at the edges.",
    "• Leftover mashed potatoes can be used in place of the sweet potatoes.",
    "• Use tamari in place of soy sauce and double-check that you are using gluten-free oats if serving this to gluten-free guests."
  ],
  "firstAdded": "2014-08-22T01:14:52.182000",
  "hash": "f940e9ec7e686330855e02df131ba240d55fccbd",
  "href": "http://www.thekitchn.com/recipe-lentil-and-mushroom-sweet-potato-shepherds-pie-182683",
  "image": "http://p-ec1.pixstatic.com/52556c00697ab06b29000e20._w.540_h.540_s.fit_.jpg",
  "ingredients": [
    "0",
    "5 medium sweet potatoes, scrubbed",
    "1 cup brown or green lentils, washed and picked over",
    "3/4 cup dry steel cut oats",
    "1 bay leaf",
    "1 teaspoon salt",
    "1 tablespoon olive oil",
    "1 pound cremini mushrooms, divided",
    "1 onion, chopped",
    "1 carrot, chopped",
    "1 celery stalk, chopped",
    "1 garlic clove, minced",
    "3/4 cup low-sodium vegetable stock",
    "1/4 cup red wine",
    "1 tablespoon tomato paste",
    "1 tablespoon soy sauce or tamari",
    "2 teaspoons smoked paprika",
    "1/4 cup chopped fresh parsley"
  ],
  "keywords": [
    "medium",
    "potatoes",
    "scrubbed",
    "brown",
    "green",
    "lentils",
    "washed",
    "picked",
    "dry",
    "steel",
    "oats",
    "bay",
    "leaf",
    "salt",
    "olive",
    "oil",
    "cremini",
    "mushrooms",
    "divided",
    "onion",
    "carrot",
    "celery",
    "stalk",
    "garlic",
    "clove",
    "lowsodium",
    "stock",
    "red",
    "wine",
    "tomato",
    "soy",
    "tamari",
    "smoked",
    "paprika",
    "parsley"
  ],
  "title": "Lentil, Mushroom & Sweet Potato Shepherd's Pie",
  "users": [
    null
  ]
}