{
  "hash": "c3b3740feb95c62b3cba26e194295c8ed54dbd26",
  "title": "Beef Wellington",
  "image": "https://media2.popsugar-assets.com/files/thumbor/mdpVZXkf2dvqIU5N2nEMw9GDoNg/fit-in/2048xorig/filters:format_auto-!!-:strip_icc-!!-/2014/09/25/054/n/1922195/e3193653d46184b7_beef-wellington.jpg",
  "href": "https://www.popsugar.com/food/Gordon-Ramsay-Beef-Wellington-Recipe-486092",
  "extension": "Firefox",
  "firstAdded": "2017-07-21T00:55:49.609000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make mushroom duxelles:",
    "Add mushrooms to a food processor and process until completely smooth. The consistency is similar to wet hummus.",
    "In a pan over medium heat, add mushroom paste, olive oil, salt, and pepper. Spread the mixture evenly over the surface and cook on a medium-low heat until the moisture in the paste has reduced and the mixture has the consistency of a spreadable pâté. Remove from heat and let cool.",
    "To make herb crepes:",
    "In a large bowl, whisk together flour, eggs, sugar, salt, and chives. Whisk in milk, water, and 1 tablespoon of melted butter, until smooth and emulsified.",
    "Heat a crepe pan or large skillet over medium heat. Add remaining 3 tablespoons of butter. Add 1/4 cup of the batter. Rotate pan in a circular motion over the heat to completely cover the surface with the batter. The edges of the crepe will begin to curl slightly as the crepe cooks. Cook for approximately 45 to 60 seconds, then flip crepe to cook the other side. Each side should be a pale golden brown. Remove from heat. Add more butter if needed to the pan and repeat process with the remaining batter. Set crepes aside.",
    "Preheat the oven to 400º F.",
    "To make steaks:",
    "Pat filet mignon dry with paper towels and season generously with salt and black pepper. Heat a skillet over medium-high heat and add olive oil. When the oil begins to smoke, add the filet mignon and brown from 1 to 2 minutes on all sides. You want to create a nice sear on the outside of the steak but leave the inside raw. Remove from heat and place on a cutting board to cool.",
    "Cover cooled filet with Dijon mustard.",
    "To roll the beef Wellingtons:",
    "On a cutting board, lay out a long piece of plastic wrap. In the middle of the wrap, lay out a crepe. Spread mushroom duxelles over the crepe. Lay out the prosciutto on top of the duxelles. Place filet in the center of the crepe and gently wrap the crepe around the filet. Trim off any excess and use the plastic wrap to tightly wrap the steak.",
    "Lay out a clean, long piece of plastic wrap. Gently roll out puff pastry until it is a 1/4-inch thin. Place the wrapped steak on one end of the puff pastry and wrap. Pinch the ends closed and trim off any excess puff pastry. Use the plastic wrap to tightly seal the puff pastry. Pop it in the fridge for about 5 minutes to let it firm up again.",
    "In a bowl, mix together egg yolk and milk.",
    "Place a sheet of parchment paper or aluminum foil on a baking sheet. Remove Wellington from fridge, remove the plastic wrap, and lay the Wellington seam-side down on the baking sheet. Baste the top of the puff pastry with the egg wash and bake for approximately 25 to 30 minutes or until the internal temperature of the steak reaches 125º F, or to whatever temperature you prefer your steak.",
    "Remove from the oven and let rest for at least 10 minutes before slicing into medallions. Serve warm."
  ],
  "ingredients": [
    "0",
    "For mushroom duxelles:",
    "1 pound cremini mushrooms, coarsely chopped",
    "1 tablespoon extra-virgin olive oil",
    "1/2 teaspoon salt",
    "1/4 teaspoon black pepper",
    "----------------------------------------------------------------------------",
    "For herb crepe:",
    "1/2 cup all-purpose flour",
    "2 eggs",
    "1 teaspoon sugar",
    "1/2 teaspoon salt",
    "2 tablespoons chives, minced",
    "1/2 cup whole milk",
    "1/4 cup water",
    "4 tablespoons butter, melted, plus more if needed for pans",
    "----------------------------------------------------------------------------",
    "For beef Wellington:",
    "2 pounds filet mignon",
    "Salt and black pepper, to taste",
    "2 tablespoons olive oil",
    "1/4 cup whole-grain Dijon mustard",
    "1/2 pound prosciutto di Parma",
    "1 sheet puff pastry, thawed",
    "1 egg yolk",
    "1 tablespoon whole milk"
  ],
  "__v": 5
}