{
  "hash": "3f27fdbad118ff5c4cebeeacad874275c632f150",
  "title": "Smothered Chicken with Creamed Spinach, Bacon, Mushrooms",
  "image": "",
  "href": "http://juliasalbum.com/2016/02/smothered-chicken-with-creamed-spinach-bacon-mushrooms/",
  "extension": "Chrome",
  "firstAdded": "2017-01-12T21:32:58.735000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 375 F.",
    "Butter the bottom of the baking dish (I used an oval casserole dish measured 13 inches x 9 inches x 4 inches deep).",
    "Generously season chicken breasts on both sides with salt, lemon pepper seasoning and a small amount of paprika. Place the chicken breasts, flat side down, into the greased baking dish and bake for 15-20 minutes at 375 F.",
    "In the mean time, heat 1 tablespoon vegetable oil in a large skillet on medium heat. Add spinach and cook for only 1 or 2 minutes, covered, until the spinach is thoroughly heated through and start to wilt. Remove from heat. Add minced garlic and half and half. Bring to boil. Add shredded mozzarella cheese and keep stirring, on high heat, until mozzarella cheese starts to melt - about 30 seconds. Reduce heat to simmer and keep stirring until you have a nice, smooth creamed spinach - about 30 seconds or 1 more minute. Season with salt to your taste. Remove from heat.",
    "In a separate pan, heat 1 tablespoon vegetable oil. Add sliced mushrooms and cook on high-medium heat for 1-2 minutes until mushroom caramelize. Do not salt mushrooms or it will prevent the caramelization.",
    "Remove the chicken breasts from the oven (you baked them for 15-20 minutes). Top each chicken breast with the creamed spinach, chopped cooked bacon, cooked mushrooms and broken slices of pepper jack cheese. Bake in the oven, uncovered for 15-20 more minutes, until chicken is cooked through, no longer pink in the center, and the juices run clear. Broil for the last 2-4 minutes, if desired, being careful not to burn the cheese on top."
  ],
  "ingredients": [
    "0",
    "1 tablespoon butter",
    "4 small chicken breasts or 2 large chicken breasts, halved",
    "salt",
    "lemon pepper seasoning",
    "paprika",
    "1 tablespoon vegetable oil",
    "10 oz fresh spinach",
    "4 garlic cloves, minced",
    "2/3 cup half and half",
    "2/3 cup mozzarella cheese, shredded",
    "1 tablespoon vegetable oil",
    "4 oz mushrooms, sliced",
    "4 slices bacon, cooked, chopped",
    "4 slices of Pepper Jack cheese (Monterey Jack Cheese with Jalapenos)"
  ],
  "__v": 1
}