{
  "hash": "fd50d4ef915bc2ce97798b913984b3592406c814",
  "title": "Guido Burger",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2013/8/13/0/DV1711H_guido-burger-recipe_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/guido-burger.html",
  "firstAdded": "2015-01-24T15:52:27.912000",
  "users": [
    null
  ],
  "keywords": [
    "seeded",
    "hamburger",
    "kings",
    "hawaiian",
    "sandwich",
    "bun",
    "want",
    "spoil",
    "chuck",
    "patty",
    "seasoning",
    "salt",
    "ketchup",
    "crinklecut",
    "kosher",
    "dill",
    "pickle",
    "chips",
    "country",
    "fair",
    "pastrami",
    "kruse",
    "navel",
    "slice",
    "swiss",
    "cheese",
    "grilled",
    "yellow",
    "onions",
    "spicy",
    "brown",
    "mustard"
  ],
  "directions": [
    "0",
    "Heat a flat griddle to medium-high.",
    "Put the bun on the griddle to toast it. Then place the hamburger patty on the griddle and sprinkle with seasoning salt. When the bun is toasted, remove it from the griddle and set it in your prep area. Put the ketchup on the bottom part of the bun, then the pickles. Make sure to spread them out so that every flavor is in every bite.",
    "Place the pastrami on the griddle and sear away. Flip the hamburger patty, sprinkle with seasoning salt and cook to desired doneness. Place the Swiss cheese on top and melt. Add the pastrami on top of the cheese. Top the pastrami with the grilled onions.",
    "Now all you have left is the top part of the bun and the brown mustard. Squirt or spread the brown mustard on the bun top and place it on the grilled onions. Transfer the hamburger patty and toppings to the bottom part of the bun. Enjoy.",
    "This recipe was provided by a chef, restaurant or culinary professional and may have been scaled down from a bulk recipe. The Food Network Kitchens have not tested it for home use and therefore cannot make any representation as to the results.",
    "Recipe courtesy Hodad's"
  ],
  "ingredients": [
    "0",
    "One 4-inch seeded hamburger bun, such as a King's Hawaiian sandwich bun if you want to spoil yourself!!!!",
    "One 6-ounce ground chuck (80/20) hamburger patty",
    "Seasoning salt",
    "1 tablespoon ketchup",
    "6 to 8 crinkle-cut kosher dill pickle chips, such as Country Fair",
    "3 ounces thinly sliced pastrami, such as Kruse Navel",
    "1 slice Swiss cheese",
    "2 ounces grilled yellow onions",
    "1 tablespoon spicy brown mustard"
  ],
  "__v": 1
}