{
  "hash": "5113e51c91aaad8e522372ee6aa853c0dd4e1548",
  "title": "Latke Muffins",
  "image": "http://cdn1.edgedatg.com/aws/v2/abc/TheChew/recipe/3593249/de296249eb5e553ca359f24c63a2ffb5/320x180-Q90_de296249eb5e553ca359f24c63a2ffb5.jpg",
  "href": "http://abc.go.com/shows/the-chew/recipes/latke-muffins-dawn-lerman",
  "extension": "Chrome",
  "firstAdded": "2016-12-23T14:22:17.381000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "directions",
    "Preheat the oven to 400°F. Grease a cupcake tin with oil or spray with non-stick cooking spray.",
    "In the bowl of food processor fitted with the grating attachment, add the onions and pulse until shredded. Remove to a colander lined with a towel or cheesecloth over a large bowl to catch the excess liquid or use a hand grater.",
    "Add the potatoes to the food processor and pulse until shredded or use a hand grater. Remove the potatoes to the colander with the onions. Squeeze out excess liquid with the towel.",
    "Remove the potato mixture to a large bowl and add the eggs, matzo meal, baking powder and salt. Quickly mix before it turns brown. Fill cupcake tins halfway.",
    "Using a teaspoon, drizzle tops with olive oil and bake for 25-30 minutes, until tops are golden. Once cooled, pop them out onto paper-towel lined plates. Serve with applesauce, cream cheese with maple syrup, mango chutney and sour cream with red horseradish.",
    "Tip: 1. Perfect dish to bring to a party. Just warm the latkes right before the meal and serve with a toppings bar.",
    "2. Swap the potato out for sweet potato or squash."
  ],
  "ingredients": [
    "0",
    "LATKE MUFFINS",
    "canola oil or non-stick cooking spray (to grease)",
    "1 large yellow onion (peeled, cut into chunks)",
    "4 large Russet potatoes (peeled)",
    "2 large eggs",
    "1/4 cup matzo meal",
    "1 teaspoon baking powder",
    "1/2 teaspoon salt",
    "2 tablespoons olive oil (to drizzle)",
    "Kosher salt and freshly ground black pepper (to taste)"
  ],
  "__v": 1
}