{
  "hash": "a66922bdfc9837586bbc3e20fde9e00ca1b9ef5b",
  "title": "Salted Caramel Popcorn",
  "image": "http://12tomatoes.com/system/photos/photos/000/242/703/large/caramel-popcorn.jpg?1389123635&id=242703&caption=true",
  "href": "http://12tomatoes.com/2014/01/snack-recipe-salted-caramel-popcorn.html",
  "firstAdded": "2015-01-13T17:20:55.744000",
  "users": [
    null
  ],
  "keywords": [
    "unpopped",
    "popcorn",
    "kernels",
    "oil",
    "salted",
    "butter",
    "light",
    "brown",
    "sugar",
    "maple",
    "syrup",
    "vanilla",
    "kosher",
    "salt",
    "divided",
    "baking",
    "soda",
    "almonds"
  ],
  "directions": [
    "0",
    "Preheat the oven to 300F and line baking sheets with parchment paper.",
    "In a large, lidded saucepan, warm 3 kernels with the 1 tablespoon oil. If you don't have a pan large enough to handle about 12 cups of popcorn, make in two batches",
    "Once those three kernels pop, add the rest of the corn kernels to the pan and shake to coat with oil. Put the lid on the pan.",
    "Pop the corn, shaking the pan occasionally until the popping slows.",
    "Empty the popped corn into a large mixing bowl, and try to pull out as many unpopped kernels as possible so they don't end up in the mix.",
    "In a separate saucepan, melt the butter then mix in the sugar, maple syrup and 1 teaspoon salt.",
    "Once the sugar is completely moistened, increase the heat to medium high and bring the mixture to a boil then lower the heat to medium.",
    "Boil for 3-4 minutes without stirring.",
    "Add baking soda and vanilla to the caramel mixture, stirring until you have a thick, even, glossy sauce.",
    "Slowly pour the caramel sauce over the popcorn, while stirring the popcorn (it'll help to have two people). Optionally, add the nuts to the popcorn at the same time as the caramel sauce. Continue to stir the popcorn and the sauce until it's all well coated.",
    "Divide the popcorn between the two baking sheets and sprinkle the remaining 1/2 teaspoon salt on top, then place in the oven.",
    "Bake for 30 minutes, stirring every 10 minutes or so.",
    "Allow popcorn to cool completely, or use buttered fingers to clump the popcorn and nuts together to form bunches if desired.",
    "Enjoy!"
  ],
  "ingredients": [
    "0",
    "1/2 cup unpopped popcorn kernels",
    "1 tablespoon oil",
    "1 cup salted butter",
    "1 cup light brown sugar",
    "1/2 cup maple syrup",
    "1 teaspoon vanilla extract",
    "1 1/2 teaspoons kosher salt, divided",
    "1/2 teaspoon baking soda",
    "1 cup whole almonds (optional)"
  ],
  "__v": 1
}