{
  "hash": "b0411a6284ced1de01fdf9f9c9a8663b1640b3af",
  "title": "Frittata With Bacon, Corn, and Gruyère Recipe",
  "image": "http://www.seriouseats.com/recipes/assets_c/2016/08/20160703-frittata-bacon-gruyere-corn-emily-matt-clifton-11-thumb-1500xauto-433445.jpg",
  "href": "http://www.seriouseats.com/recipes/2016/08/frittata-bacon-corn-gruyere-dinner-in-20-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-08-10T15:02:00.168000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Adjust oven rack to 4 inches below broiler and preheat broiler to high. In a large bowl, whisk together eggs and milk or half and half until fully combined. Stir in half of cheese and season with salt and pepper. Set aside.",
    "Heat oil in a 10-inch oven-safe nonstick or well-seasoned cast iron or carbon steel skillet over medium-high heat until shimmering. Add bacon and cook until light brown but not crisp, about 4 minutes. Transfer to a paper towel–lined plate and remove all but 1 tablespoon bacon fat from pan.",
    "Add corn, scallions, and jalapeño to skillet and cook, stirring occasionally, until just tender, about 4 minutes. Season to taste with salt and pepper.",
    "Pour eggs into skillet and cook, stirring and scraping pan all over, until very loose curds form throughout, about 2 minutes. Continue to cook until eggs on bottom and edges are set, about 2 minutes. Top with remaining cheese, bacon, and a few jalapeño slices for decoration, if using.",
    "Place under broiler and broil until top is just set and a pale golden brown, a few minutes. Serve immediately."
  ],
  "ingredients": [
    "0",
    "8 large eggs",
    "1/4 cup (60ml) whole milk or half and half",
    "5 ounces (140g) cubed Gruyère cheese, divided (see note above)",
    "Kosher salt and freshly ground black pepper",
    "1 teaspoon (5ml) olive oil",
    "4 slices thick-cut bacon (about 5 ounces; 140g), diced",
    "1 1/2 cups (225g) fresh corn kernels, cut from about 3 ears of corn (or use frozen and defrosted corn)",
    "5 scallions, roughly chopped",
    "1 jalapeño pepper, seeded and diced (plus a couple of slices for decoration, if desired)"
  ],
  "__v": 1
}