{
  "hash": "f042cf85eabcd5f01659d4a7e45ac812b59e43e8",
  "title": "Chicken Piccata",
  "image": "https://www.simplyrecipes.com/wp-content/uploads/2015/07/chicken-piccata-vertical-a-1600.jpg",
  "href": "https://www.simplyrecipes.com/recipes/chicken_piccata/",
  "extension": "Chrome",
  "firstAdded": "2018-01-25T02:54:43.776000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Prepare chicken cutlets, pound them thin: To make chicken cutlets, slice the chicken breast halves horizontally, butterflying them open. If the breast pieces you are working with are large, you may want to cut them each into two pieces.",
    "If the pieces are still thick after butterflying, put them between two pieces of plastic wrap and pound them with a meat hammer to 1/4-inch thickness.",
    "2 Dredge cutlets in seasoned flour with Parmesan: Mix together the flour, salt, pepper, and grated Parmesan. Rinse the chicken pieces in water. Dredge them thoroughly in the flour mixture, until well coated.",
    "3 Brown cutlets in butter and oil: Heat olive oil and 2 tablespoons of the butter in a large skillet on medium high heat. Add half of the chicken pieces, do not crowd the pan. Brown well on each side, about 3 minutes per side. Remove the chicken from the pan and reserve to a plate.",
    "Cook the other breasts in the same manner, remove from pan. Place the breasts on a rack over a roasting pan and keep warm in a 225°F oven while you prepare the sauce.",
    "4 Add stock or wine, lemon juice, capers, reduce by half, stir in butter: Add the chicken stock or white wine, lemon juice, and capers to the pan. Use a spatula to scrape up the browned bits. Reduce the sauce by half.",
    "Whisk in the remaining 2 tablespoons of butter.",
    "Plate the chicken and serve with the sauce poured over the chicken. Sprinkle with parsley."
  ],
  "ingredients": [
    "0",
    "2-4 boneless, skinless chicken breast halves (1 1/2 pound total), or 4-8 chicken cutlets",
    "1/2 cup flour",
    "1/4 teaspoon salt",
    "Pinch ground black pepper",
    "3 Tbsp grated Parmesan cheese",
    "4 Tbsp olive oil",
    "4 Tbsp butter",
    "1/2 cup chicken stock or dry white wine (such as a Sauvignon Blanc)",
    "2 Tbsp lemon juice",
    "1/4 cup brined capers",
    "2 Tbsp fresh chopped parsley"
  ],
  "__v": 1
}