{
  "hash": "4f671f6f97477c0cf4cad8ad78e01391acc53eef",
  "title": "Caramel Crusted Pumpkin Loaf with 2 Minute Caramel Spice Glaze",
  "image": "http://thevegan8.com/wp-content/uploads/2014/11/Pumpkinloaf6-1-of-1.jpg",
  "href": "http://thevegan8.com/2014/11/22/caramel-crusted-pumpkin-loaf/",
  "extension": "",
  "firstAdded": "2015-12-14T19:45:27.020000",
  "users": [
    null
  ],
  "keywords": [
    "flaxseed",
    "mixed",
    "water",
    "use",
    "aquafaba",
    "eliminate",
    "flaxseedwater",
    "combo",
    "update",
    "white",
    "sorghum",
    "flour",
    "bobs",
    "red",
    "oat",
    "certified",
    "glutenfree",
    "oats",
    "baking",
    "pumpkin",
    "pie",
    "spice",
    "salt",
    "puree",
    "maple",
    "syrup",
    "creamy",
    "roasted",
    "almond",
    "butter",
    "smooth",
    "texture",
    "measuring",
    "nutfree",
    "sunbutter",
    "using",
    "make",
    "easily",
    "needed",
    "recently",
    "remade",
    "recipe",
    "chickpeas",
    "instead",
    "better",
    "lighter",
    "fluffier",
    "soft",
    "suggest",
    "making",
    "makes",
    "loaf",
    "lower",
    "fat",
    "different",
    "versions",
    "favorite",
    "baked",
    "chocolate",
    "chips",
    "die",
    "raisins",
    "cranberries",
    "nuts",
    "nice",
    "kitchen",
    "scale",
    "accurate",
    "results",
    "properly",
    "measure",
    "written",
    "scoop",
    "cupsspoons",
    "dry",
    "leveling",
    "thing",
    "wet",
    "sure",
    "leveled"
  ],
  "directions": [
    "0",
    "As per UPDATE above, I suggest making this recipe now with ¼ cup aquafaba in place of the flaxseed+water combo. It is truly better. But if you still want to use the flaxseed, then warm up your ½ cup of water in the microwave until it's fairly warm, about 20 seconds. Mix the flaxseed in well with a fork and set aside while you prepare the other ingredients. It needs several minutes to thicken and turn into a gel.",
    "Preheat an oven to 350 degrees and spray a 9x5 ceramic or glass loaf pan with nonstick flour spray, or grease and flour. OR, this will make 12 fabulous fluffy tall muffins.",
    "Add the sorghum flour, oat flour, baking powder, pumpkin pie spice and salt to a medium bowl and whisk together until well mixed. Make sure to break up any lumps.",
    "In a separate large bowl, combine the pumpkin, syrup, almond butter and ¼ cup aquafaba, ¼ cup water, or if you are using the flaxseed mixture it's an additional ½ cup water. Stir well. If your almond butter is really thick, slightly warm it up so it is completely smooth and pourable when measuring and it blends well. Use an immersion blender or beater to blend so it is completely smooth. I used my hand immersion blender. You don't want any chunks of almond butter in the batter.",
    "Slowly add in the dry ingredients into the wet ingredients and stir with a spoon as you are adding a bit at a time until completely mixed and very smooth, and no lumps remain. Stir for a minute or two until it's all well mixed and thickens up some. The batter should be really smooth. Pour the batter into the prepared pan and smooth out the top. Take your pan and rock it back and forth a few times, so the batter settles and flattens out.",
    "Mix together the caramel ingredients with a fork until smooth. Using only about a heaping tablespoon, drop little dollops over the top of the batter. The more you add, the crispier it will be. Drag with the tip of a knife to create swirls. When it bakes, it will spread some and form a nice, sugary crust on top. Save the remaining glaze to drizzle over the baked loaf later.",
    "Bake for 45-55 minutes until a toothpick comes out clean, ok if there are a few dry crumbs, but it shouldn't be wet batter. The top should be firm and shiny and slightly springy. Let cool in the pan for at least 30 minutes before removing, as it will be firming up a lot and still cooking as it cools. Flip the loaf over on a cooling rack to cool completely. Use a very sharp knife to gently slice into several slices.",
    "If making them as muffins (so good!), then divide the batter between 12 muffin liners. Drop a dollop of the glaze on each one and just slightly swirl it around the top with a toothpick. It will form a nice crust on top as it cooks. Bake for 20 minutes or until a toothpick comes out clean. It's ok if there are a couple of dry crumbs, but not wet batter. Take them out when there is crumbs on the toothpick, so they don't overbake. Let them cool at least 20 minutes, as they are too moist and still cook as they are cooling off.",
    "Drizzle remaining glaze over the top of individual slices when you are ready to eat. If you want the glaze thinner, add a tiny amount of water. I stored the extra glaze at room temperature. It's important to wrap the loaf/muffins tightly in plastic wrap to keep them moist. Store at room temperature. I like to rewarm my slice slightly and then drizzle some glaze on."
  ],
  "ingredients": [
    "0",
    "¼ cup (26g) ground flaxseed mixed with ½ cup warm water OR just use ¼ cup aquafaba and eliminate the flaxseed+water combo, SEE UPDATE BELOW!)",
    "1 cup + 2 tablespoons \"sweet\" white sorghum flour (147 g, I use Bob's Red Mill)",
    "¾ cup oat flour (87 g) (I use Bob's Red Mill Certified Gluten-free oats)",
    "1 tablespoon baking powder",
    "1½ tablespoons pumpkin pie spice",
    "½ teaspoon fine sea salt",
    "1 cup pumpkin puree",
    "¾ cup + 2 tablespoons pure maple syrup",
    "¼ cup creamy roasted almond butter, warm to a smooth texture before measuring (for nut-free, use sunbutter)",
    "½ cup water (if using aquafaba, then you will only use ¼ cup water here)",
    "1",
    "2 tablespoons creamy roasted almond butter, see note below how to make this easily (for nut-free, use sunbutter)",
    "2 tablespoons maple syrup",
    "2 teaspoons pumpkin pie spice",
    "pinch sea salt",
    "water if needed to thin",
    "UPDATE: I recently remade this recipe with aquafaba (liquid from a can of chickpeas) instead of flaxseed and it is even BETTER. It is lighter, fluffier and so soft. I would suggest making it with the aquafaba! It even makes the loaf lower fat!",
    "2",
    "To make different versions of this loaf, add in any of your favorite ingredients. I also baked one with chocolate chips and it was to die for. Raisins or cranberries or even nuts would be nice too. Use a kitchen scale for accurate results. To properly measure as written above, make sure to scoop with your cups/spoons into the dry ingredients, leveling off with your finger. Same thing with the wet ingredients, make sure they are packed and then leveled off."
  ],
  "__v": 1
}