{
  "hash": "f12984f76629ab5fd2f1c802021cb732bdb16c7b",
  "title": "Bak Kwa (Homemade Chinese Pork Jerky)",
  "image": "http://1.bp.blogspot.com/-1c0GZQ8pNvc/UtE_aUHGEjI/AAAAAAAAsIU/_K6IJ44Ihvw/s1600/Bak+kwa+2.jpg",
  "href": "http://goodyfoodies.blogspot.com/2014/01/recipe-bak-kwa-homemade-chinese-pork.html",
  "extension": "Chrome",
  "firstAdded": "2016-08-08T00:01:26.301000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place all ingredients (except minced pork) in a bowl and mix well. Then, add the minced pork and mix in clockwise direction with a pair of chopsticks until the meat becomes gluey, about 3-4 minutes. You will know it is ready when the meat clings together. Leave to marinate in fridge for 2-3 hours.",
    "Preheat oven to 160°C (roast mode). Lightly grease a baking tray (18\"x13\") with some cooking oil, then using your fingers, spread the marinated meat thinly (as thinly as you can) onto the baking tray. You will fill about 12\"x12\" of the tray.",
    "Place in preheated oven and bake for about 15-17 minutes, until cooked. Remove from oven, and then change to grill mode (240°C).",
    "Using a pizza cutter, cut into desired size. The meat would have shrunk a little (mine was 28cm x 28cm) and I sliced it into (7cm x 7cm) squares. You can also use scissors or sharp knife to cut, but pizza cutter would be easiest.",
    "Return tray to the oven and grill about 8 minutes on the top side, then remove from oven and using chopsticks, flip to the other side and grill for a further 8 minutes, or whenever it is golden brown. You will need to watch it closely as it tends to burn very easily at this stage - remove pieces which are already browned and continue cooking the rest.",
    "Allow to cool and enjoy. Bak kwa is best enjoyed warm and fresh. Once cooled, you can store in a tupperware, but try to consume within 2-3 days (you can gently heat each piece in a frying pan over medium heat for 2 minutes before consuming)."
  ],
  "ingredients": [
    "0",
    "450g minced pork (with fats)",
    "100g soft brown sugar",
    "1 tbsp light soy sauce",
    "1/2 tbsp Shaoxing Chinese rice wine",
    "1/2 tbsp fish sauce",
    "1 tbsp oyster sauce",
    "1/8 tsp Chinese five-spice powder",
    "A pinch of white pepper",
    "1/2 tsp salt",
    "2 tbsp honey (or maltose)"
  ],
  "__v": 1
}