{
  "hash": "1bf3af61286cbb2027fa88f03d82ce20fd00db6d",
  "title": "Chicken Potstickers",
  "image": "https://images.food52.com/t0V_Vmb3x5eiKunxKpb7NWwXN6A=/753x502/54e91748-1e47-4880-b410-2ef1f979e991--potstickers1.jpg",
  "href": "https://food52.com/recipes/24905-chicken-potstickers",
  "extension": "Chrome",
  "firstAdded": "2018-03-01T01:36:38.286000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a medium bowl, combine flour and salt. Gradually stir in boiling water until you have a mealy mixture. Gradually add the cold water until you have a dough.",
    "Knead dough on a floured surface (adding more flour as necessary) until you have a smooth dough.",
    "Transfer to a clean bowl, cover it with a damp towel, and let the dough rest while you make the filling.",
    "1",
    "In a large bowl, combine all filling ingredients.",
    "To mold the dumplings, pinch off a tablespoon of dough, and roll out into a circle, 3 to 4 inches in diameter. Place a tablespoon of filling in the center and fold over the dough to seal the edges. (If you want to get all fancy and pleat the edges, there are a ton of how-to videos online. Or you can invent your own way. The important part is, they all taste the same!)",
    "Place molded dumplings on a floured sheet pan until they are ready to be cooked.",
    "Bring a large pot of salted water to a boil over medium high heat. Next to it, heat a few tablespoons of oil in a frying pan over medium heat. Boil dumplings for 4 minutes, remove with a slotted spoon (allowing excess water to drip off), and then transfer them to the frying pan (step back because this process could get spitty). Once the bottoms of the potstickers are browned, pat off any excess oil with a paper towel and then enjoy with soy sauce."
  ],
  "ingredients": [
    "0",
    "2 cups all-purpose flour, plus more for dusting",
    "1 1/2 teaspoons kosher salt",
    "1/2 cup boiling water",
    "1/2 cup cold water",
    "1",
    "1 pound ground chicken",
    "2 teaspoons each: sugar, soy sauce, and rice vinegar",
    "black pepper to taste",
    "1 teaspoon ground ginger",
    "2 stalks green onion, minced",
    "1/4 cup chicken broth",
    "1 pinch red chili flakes",
    "oil for frying the potstickers (I use canola)"
  ],
  "__v": 1
}