{
  "hash": "01e98ce2cef162e84697dc68f3b03fb400b95105",
  "title": "White Bean Burgers with Spinach",
  "image": "http://images.meredith.com/bhg/images/recipe/l_R159997.jpg",
  "href": "http://www.bhg.com/recipe/sandwiches/veggie-burgers/#51f953b611a1c78a71000043",
  "keywords": [
    "cancannellini",
    "beans",
    "rinsed",
    "soft",
    "bread",
    "crumbs",
    "carrot",
    "onion",
    "egg",
    "snipped",
    "parsley",
    "olive",
    "oil",
    "slicescountry",
    "italian",
    "baby",
    "spinach",
    "easy",
    "tomato",
    "recipe"
  ],
  "directions": [
    "0",
    "In a medium bowl mash beans with a fork or potato masher. Stir in half of the bread crumbs, the carrot, onion, egg, half of the parsley, 1 tablespoon olive oil, and 1/4 teaspoon each salt and pepper. Combine remaining bread crumbs and parsley in a shallow dish.",
    "Shape bean mixture into 4 patties (mixture will be soft). Dip both sides of patties into bread crumb mixture to coat.",
    "Heat remaining 2 tablespoons oil in a large skillet over medium heat. Add patties. Cook for 4 minutes per side or until well browned.",
    "Arrange spinach and patties on bread slices. Top with Easy Tomato Sauce. Makes 4 servings.",
    "Easy Tomato Sauce",
    "Yield: 1-1/2 cup",
    "ingredients",
    "1 14 1/2ounce candiced tomatoes, undrained",
    "2 tablespoons snipped fresh basil",
    "Salt",
    "Ground black pepper",
    "directions",
    "1. Place tomatoes in a blender or food processor. Cover and blend or process to desired consistency. Pour into a bowl and stir in snipped fresh basil. Season to taste with salt and pepper.",
    "nutrition facts (White Bean Burgers with Spinach)",
    "Servings Per Recipe 4, cal. (kcal) 353, Fat, total (g) 13, chol. (mg) 53, sat. fat (g) 2, carb. (g) 48, Monosaturated fat (g) 8, Polyunsaturated fat (g) 2, fiber (g) 9, sugar (g) 5, pro. (g) 15, vit. A (IU) 2332, vit. C (mg) 9, Thiamin (mg) 0, Riboflavin (mg) 0, Niacin (mg) 2, Pyridoxine (Vit. B6) (mg) 0, Folate (µg) 89, Cobalamin (Vit. B12) (µg) 0, sodium (mg) 873, Potassium (mg) 147, calcium (mg) 141, iron (mg) 4, Percent Daily Values are based on a 2,000 calorie diet"
  ],
  "ingredients": [
    "0",
    "1",
    "15 - 16 ounce cancannellini beans, rinsed and drained",
    "1 1/2",
    "cups soft bread crumbs",
    "1/4",
    "cup shredded carrot",
    "1/4",
    "cup finely chopped onion",
    "1",
    "egg",
    "2",
    "tablespoons snipped fresh parsley",
    "3",
    "tablespoons olive oil",
    "4",
    "slicescountry Italian bread, toasted",
    "1",
    "cup packed fresh baby spinach",
    "1/4",
    "cup Easy Tomato Sauce (recipe below)"
  ],
  "__v": 0
}