{
  "__v": 1,
  "directions": [
    "0",
    "Preparation:",
    "How to make spinach souffle:",
    "Brush the inside of a large soufflé or deep casserole dish with 1 1/2 tablespoons of softened butter. Sprinkle the buttered surface evenly with Parmesan cheese and set aside the dish.",
    "In a large saucepan, sauté the spinach until it wilts and the juices have evaporated. Preheat the oven to 375F. In a separate medium saucepan, melt the remaining butter over medium heat and stir in the flour and salt. Cook the flour, whisking constantly, for 30 seconds. Add the milk to the flour and cook, still whisking constantly, for about 4 minutes, until the mixture thickens. Add the spinach and continue cooking over medium heat for 1 minute. Season the mixture with black pepper and nutmeg.",
    "Whisk ½ cup of the hot spinach into the egg yolks, and then add the egg yolk mixture back into the hot spinach, stirring to completely incorporate. Beat the egg whites on high speed until stiff peaks form. Stir one-third of the egg whites into the spinach, and then fold the remaining egg whites into the mixture. Spoon it into the prepared dish and bake for 30 minutes, until the soufflé is puffed up and cooked through.",
    "This spinach souffle recipe makes 6 servings."
  ],
  "firstAdded": "2014-05-10T00:36:08.521000",
  "hash": "8f81413f95c8518e7f5f38ee9427666ac1af3c6e",
  "href": "http://frenchfood.about.com/od/maindishes/r/spinachsouffle.htm",
  "image": "http://0.tqn.com/d/frenchfood/1/I/e/0/-/-/spinachsouffle.jpg",
  "ingredients": [
    "0",
    "Ingredients:",
    "1 1/2 tablespoons plus 4 tablespoons softened butter, divided",
    "3 tablespoons grated Parmesan cheese",
    "1 lb. spinach, stemmed and chopped",
    "2 tablespoons all-purpose flour",
    "½ teaspoon salt",
    "1 cup whole milk",
    "1/8 teaspoon ground black pepper",
    "1/8 teaspoon grated nutmeg",
    "3 eggs, separated"
  ],
  "keywords": [
    "softened",
    "butter",
    "divided",
    "parmesan",
    "cheese",
    "spinach",
    "stemmed",
    "allpurpose",
    "flour",
    "salt",
    "milk",
    "black",
    "pepper",
    "nutmeg",
    "eggs",
    "separated"
  ],
  "title": "Spinach Soufflé Recipe",
  "users": [
    null
  ]
}