{
  "hash": "adfac74ea0a767242cdd8fac32f1dfaf382bc0fa",
  "title": "Korokke (Potato & Meat Croquette)",
  "image": "http://www.justonecookbook.com/wp-content/uploads/2011/04/Korokke-101-550x366.jpg",
  "href": "http://www.justonecookbook.com/korokke-croquette/",
  "extension": "Chrome",
  "firstAdded": "2017-07-13T02:31:00.819000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Gather all the ingredients.",
    "In a large pot, put water and potatoes and bring it to a boil. Cook potatoes until a skewer goes through the potato easily.",
    "Remove the potato from the heat and drain the water completely. When you do so, use a lid to partially cover so the potatoes don’t fall off from the pot.",
    "Move the pot back to the stove. On low heat shift the pot so that remaining moisture will completely evaporate (but don’t burn them).",
    "Turn off the heat and mash the potatoes. Unlike mashed potato, you don’t have to mash completely. You can want to leave some small chunks for texture. Set aside.",
    "Meanwhile, chop onion, carrot, and mushrooms finely.",
    "In a large skillet, heat oil on medium high heat. Sauté onion until soft.",
    "Add carrot and Shiitake mushrooms and cook until they are soft.",
    "Add the meat and break it up with a wooden spoon. When the meat is cooked through, add salt, white pepper, and black pepper. Set aside.",
    "When both mashed potato and meat mixture are ready, add the meat mixture into mashed potato in the large pot. Make sure you leave the liquid behind. We only want dry ingredients into the pot. Discard any liquid left in the pan.",
    "Add an egg and mix all together until everything is well combined.",
    "Set aside till cool down a bit (so you can actually hold the mixture with your hands).",
    "While the mixture is still warm, but not hot, start making Korokke balls.",
    "Dredge each ball in flour, egg, and Panko.",
    "In a wok (or frying pan), heat oil over medium high heat. Deep fry Korokke until they are golden brown (How To Deep Fry Food). Inside is already cooked, so all you need to do is to make it nice brown color.",
    "Transfer Korokke to paper towels and let the oil absorbed in the paper. Serve immediately with Tonkatsu Sauce.",
    "You can store the leftover in an airtight container and freeze up to a month. To reheat, put frozen or half defrosted korokke on baking sheet lined with aluminum foil or parchment paper and bake at 350F (180C) for 15 minutes or until inside is warm."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 lb russet potatoes (2 lb = about 4 potatoes) (peeled and halved)",
    "1 onion (finely diced)",
    "½ carrots (finely diced, optional)",
    "2 Shiitake mushrooms (optional)",
    "2 Tbsp neutral flavor oil (vegetable, canola, etc)",
    "1 lb ground beef",
    "1 large egg",
    "1 tsp Kosher salt",
    "¼ tsp white pepper powder",
    "Freshly ground black pepper",
    "3 large eggs (for the breading)",
    "2 cup panko (Japanese breadcrumbs)",
    "½ cup all purpose flour",
    "Neutral flavor oil (vegetable, canola, etc) (for deep frying)",
    "Tonkatsu Sauce (See Notes for homemade recipe)"
  ],
  "__v": 1
}