{
  "hash": "ce6574162521e2704d7b4328f5facf9b9e4796ad",
  "title": "Pepperoni Studded Lasagna",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2007/2/14/0/gi0201_pepperonilasagna.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/guy-fieri/blazys-pepperoni-studded-lasagna-recipe.html",
  "firstAdded": "2015-01-24T23:04:45.155000",
  "users": [
    null
  ],
  "keywords": [
    "salt",
    "lasagna",
    "sheets",
    "pepperoni",
    "tomato",
    "recipe",
    "follows",
    "ricotta",
    "mozzarella",
    "bulk",
    "italian",
    "sausage",
    "parmesan",
    "extravirgin",
    "olive",
    "oil",
    "yellow",
    "onion",
    "medium",
    "garlic",
    "tomatoes",
    "basil",
    "oregano",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Preheat the oven to 375degrees F.",
    "Boil 6 quarts of water, add a pinch of salt and cook the pasta to almost done, about 7 minutes. Remove from the water and shock in an ice bath.",
    "In a medium saucepan, add the pepperoni and saute over medium heat until crispy, about 10 minutes. Remove from the heat and drain on a paper towel.",
    "In a 10- by 14- by 3-inch baking pan or dish, pour 1 cup of the Tomato Sauce in the bottom and around the sides. Layer lasagna sheets on the bottom of the pan, overlapping by 1/2 inch. Add one-third of the ricotta and one-quarter of the mozzarella, sausage, pepperoni and Parmesan. Spoon 1 cup of tomato sauce over the top. Repeat this two more times.",
    "On the top sheet, finish with the remaining cup of tomato sauce, mozzarella, sausage and pepperoni and dust with Parmesan. Bake until the cheese bubbles around the edges and the top is melted and light golden brown, about 45 minutes. If baking the dish from the freezer, add 15 to 20 minutes to the cook time, or until it's bubbly. Cover loosely with foil if it's browning too quickly. Remove from the oven; let sit for 15 minutes. Cut and serve immediately with more sauce, if desired.",
    "In a medium saucepan, heat the olive oil. Add the onions and cook over medium to low heat until transparent, about 20 minutes. Add the garlic and cook until almost brown, about 10 minutes. Then, add the tomatoes and cook for 30 minutes over low to medium heat. Add the basil and oregano and continue to cook for another 30 minutes. Season with salt and pepper, cool and store in the refrigerator until ready to use.",
    "From Food Network Kitchens; after further testing and to ensure the best results this recipe has been altered from what was in the actual episode.",
    "Recipe courtesy Guy Fieri"
  ],
  "ingredients": [
    "0",
    "Salt",
    "1 pound lasagna sheets",
    "8 ounces sliced pepperoni (about 2 cups)",
    "4 cups Tomato Sauce, recipe follows",
    "1 pound ricotta",
    "1 pound shredded mozzarella",
    "2 pounds bulk Italian sausage, cooked",
    "3/4 cup grated Parmesan",
    "3 tablespoons extra-virgin olive oil",
    "1 yellow onion, diced",
    "5 medium cloves garlic, minced",
    "Two 28-ounce cans crushed tomatoes",
    "2 tablespoons thinly sliced fresh basil",
    "1 tablespoon minced fresh oregano",
    "Salt and freshly ground black pepper"
  ],
  "__v": 1
}