{
  "hash": "d75cdc9273a11c1dfaea6dd5acf01c0d623e1b87",
  "title": "Pressure Cooker Mom's Classic Pot Roast with Savory Onion Gravy",
  "image": "http://i1.wp.com/www.thekitchenwhisperer.net/wp-content/uploads/2016/05/Pressure-Cooker-Classic-Post-Roast12.jpg?resize=850%2C567",
  "href": "http://www.thekitchenwhisperer.net/2016/05/14/pressure-cooker-moms-classic-pot-roast-with-savory-onion-gravy/",
  "extension": "Chrome",
  "firstAdded": "2016-10-27T16:49:49.854000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Coat the chuck roast with 1 tsp of salt on all sides.",
    "In your pressure cooker either over high heat or on the browning stage, add the oil.",
    "Once the oil is shimmering carefully place the roast in the pot searing for 6-9 minutes on each side. Each side should have a dark caramelized crust.",
    "Once seared, remove the meat from the pot and set aside.",
    "If using a gas pressure cooker, reduce the heat to low. If using an electric pressure cooker, shut the system off.",
    "Next, in order, place the onions, carrots and garlic.",
    "On top of the vegetables place the seared meat and any juices that were on the plate.",
    "In a bowl whisk together the stock, Worcestershire sauce, remaining salt, pepper, thyme and parsley.",
    "Pour this over the meat.",
    "Place the pressure cooker lid on the pot and seal. For a gas pressure cooker, turn the heat to high, set the dial to meat/poultry and the timer to 60 minutes. When the unit reaches temperature (mine chirps to notify me) reduce the heat to low. My unit only goes up to 59 minutes however this roast needs 90 minutes to cook. When it chirps that it’s done simply reset the timer by adding another 30 minutes.",
    "For an electric pressure cooker, set it to high and the time to 90 minutes.",
    "After 90 minutes release the pressure in either pressure cooker using the natural release method.",
    "Carefully remove the lid and using large slotted spoons gently remove the roast and set on a serving platter to rest. It should be fall-apart tender.",
    "Next, remove the carrots and set aside.",
    "To make gravy strain any fat off and place the juice back into the pot. Bring the liquid to a boil (electric pressure cooker you’d set it to browning).",
    "In a small bowl stir together the cornstarch and water until blended.",
    "Whisk in the cornstarch slurry into the pot.",
    "Reduce the heat to medium and stir occasionally until desired consistency.",
    "Taste the gravy for seasoning – additional salt and or pepper."
  ],
  "ingredients": [
    "0",
    "3 – 4lb chuck roast",
    "1 large yellow onion, chopped small, about 1 1/2 - 2 cups",
    "4 whole carrots, cut into 3” sections",
    "1 Tbl minced garlic, fresh",
    "3 cups beef stock",
    "2 Tbl Worcestershire sauce",
    "2 tsp kosher salt",
    "1 tsp black pepper",
    "1 Tbl parsley, dried",
    "1 tsp thyme, dried",
    "1 Tbl olive oil",
    "2 Tbl corn starch",
    "2 Tbl water"
  ],
  "__v": 1
}