{
  "hash": "8e83416e71a0cb329e4268c450af60264a193f59",
  "title": "Homemade Burgers",
  "image": "http://www.seriouseats.com/recipes/assets_c/2012/03/20120325-veggie-burgers-2-001-thumb-625xauto-228177.jpg",
  "href": "http://www.seriouseats.com/recipes/2012/03/homemade-veggie-vegan-burgers-that-dont-suck-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2015-11-29T18:47:30.504000",
  "users": [
    null
  ],
  "keywords": [
    "button",
    "mushrooms",
    "trimmed",
    "canola",
    "oil",
    "kosher",
    "salt",
    "black",
    "pepper",
    "thyme",
    "sprigs",
    "eggplant",
    "leeks",
    "celery",
    "rib",
    "medium",
    "clove",
    "garlic",
    "microplane",
    "grater",
    "dry",
    "pearl",
    "barley",
    "garbanzo",
    "beans",
    "patted",
    "paper",
    "towels",
    "allpurpose",
    "flour",
    "baking",
    "marmite",
    "vegemite",
    "maggi",
    "seasoning",
    "cashews",
    "pinenuts",
    "soy",
    "pankostyle",
    "bread",
    "crumbs"
  ],
  "directions": [
    "0",
    "Adjust oven rack to middle position and preheat oven to 350°F. In a large bowl, toss mushrooms with 1 tablespoon oil and season to taste with salt and pepper. Coat eggplant with another tablespoon olive oil and season to taste with salt and pepper. Wrap eggplant with heavy duty aluminum foil. Transfer mushrooms and eggplant to a foil-lined rimmed baking sheet. Scatter thyme over mushrooms. Bake, turning mushrooms and wrapped eggplant occasionally until mushrooms are dark brown and eggplant is completely tender (test with a cake tester or thin skewer), about 45 minutes. Remove from oven, unwrap eggplant, and set aside to cool.",
    "While mushrooms and eggplant roast, heat remaining two tablespoons oil in a large skillet over medium-high heat until shimmering. Add leeks and celery and cook, stirring and tossing occasionally, until completely softened but not browned, about 4 minutes. Add garlic and cook, stirring constantly, until fragrant, about 30 seconds. Transfer mixture to a medium bowl and set aside to cool.",
    "Place barley in a pot and cover with water by 2 inches. Stir once then place over high heat. Bring to a boil then reduce to a simmer. Cook, stirring occasionally, until barley is completely tender, about 20 minutes. Drain and transfer cooked barley to a clean kitchen towel or a triple layer of heavy-duty paper towels. Roll towels tightly and press to remove excess moisture. Transfer barley to a large bowl.",
    "Add half of garbanzo beans to the bowl of a food processor along with flour, baking powder, soy sauce, Marmite and half of eggplant (reserve remaining eggplant for another use). Process until a smooth paste forms, scraping down sides as necessary. Transfer mixture to bowl with barley. Pulse remaining chickpeas in food processor and pulse until beans are chopped to about the size of a lentil (5 to 6 short bursts), scraping down sides as necessary. Transfer to bowl with barley mixture. Chop cashews or pinenuts (if using) in the food processor the same way and add to barley mix.",
    "When mushrooms are cool, add to bowl of food processor and pulse until finely chopped but still coarse in texture, about 8 to 10 short pulses. Add to barley mix. When leeks and celery are cool, transfer to food processor. Chop with 8 to 10 short pulses and add to barley mix.",
    "Using bare hands or a spatula, stir together mixture until completely homogenous. Season to taste with salt and pepper. Mixture can be refrigerated and stored for up to 5 days at this point or frozen in an airtight freezer bag for up to 3 months.",
    "When Ready To Serve: Add breadcrumbs to mixture and work them in with your hands. Make a sample patty. It should have the texture of ground beef and hold together easily. If not, add water a tablespoon at a time until it comes together. Divide mixture into eight patties about 4-inches across and 1/2 an inch thick. Patties must be cooked within 30 minutes of adding breadcrumbs (see note above).",
    "To Finish on a Griddle or in a Skillet: Heat three tablespoons of vegetable oil in a large skillet over medium heat until shimmering. Add four patties and cook without moving until first side is well-browned, about 3 minutes. I like to press a disk of sliced onion into the top side while it cooks. Flip burgers and top with cheese (if desired) and cook until second side is browned and cheese is melted, about 3 minutes longer. Transfer to a toasted bun and serve with condiments as desired.",
    "To Finish on the Grill: Preheat a gas or charcoal grill with a medium-high fire. Rub the grill grates with an oil-soaked paper towel and add the burgers. Cook without moving until well-browned, about four minutes. Flip burgers, top with cheese if desired, and cook on second side until well browned, about 4 minutes longer. Transfer to toasted bun and serve."
  ],
  "ingredients": [
    "0",
    "1 1/2 pounds button mushrooms, trimmed",
    "1/4 cup canola or vegetable oil",
    "Kosher salt and freshly ground black pepper",
    "6 thyme sprigs",
    "1 whole small eggplant (about 1/2 pound)",
    "2 large leeks, chopped fine (about 1 1/2 cups)",
    "1 large celery rib, chopped fine (about 1/2 cup)",
    "1 medium clove garlic, grated on a microplane grater (about 1 teaspoon)",
    "3/4 cup dry pearl barley",
    "1 (14-ounce) can garbanzo beans, drained and patted dry on paper towels",
    "1/4 cup all-purpose flour",
    "2 teaspoons baking powder",
    "1 teaspoon marmite, vegemite, or Maggi seasoning",
    "1 cup toasted cashews, pinenuts, or a mix",
    "1 teaspoon soy sauce",
    "1 1/2-cups panko-style bread crumbs (see note above)"
  ],
  "__v": 1
}