{
  "hash": "0c7082b234b72caef055334859e44b9fe2e9050e",
  "title": "Crispy Potatoes with Malt Vinegar and Corn",
  "image": "http://prodstatics3cdn1.tastingtable.com/images/articles/2014_09/Web-Article-Image-Yahoo-Food-Tasting-Table-Corn-Potato-overlay.jpg",
  "href": "http://www.tastingtable.com/entry_detail/chefs_recipes/17920/Corn_Meet_Potatoes.htm",
  "firstAdded": "2015-02-26T20:11:16.460000",
  "users": [
    null
  ],
  "keywords": [
    "potatoes",
    "corn",
    "kernels",
    "ears",
    "butter",
    "malt",
    "vinegar",
    "lemon",
    "juice",
    "scallions",
    "dill",
    "fronds",
    "salt",
    "pepper",
    "canola",
    "oil",
    "frying"
  ],
  "directions": [
    "0",
    "Combine potatoes, half of the vinegar in a medium saucepan; add water to cover by 1\". Bring to a boil over medium-high heat and cook until tender, about 10 minutes. Drain and allow to cool. Once the potatoes are cool, gently smash the potatoes on a clean surface using a coffee mug; set aside.",
    "Pour oil in a medium saucepan over high heat until a deep thermometer reaches 375 degrees. Working in batches, fry the potatoes until crisp and golden brown, about 5 minutes. Using a slotted spoon transfer potatoes to s paper towel-lined plate. Season with salt and set aside.",
    "Meanwhile, melt 2 tablespoons butter in a large cast-iron skillet over medium-high heat. Add the corn and cook, stirring occasionally until slightly brown and tender, about 5 minutes. Season with salt and pepper and set aside until ready to serve.",
    "In a small saucepan over medium-high heat, bring the remaining vinegar to a simmer. Add the remaining butter and lemon juice and continue to cook until mixture has reduced and slightly thickened, about 5 minutes. Season with pepper.",
    "To assemble, divide the corn among 4 plates. Top with potatoes and drizzle with vinegar reduction. Garnish with dill and scallions and serve immediately."
  ],
  "ingredients": [
    "0",
    "1 pound small potatoes",
    "1 cup corn kernels (from 2 ears)",
    "4 tablespoons butter",
    "1 cup malt vinegar",
    "1 teaspoon fresh lemon juice",
    "¼ cup thinly sliced scallions",
    "¼ cup fresh dill fronds",
    "Salt and pepper to taste",
    "Canola oil, for frying"
  ],
  "__v": 1
}