{
  "hash": "564b62b3934d0d7fea66042343cab5699ed870c5",
  "title": "CLASSIC LEMON TART",
  "image": "http://www.maryberry.co.uk/media/recipes/2012/12/18/12_inlineImage.jpg",
  "href": "http://www.maryberry.co.uk/recipes/great-british-bake-off-recipes/classic-lemon-tart",
  "extension": "Chrome",
  "firstAdded": "2018-11-24T20:18:43.034000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "You will need a 28cm deep loose-bottomed tart tin.",
    "To make the pastry, measure the flour, butter and sugar into a processor. Whiz until the mixture looks like breadcrumbs and then add the egg and water. Whiz again until it forms a ball.",
    "Roll out the pastry thinly on a floured work surface until it is just a little bigger than the size of the tin. Line the tart tin with the pastry, letting the extra pastry hang over the sides of the tin. Place on a baking sheet and then chill in the fridge for 30 minutes.",
    "Peheat the oven to 200C/fan 180C/gas 6. Line the tin with nonstick paper and fill with baking beans. Blind bake for 15 minutes in the preheated oven until pale golden brown.",
    "Take out of the oven and remove the baking beans and paper. Carefully trim the excess pastry from the sides using a sharp knife. Return the empty pastry shell to the oven for another 10-12 minutes or until it is completely dry. Set aside to cool.",
    "Reduce the temperature of the oven to 160C/140C fan/gas 3.",
    "Measure all the filling ingredients into a bowl and whisk until smooth. Carefully pour the filling mixture into the cold baked pastry case.",
    "Transfer the tart and tray carefully to the oven and bake for 35-40 minutes or until just set but still with a slight wobble in the middle. The filling will sink down a bit when it has cooled.",
    "Leave to cool a little, or completely, and then remove it from the tin. Transfer to a serving plate and dust with icing sugar to serve."
  ],
  "ingredients": [
    "0",
    "PASTRY",
    "225g plain flour",
    "150g cold butter, cut into small cubes",
    "25g icing sugar",
    "1 large egg, beaten",
    "2 tbsp water",
    "LEMON FILLING",
    "9 large eggs",
    "300ml double cream",
    "350g caster sugar",
    "finely grated zest and juice of 6 large lemons"
  ],
  "__v": 1
}