{
  "hash": "49efb8ad7b711ba01f966f6ccdd981d6ee1bb1a2",
  "title": "Cheesy Vegan Breakfast Potato Casserole",
  "image": "https://holycowvegan.net/wp-content/uploads/2017/07/cheesy-vegan-potato-breakfast-casserole-150x150.jpg",
  "href": "https://holycowvegan.net/cheesy-vegan-breakfast-potato-casserole/",
  "extension": "Chrome",
  "firstAdded": "2017-08-14T21:05:46.973000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Make the cheesy sauce by combining all ingredients and blending into a really smooth paste. Set aside.",
    "Place the diced potatoes in a microwave-safe dish and add 1 tbsp water. Cover and nuke on high for five minutes or until potatoes are tender.",
    "Preheat the oven to 350 degrees F.",
    "In a large skillet, heat the oil. You can do this in a 10-inch cast-iron skillet or any skillet that can go from the stove to the oven, to reduce cleanup.",
    "Add the onions, garlic and parsley to the oil. Season with salt and ground black pepper and saute, stirring, for five minutes over medium heat or until the onions are soft.",
    "Add the sausage and potatoes and continue to cook, about five minutes. Check seasoning and add more pepper and salt if needed.",
    "If you are using a cast iron or a stove-to-oven skillet, arrange the potato mixture in an even layer and pour the cheesy sauce over it evenly. If using a baking dish, like I did, transfer the potato sausage mixture to the baking dish and pour the cheesy sauce on top.",
    "Transfer the skillet or baking dish to the oven and bake 30 minutes or until the top starts to lightly brown. Switch to the broil function on your oven and broil for another five minutes on the highest setting, or until gold-brown spots appear on the potatoes and cheesy sauce.",
    "Remove from the oven, garnish with more parsley if you wish, and serve hot or at room temperature.",
    "Recipe Notes",
    "You can make the cheesy sauce and the potato-sausage mixture the previous night. Mix them in the baking dish in the morning and proceed to bake."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 medium onion, finely chopped",
    "3 cloves garlic, minced",
    "2 tbsp parsley, chopped",
    "1 tsp olive oil or any vegetable oil",
    "3 medium red or yellow potatoes, cut in a 1-cm dice",
    "4 links vegan Italian sausage (approx 14 oz), crumbled or sliced thinly",
    "1/2 tsp red pepper flakes",
    "Salt to taste",
    "For the cheesy sauce:",
    "3/4 cup raw cashews, soaked for at least 30 minutes in 1 1/2 cups water",
    "2 tsp onion powder",
    "1 tsp garlic powder",
    "1/4 cup nutritional yeast",
    "1/2 tsp dry sage",
    "Salt and ground black pepper to taste"
  ],
  "__v": 1
}