{
  "__v": 1,
  "directions": [
    "0",
    "Place chicken in the slow cooker so pieces overlap as little as possible. In a medium mixing bowl, combine soy sauce, honey, garlic, onion, red pepper flakes, vinegar and sesame oil then stir until the honey is completely dissolved. Pour sauce over the chicken then cover and cook on low setting for 3½–4½ hours, until meat is tender and falling off the bone.",
    "Use a slotted spoon to remove chicken from cooking liquid then transfer to a plate to cool slightly. When chicken is cool enough to handle, remove bones then shred chicken into small pieces. Transfer shredded chicken to large mixing bowl then cover to keep warm.",
    "Next, pour cooking liquid into a small saucepan then remove pieces of bone or chicken from sauce. In a small bowl, combine cornstarch and water together until smooth. Whisk the cornstarch mixture into the sauce then place the pan over medium heat. Bring sauce to a bubble, whisking constantly. Once the sauce comes to a bubble, reduce heat to low and let simmer for 1 minute.",
    "Coat shredded chicken in the desired amount of sauce, tossing to combine. Start with half the sauce then add more as needed. Serve any leftover sauce on the side. Present chicken piled high atop fresh steamed rice, then garnish with sliced green onion and a sprinkling of sesame seeds. Enjoy!"
  ],
  "firstAdded": "2014-10-01T06:51:41.729000",
  "hash": "d7b487e1ffa714d652266aa1dbc327184047fbb0",
  "href": "http://www.cherylstyle.com/simple-food-recipes/dinner-recipes/slow-cooker-honey-garlic-chicken-recipe/",
  "image": "http://www.cherylstyle.com/wp-content/uploads/2014/04/slow-cooker-honey-garlic-chicken-recipe-cherylstyle-H.jpg",
  "ingredients": [
    "0",
    "3–3½ lbs bone-in chicken breasts or thighs, skins removed",
    "⅔ cup low-sodium soy sauce",
    "½ cup honey",
    "6 cloves garlic, minced",
    "½ yellow onion, finely diced",
    "½ tsp crushed red pepper flakes",
    "1 tsp white vinegar",
    "2 tsp sesame oil",
    "2 Tbsp cornstarch",
    "3 Tbsp water",
    "sliced green onion, for garnish",
    "sesame seeds, for garnish"
  ],
  "keywords": [
    "lbs",
    "bonein",
    "chicken",
    "breasts",
    "thighs",
    "skins",
    "lowsodium",
    "soy",
    "honey",
    "garlic",
    "yellow",
    "onion",
    "red",
    "pepper",
    "white",
    "vinegar",
    "sesame",
    "oil",
    "cornstarch",
    "water",
    "green",
    "seeds"
  ],
  "title": "slow cooker honey garlic chicken recipe",
  "users": [
    null
  ]
}