{
  "hash": "f61108aff7ad37929041c7f98713c6d3604eed57",
  "title": "Texas Roadhouse Roll Recipe with Honey Cinnamon Butter {Copycat}",
  "image": "http://bakerette.com/wp-content/uploads/2014/03/TX-Roadhouse-Rolls-7258-1.jpg",
  "href": "http://bakerette.com/texas-roadhouse-rolls-recipe/",
  "extension": "Chrome",
  "firstAdded": "2015-04-07T23:49:45.428000",
  "users": [
    null
  ],
  "keywords": [
    "milk",
    "scalded",
    "cooled",
    "room",
    "butter",
    "slightly",
    "active",
    "dry",
    "yeast",
    "water",
    "granulated",
    "sugar",
    "minus",
    "honey",
    "allpurpose",
    "flour",
    "eggs",
    "salt",
    "cinnamon"
  ],
  "directions": [
    "0",
    "In a small saucepan, bring milk to a boil and remove from heat. Allow to cool to room temperature..",
    "In a small microwave-safe dish, melt butter and set a side. In a separate bowl, mix together yeast, warm water, and 1 tablespoon sugar. Cover and set aside for 5 minutes while the yeast activates and foams.",
    "In a large mixing bowl, add yeast mixture, remaining sugar, honey, milk, and 3 1/2 cups flour. Beat together for two minutes. Add butter, eggs, and salt. Mix well.",
    "Add the remaining flour a half cup at a time and continue mixing until the dough begins to separate from the sides of the bowl.",
    "Knead dough for 5 minutes. If the dough seems sticky, add 1 tablespoon of flour at a time.",
    "Grease the inside of a large mixing bowl, place the dough in the bowl and turn over once to grease the top. Loosely cover the bowl with plastic wrap and allow the dough to rise in a warm place until double in size (about 45 mins to 1 hour).",
    "Punch down the dough with your fists and turn out onto a lightly floured surface. Roll the dough out until 1/2\" thick. Take one edge of the dough and fold the dough over in half. Using a rolling pin, lightly roll over the dough to seal it together.",
    "Cut the dough into 2-inch squares and place on a greased baking sheet. Cover lightly with plastic wrap and allow the dough to rise double in size (about 45 mins to 1 hour).",
    "Bake at 350 degrees F for 15 minutes or until golden brown. Remove from oven and immediately brush on butter to the tops of the rolls. Best when served warm!",
    "1",
    "Whip together all ingredients in a medium-size bowl. Serve on rolls while warm or store in an airtight container in the fridge."
  ],
  "ingredients": [
    "0",
    "2 cups milk, scalded and cooled to room temperature",
    "3 tablespoons butter, melted and slightly cooled",
    "1 package active dry yeast",
    "1/2 cup warm water",
    "1/2 cup granulated sugar minus 1 tablespoon",
    "1/2 cup honey",
    "7 to 8 cups all-purpose flour",
    "2 eggs",
    "2 teaspoons salt",
    "1",
    "1/2 cup butter",
    "1/2 cup powdered sugar",
    "1/2 cup honey",
    "1 teaspoon cinnamon"
  ],
  "__v": 1
}