{
  "__v": 5,
  "directions": [
    "0",
    "Fritters - Wash zucchini. With skins on, grate them with the coarse side of a grater. Put the grated zucchini in a colander and sprinkle liberally with salt. Let sit and drain for at least 30 minutes while you prepare the other ingredients.",
    "Remove the zucchini by the handful, squeezing to remove as much liquid as you can. Put it in a bowl with herbs, feta and green onions. Mix with a fork. Add the lightly beaten egg and stir. Add flour and bread crumbs. The mixture should be wet but not watery. Mix in a healthy dose of salt, I prefer coarse sea salt.",
    "Heat olive oil in a pan about 1/8 inch deep covering the entire pan. When hot, scoop out a spoonful of the zucchini mixture and put it in the pan. Let it cook about 3-4 minutes or until brown and then flip them. Cook another 3-4 minutes until browned. Remove fritters and place on a paper towel -lined plate to remove some excess oil. Serve hot with tzatiki sauce.",
    "Tzatziki (Cucumber Yogurt Dip) - If using regular yogurt, put yogurt in a cheesecloth lined sieve over a bowl. Drain several hours or overnight in the refrigerator. Greek yogurt is thicker and does not need the draining. Peel, seed and coarsely grate cucumbers. Drain well. Add garlic, vinegar, olive oil, sat and pepper to cucumbers. Mix well. Add drained yogurt and blend."
  ],
  "firstAdded": "2014-06-18T14:05:24.912000",
  "hash": "a9c0749697069e6e7fb25e4027d9f2ef21f666a6",
  "href": "http://whippedtheblog.com/2009/08/04/greek-zucchini-fritters-kolokithopitta-with-tzatziki/",
  "image": "http://whippedtheblog.com/wp-content/uploads/2009/08/zucchini-fritters-greek1.jpg",
  "ingredients": [
    "0",
    "2 medium to large zucchini coarsely grated",
    "1/2 cup feta cheese, crumbled",
    "4 green onions including green parts, chopped",
    "3 Tablespoons fresh mint, finely chopped",
    "2 Tablespoons fresh dill, finely chopped",
    "1 large egg",
    "1/2 cup flour",
    "4 Tablespoons Panko bread crumbs",
    "salt",
    "olive oil",
    "2 cups plain yogurt (or 2 cups, thick Greek yogurt",
    "2 large cucumbers",
    "1 1/4 Tablespoon minced garlic",
    "1 Tablespon white vinegar",
    "2 Tablespoons olive oil",
    "salt and white pepper to taste"
  ],
  "keywords": [
    "medium",
    "zucchini",
    "coarsely",
    "feta",
    "cheese",
    "crumbled",
    "onions",
    "green",
    "parts",
    "mint",
    "dill",
    "egg",
    "flour",
    "panko",
    "bread",
    "crumbs",
    "salt",
    "olive",
    "oil",
    "plain",
    "greek",
    "yogurt",
    "cucumbers",
    "garlic",
    "tablespon",
    "white",
    "vinegar",
    "pepper"
  ],
  "title": "GREEK ZUCCHINI FRITTERS (KOLOKITHOKEFTEDES) WITH TZATZIKI",
  "users": [
    null
  ]
}