{
  "hash": "3ce5184e8c612f397928def2e938c9cfd4c6835e",
  "title": "f you are a chinese curry fan then this one is for you. The one you get in most chinese take aways is from a packet with artificial flavouring so its not exactly the same but very close and in my opinion far better. It’s also way cheaper, so instead of paying €4 for a curry chips or €10 to have a curry delivered why not make this, you will make it quicker than a delivery will arrive!",
  "image": "",
  "href": "https://biamaith.ie/recipe-view/basic-chicken-curry-chinese-style/",
  "extension": "Chrome",
  "firstAdded": "2018-04-05T21:50:05.625000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "f you are a chinese curry fan then this one is for you.",
    "The one you get in most chinese take aways is from a packet with artificial flavouring so its not exactly the same but very close and in my opinion far better.",
    "It’s also way cheaper, so instead of paying €4 for a curry chips or €10 to have a curry delivered why not make this, you will make it quicker than a delivery will arrive!"
  ],
  "ingredients": [
    "0",
    "Allergens : Contains Gluten",
    "Chicken Fillet - 4",
    "Curry Powder see note in intro - 4 tsp",
    "Star Anise - 1",
    "Cumin - 2 tsp",
    "Chicken Stock - 800ml or 1 stock cube dissolved in 800 ml boiling water",
    "Flour - 3 tbsp",
    "Soy Sauce - 2 tsp",
    "Fresh Chilli (Optional) - As much as you like",
    "Onion - 1",
    "Garlic cloves - 2",
    "Oil - 3 tbsp",
    "INSTRUCTIONS",
    "1",
    "Getting Ready... You will need, 1 pot for the rice, 1 larger pot at least 1ltr for the sauce, 1 pan for the chicken, 1 sieve for the sauce and 1 colander for the rice, 1 chopping board (also a raw meat board if you have one), chopping knife.",
    "2",
    "Dissolve the stock cube in 800 ml of boiling water.",
    "3",
    "Chop 1/2 the onion & garlic then fry in a preheated pot for about 2 minutes without colouring.",
    "4",
    "Add the spices and flour, ensure you stir really well here esp if it starts to stick to the bottom of the pot.",
    "5",
    "After about 30 seconds or so add the chicken stock and soy sauce, stir, bring to the boil then turn the heat right down and simmer for 15 minutes.",
    "6",
    "Cut the chicken fillets into cubes, mix with a pinch of salt and pepper then fry on a preheated pan until it starts to brown.",
    "7",
    "Strain the sauce through the sieve then add the chicken and rest of the onion.",
    "8",
    "Simmer for a further 15 minutes then serve with rice or homemade chips, nom nom nom. If the sauce isn't thick after 15 minutes keep it simmering until it does. This is called reducing the sauce.",
    "9",
    "If the sauce thickens too much add a little water to bring it back to the consistency you like.",
    "Categories: CHICKENCHINESECURRYFILLET",
    "PAULA MCLEAN",
    "10TH FEBRUARY 2017",
    "REPLY",
    "Have made this many times. Very easy and tastes delicious. Haven’t ordered a chicken curry since!",
    "LIAM BOLAND - BIAMAITH CHEF",
    "12TH FEBRUARY 2017",
    "REPLY",
    "That is what I love to hear Paula. The more people I can get cooking homemade rather than going to take aways the better Thank you for the feedback",
    "Liam",
    "GORMAL",
    "13TH FEBRUARY 2017",
    "REPLY",
    "This is my favourite recipe. Although I use a slightly different method, by making it in the morning (like a stew) omitting the flour, letting all the flavours soak in. Heating it up in the evening and thickening with a flour & water mix.",
    "Have also made it exactly as above when in a rush and was perfect. I used Spice Devils Kari, Daube blend and Tesco Tikka curry powder. All have tasted amazing.",
    "PAUL KENNEDY",
    "4TH MARCH 2017",
    "REPLY",
    "Great flavour, easy to follow recipe ,this goes down well with the family",
    "LORETO MOORE",
    "7TH MARCH 2017",
    "REPLY",
    "This is my favourite curry to make at the moment. It’s so quick and tasty.",
    "NAOMI",
    "14TH MARCH 2017",
    "REPLY",
    "I usually use the Tesco cylindrical plastic tub of curry powder but curious to know why no glass jars?",
    "LIAM BOLAND - BIAMAITH CHEF",
    "15TH MARCH 2017",
    "REPLY",
    "They are far more expensive, sometimes 3 or 4 times the price and the Schwartz one is terrible.",
    "MARY",
    "21ST MARCH 2017",
    "REPLY",
    "Made this this evening and it was a big hit with all ages",
    "AOIFE",
    "1ST APRIL 2017",
    "REPLY",
    "Yet another hit in this house Liam it was quick to make so very tasty and nicer than anything you get from the take away. At this stage I will be bookmarking all your recipes!!! Thanks for sharing",
    "YVONNE",
    "3RD APRIL 2017",
    "REPLY",
    "Hey,",
    "I made this today but substituted medium curry powder for a mild one (toddler’s not keen on spices food yet), it was tasty but seemed quite salty… is this because I changed the curry powder or should I just use a low salt stock?",
    "LIAM BOLAND - BIAMAITH CHEF",
    "3RD APRIL 2017",
    "REPLY",
    "I don’t know the brand you used so I really can’t say Yvonne. Maybe it is the curry powder or it could be the stock cube. I only use Knorr and find they aren’t too salty unless I add too much.",
    "Check the ingredients of the curry powder and see what the salt content is or consider using a different brand of stock cube.",
    "ADELE",
    "4TH APRIL 2017",
    "REPLY",
    "Can you make this in the slow cooker",
    "LIAM BOLAND - BIAMAITH CHEF",
    "5TH APRIL 2017",
    "REPLY",
    "Yes you can. It will add to the flavour. I would cook on low for 3 – 4 hours or high for 1.5",
    "DEE",
    "12TH APRIL 2017",
    "REPLY",
    "In the slow cooker do you follow same method or can you just pile it all in at the beginning? Thanks",
    "LIAM BOLAND - BIAMAITH CHEF",
    "13TH APRIL 2017",
    "REPLY",
    "Follow the same method then cook out I’m the slow cooker",
    "DEISELAD",
    "10TH APRIL 2017",
    "REPLY",
    "Must I fry the chicken first or can i just let it cook in the sauce, I use mini fillets which arent very thick, so cook quickly",
    "LIAM BOLAND - BIAMAITH CHEF",
    "13TH APRIL 2017",
    "REPLY",
    "It will taste a lot better if you fry them first",
    "GILLIAN",
    "29TH DECEMBER 2017",
    "REPLY",
    "I just used this for the last of my leftover turkey with chips! Delicious! I used your honey chilli sauce last night with turkey & veg served with rice & it was a real treat. Thanks for these recipes. Can’t wait to get your new book when it’s out!",
    "MAIREAD",
    "20TH FEBRUARY 2018",
    "REPLY",
    "Hi, I can’t wait to try this recipe. Do you use light or dark soy for it?",
    "LIAM BOLAND - BIAMAITH CHEF",
    "5TH APRIL 2018",
    "REPLY",
    "Light or dark mixed with equal amounts of water",
    "LEAVE A REPLY",
    "Your email address will not be published. Required fields are marked *",
    "COOKING CLASSES",
    "LIKE US ON FACEBOOK",
    "RECENT POSTS",
    "Private Lessons with Liam",
    "The House So Far…",
    "Learn to Be Organised like a Pro",
    "Review: Wet and Dry Grinder by Andrew James Worldwide",
    "Dreamy Interiors to chase away the January Blues",
    "Search for:",
    "RECIPE CATEGORIES",
    "Fish"
  ],
  "__v": 1
}