{
  "hash": "7747262a06017eb0993725a5d7c34243345fcf7b",
  "title": "One Sheet Pan Parmesan Crusted Salmon with Roasted Broccoli",
  "image": "http://www.cookingclassy.com/wp-content/uploads/2015/04/lemon-parmesan-crusted-salmon-with-roasted-broccoli4-srgb.jpg",
  "href": "http://www.cookingclassy.com/one-sheet-pan-parmesan-crusted-salmon-with-roasted-broccoli/",
  "extension": "Chrome",
  "firstAdded": "2017-01-27T19:33:01.579000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees. Line a rimmed baking sheet with aluminum foil. Spray foil with non-stick cooking spray.",
    "Place broccoli in a mound in center of baking sheet. Pour olive oil over broccoli along with garlic and toss to evenly coat. Season with salt and pepper to taste and spread near edges of baking sheet, leaving enough space in center to fit salmon fillets (note that if you like your broccoli more browned and roasted then let it roast for 5 minutes first then remove and spread to edges, this just gives it a head start. If you like it crisp tender and slightly roasted then no pre-roasting needed).",
    "Season bottom of salmon with salt and pepper and place salmon in center of baking sheet, leaving about 3/4-inch between fillets so they can evenly cook. In a mixing bowl whisk together mayonnaise, lemon juice and garlic and brush about 1/2 Tbsp over each fillet. Season top with salt and pepper. In a mixing bowl whisk together parmesan, bread crumbs, parsley, lemon zest and thyme, then drizzle 1 1/2 Tbsp olive oil into bowl and stir with a fork until evenly moistened. Spread parmesan mixture evenly over tops of salmon fillets. Bake in preheated oven until salmon fillets have cooked through, about 12 - 15 minutes (for a more golden crust you can broil during the last 1 - 2 minutes of baking if needed).",
    "Recipe source: Cooking Classy"
  ],
  "ingredients": [
    "0",
    "1 1/4 lbs broccoli crowns, stems cut and reserved for another use, florets chopped into bite size pieces",
    "2 1/2 Tbsp olive oil",
    "1 clove garlic, minced",
    "Salt and freshly ground black pepper",
    "4 (6 oz) skinless salmon fillets",
    "1 1/2 Tbsp mayonnaise",
    "1 1/2 tsp lemon juice (zest lemon first)",
    "1 clove garlic, minced",
    "Salt and freshly ground black pepper",
    "1/4 cup slightly packed finely grated parmesan",
    "1/4 cup bread crumbs",
    "1 Tbsp chopped fresh parsley",
    "1 1/2 tsp lemon zest",
    "1/4 tsp dried thyme",
    "1 1/2 Tbsp olive oil"
  ],
  "__v": 1
}