{
  "hash": "30f53c1dca5a6066c0404f3438334e28e0b85508",
  "title": "Chorizo-Chile Burgers",
  "image": "http://images.meredith.com/bhg/images/recipe/s_RU185346.jpg",
  "href": "http://www.bhg.com/recipes/printRecipe.jsp?recipeId=RU185346&catref=rcbhg1#51f953b611a1c78a71000043",
  "keywords": [
    "recipe",
    "poblanoavocado",
    "purchased",
    "avocado",
    "spread",
    "medium",
    "red",
    "onion",
    "juice",
    "lime",
    "white",
    "vinegar",
    "cumin",
    "kosher",
    "salt",
    "black",
    "pepper",
    "uncooked",
    "chorizo",
    "sausage",
    "beef",
    "chuck",
    "hamburger",
    "buns"
  ],
  "directions": [
    "0",
    "Prepare Poblano-Avocado Spread. Cover and refrigerate. For pickled onions, in medium saucepan of boiling water, heat onion slices 30 seconds. Transfer to bowl of ice water to cool. Drain. In second bowl combine cooled onions, lime juice, vinegar, cumin, salt, and pepper. Toss to coat. Let stand 30 minutes.",
    "In large skillet over medium-high heat, cook chorizo about 5 minutes, until slightly browned and becoming crisp, breaking up meat with a spatula. Remove from heat. Spread on plate lined with paper towels to cool.",
    "Build charcoal fire or preheat gas grill for direct cooking. In bowl combined cooled chorizo with ground beef. Form into six 3/4-inch thick patties. Indent center of each patty. Grill over medium heat, covered, for 10 to 12 minutes, until done (160 degrees F), turning once midway through grilling time. Spread Poblano -Avocado Spread on buns. Layer patties and pickled onions on buns. Makes 6 burgers",
    "Poblano-Avocado Spread:",
    "4. Char 1 fresh poblano pepper by holding with tongs over gas flame, placing on broiler rack, or baking on foil-lined baking sheet at 425 degrees F for 20 to 25 minutes (until skin is blistered and brown). Wrap pepper in foil. Let stand 20 to 30 minutes, until cool enough to handle. Slip off blackened skin, twist off stem, and scoop out seeds; discard skin, stem, and seeds. Coarsely chop, then transfer to small bowl. Halve, pit, and peel 1 avocado. Mash half the avocado; add to chopped pepper. Slice remaining avocado half and stir into poblano-avocado in bowl. Stir in 2 Tbsp. lime juice, 1 Tbsp. chopped cilantro, 1 tsp. mayonnaise, and kosher or sea salt to taste."
  ],
  "ingredients": [
    "0",
    "1",
    "recipe Poblano-Avocado Spread, or purchased avocado spread",
    "1",
    "medium red onion, thinly sliced",
    "Juice of 1 lime (2 Tbsp.)",
    "1",
    "tablespoon white vinegar",
    "1/2",
    "teaspoon ground cumin",
    "Kosher or sea salt and freshly ground black pepper, to taste",
    "6",
    "ounces uncooked chorizo sausage",
    "1 1/4",
    "pounds ground beef chuck",
    "6",
    "hamburger buns"
  ],
  "__v": 0
}