{
  "hash": "496274098805f6d26c8ccc3ba155d7d2769db784",
  "title": "Salted Caramel and Chocolate Pecan Pie Bars",
  "image": "http://cdn.averiecooks.com/wp-content/uploads/2014/06/pecanpiebarstext1.jpg",
  "href": "http://www.averiecooks.com/2014/06/salted-caramel-and-chocolate-pecan-pie-bars.html",
  "firstAdded": "2015-01-23T23:46:57.815000",
  "users": [
    null
  ],
  "keywords": [
    "crust",
    "unsalted",
    "butter",
    "soft",
    "allpurpose",
    "flour",
    "confectioners",
    "sugar",
    "cornstarch",
    "salt",
    "filling",
    "pecans",
    "pieces",
    "okay",
    "used",
    "trader",
    "joes",
    "roasted",
    "salted",
    "halves",
    "semisweet",
    "chocolate",
    "chips",
    "light",
    "brown",
    "whipping",
    "cream",
    "vanilla"
  ],
  "directions": [
    "0",
    "Preheat oven to 350F. Line an 8-by-8-inch baking pan with aluminum foil, spray with cooking spray; set aside. I strongly urge lining the pan with foil for easier cleanup.",
    "Crust - In a large bowl, combine all crust ingredients and using two forks or your hands (I find hands easier), cut butter into dry ingredients until evenly distributed and pea-sized lumps and sandy bits form. The softer the butter is, the quicker and easier it is.",
    "Turn mixture out into prepared pan and pack down firmly with a spatula or hands to create an even, uniform, flat crust layer.",
    "Filling - Evenly sprinkle the pecans.",
    "Evenly sprinkle with the chocolate chips; set pan aside.",
    "In a large, microwave-safe bowl, combine 1/2 cup butter, brown sugar, whipping cream, and heat on high power for 1 minute to melt.",
    "Remove bowl from micro, and whisk until mixture is smooth; it's okay if butter hasn't completely melted.",
    "Return bowl to microwave and heat for 1 minute on high power.",
    "Remove bowl from micro, and whisk until mixture is smooth.",
    "Whisk in the vanilla and salt.",
    "Slowly and evenly pour the caramel sauce over the chocolate chips and pecans.",
    "Place pan on a cookie sheet (as insurance against overflow) and bake for about 30 to 32 minutes, or until caramel is bubbling vigorously around edges, with bubbling to a lesser degree in center. Allow bars to cool in pan on a wire rack for at least 3 hours, or overnight (cover with a piece of foil and/or put pan inside large Ziplock), before slicing and serving. Bars will keep airtight at room temperature for up to 1 week, or in the freezer for up to 6 months."
  ],
  "ingredients": [
    "0",
    "Crust",
    "1/2 cup unsalted butter, very soft (1 stick)",
    "1 cup all-purpose flour",
    "1/4 cup confectioners' sugar",
    "1 tablespoon cornstarch",
    "pinch salt, optional and to taste",
    "Filling",
    "8 ounces roasted salted pecans, halves or pieces okay; about 2 cups (I used Trader Joe's roasted salted halves)",
    "1 cup semi-sweet chocolate chips",
    "1/2 cup unsalted butter (1 stick)",
    "1 cup light brown sugar, packed",
    "1/3 cup whipping cream or heavy cream",
    "1 tablespoon vanilla extract",
    "1/2 teaspoon salt, or to taste"
  ],
  "__v": 1
}