{
  "hash": "d3e2db265476068e3de055d427ec1aacc47d1a28",
  "title": "Saucy Chicken Meatballs in Creamy Asiago and Artichoke Sauce",
  "image": "",
  "href": "http://www.littlebroken.com/2015/11/09/saucy-chicken-meatballs-in-creamy-asiago-and-artichoke-sauce/",
  "extension": "Chrome",
  "firstAdded": "2016-10-31T02:25:35.172000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large mixing bowl, combine Panko with milk. Let stand until milk is absorbed. To the Panko, gently mix in the chicken, egg, onion, parsley, sour cream, salt, and pepper. The mixture will be sticky and wet.",
    "Turn on the broiler on HIGH. Spray a large baking sheet with nonstick spray. Set aside.",
    "Shape the chicken mixture into 2-inch (approx) meatballs and place in a single layer on the prepared baking sheet.",
    "Broil on HIGH for 4-5 minutes or until lightly golden on top. Meatballs will be raw inside. Remove from the oven and prepare the sauce.",
    "1",
    "In a large saute pan or dutch oven, heat olive oil on medium heat. Add onion and saute for 3 minutes or until just soft. Add garlic and cook for 1 minute. Add wine and cook for additional 1 minute. To the wine, add Bertolli Riserva Asiago Cheese and Artichokes Sauce, bay leaf, and red pepper flakes. Bring to a simmer. Add meatballs and reduce heat to low. Simmer partially covered for 20 minutes or until meatballs are fully cooked, stirring couple times. Disgard the bay leaf.",
    "To the sauce, add cream and cook just until heated through, about 1 minute. Turn off the heat and add spinach, stirring until wilted.",
    "Sprinkle with fresh shaved parmesan cheese and serve over cooked spaghetti. If desired, add a sprinkle of fresh chopped parsley."
  ],
  "ingredients": [
    "0",
    "½ cup Panko breadcrumbs",
    "¼ cup milk",
    "1 lb. ground chicken",
    "1 egg",
    "3 Tbsp. grated onion",
    "2 Tbsp. minced parsley",
    "2 Tbsp. sour cream",
    "1 tsp. salt",
    "½ tsp. black pepper",
    "1",
    "2 Tbsp. olive oil",
    "1 medium onion, diced",
    "2 garlic cloves, minced",
    "½ cup red wine (such as Pinot Noir or Red Blend wine)",
    "1 (24 oz) jar Bertolli Riserva Asiago Cheese and Artichokes Sauce",
    "1 bay leaf",
    "¼ tsp. red pepper flakes",
    "¼ cup light cream",
    "3 cups packed baby spinach leaves",
    "shaved fresh parmesan cheese",
    "2",
    "1 lb. spaghetti, cooked according to package",
    "fresh chopped parsley"
  ],
  "__v": 1
}