{
  "hash": "36a2a56db97aa70fe09c821ba93f1a9d6b28fd87",
  "title": "Orange, rose and polenta cake",
  "image": "http://static.guim.co.uk/sys-images/Guardian/Pix/pictures/2015/1/15/1421318611647/8c7a22ab-a857-4838-8e2e-56bb103b213e-460x276.jpeg",
  "href": "http://www.theguardian.com/lifeandstyle/2015/jan/17/orange-recipes-duck-orange-broth-fruit-salad-polenta-cake-our-10-best",
  "firstAdded": "2015-01-17T14:11:04.504000",
  "users": [
    null
  ],
  "keywords": [
    "butter",
    "room",
    "white",
    "sugar",
    "dark",
    "muscovado",
    "eggs",
    "almonds",
    "polenta",
    "juice",
    "zest",
    "oranges",
    "rose",
    "petals",
    "baking",
    "orange"
  ],
  "directions": [
    "0",
    "n a food processor, blitz the butter, white sugar and dark muscovado sugar until pale and fluffy. You can do this with a wooden spoon, but it’s far easier in a machine.",
    "2 While the processor is working, slowly add the beaten eggs to the mix. Be careful not to add the eggs too quickly or the mix will split.",
    "3 Add the ground almonds and polenta to the mix and blitz again to form a smooth batter.",
    "4 Add the orange zest and juice to the batter along with the rose petals and baking powder, then blitz one final time. Preheat the oven to 160C/325F/gas mark 3.",
    "5 Line a 25cm-diameter springform cake tin with parchment paper and pour the batter in. Bake for 55 minutes or until a skewer inserted into the centre comes out clean.",
    "6 While the cake is cooking, make the topping. Put the white sugar and orange juice into a pan and bring to the boil. Simmer over a low heat for 3-5 minutes until it’s a light syrup.",
    "7 Once the cake is cooked, still in the tin and warm, skewer 15–20 holes into the top and evenly pour the hot syrup over it, tilting the cake so the syrup is evenly distributed. Sprinkle the remaining 10g of rose petals and zest of the remaining orange on top and allow the whole thing to set in the fridge overnight. Serve with creme fraiche loosened with a splash of rose water to taste, and chopped mint leaves."
  ],
  "ingredients": [
    "0",
    "225g butter (at room temperature)",
    "125g white sugar",
    "100g dark muscovado sugar",
    "4 eggs, beaten",
    "225g ground almonds",
    "115g polenta",
    "Juice and zest of 3 oranges",
    "A large pinch of rose petals",
    "1½ tsp baking powder",
    "For the topping",
    "100g white sugar",
    "75g orange juice",
    "A small handful of rose petals",
    "Zest of 1 orange"
  ],
  "__v": 1
}