{
  "hash": "5383d13b567c041722acac26bd80cda19400697a",
  "title": "Tasting Table's Matzah Tacos",
  "image": "http://a.abcnews.com/assets/images/font-sm_off2.gif",
  "href": "http://abcnews.go.com/GMA/recipe/matzah-tacos-recipe-tasting-table-23244957?nwltr=GMAR_tryHed_pos2",
  "extension": "Chrome",
  "firstAdded": "2015-03-27T21:20:02.231000",
  "users": [
    null
  ],
  "keywords": [
    "chile",
    "braised",
    "brisket",
    "second",
    "split",
    "kosher",
    "salt",
    "black",
    "pepper",
    "canola",
    "oil",
    "celery",
    "yellow",
    "onion",
    "carrot",
    "garlic",
    "sprigs",
    "thyme",
    "guajillo",
    "stem",
    "bay",
    "leaf",
    "smoked",
    "paprika",
    "cumin",
    "cocacola",
    "beef",
    "stock",
    "plum",
    "tomatoes",
    "pickled",
    "red",
    "onions",
    "wine",
    "vinegar",
    "water",
    "sugar",
    "matzah",
    "tortillas",
    "meal",
    "olive"
  ],
  "directions": [
    "0",
    "Chile Braised Brisket",
    "Preheat the oven to 325 degrees F. Season the brisket on both sides with salt and pepper. In a 6-quart Dutch oven over medium-high heat, heat the oil. Add the meat to the pan, fat side down, and sear until golden brown, about 2 minutes. Flip the meat over and continue searing until all sides are golden brown, about 6 minutes.",
    "Remove the meat from the pan and set aside. Reduce the heat to medium and add the celery, onion, carrot, garlic, thyme, chile and bay leaf to the pan and cook until the vegetables start to caramelize, about 6 minutes. Add the smoked paprika and cumin and cook 2 minutes more.",
    "Add the cola, beef stock, and tomatoes; use a wooden spoon to scrap the caramelized bits off the bottom of the pan. Turn the heat to high and bring",
    "the liquid to a boil. Return the meat back to the pan, fat side up. The liquid should come up at least halfway up the brisket. Cover the pot with a lid or foil, place in the oven and cook until tender, 3 hours.",
    "Remove the meat from the pan, discard the thyme sprigs and bay leaf, and let the liquid cool slightly. Carefully pour the liquid and vegetables into a blender and blend until smooth. Return the Dutch oven to the stove over medium heat, pour the blended sauce into it and simmer the sauce until it thickens slightly, about 10 minutes.",
    "Slice or shred the meat into small pieces then add to the pot containing the sauce; cook for another minute, just until the meat is heated through.",
    "Pickled Red Onion",
    "Place all ingredients except onion into a small saucepan over high heat and bring to a boil. Add the onion, stir to combine, and cook for 1 minute until the onions wilt slightly. Transfer the onions and liquid to a heatproof bowl and let stand until it reaches room temperature, then cover it and place in the refrigerator for at least an hour. Pickled onions can be made up to a week in advance.",
    "Matzah Tortillas",
    "In a medium bowl, combine all the ingredients and, using your hands, work the mixture until a soft dough forms. Cover the dough with a warm, damp towel to prevent it from drying out while you make the tortillas.",
    "Place a 9-inch nonstick pan over low heat. Scoop a 1/4 cup of the dough and, using your hands, form it into a flat disk with smooth edges. Place the disk between two sheets of plastic wrap and, with a rolling pin, roll into a circle that is 7 1/2 inches in diameter. Transfer the tortilla to the pan and cook for 25 seconds, then flip and cook on the second side for another 25 seconds. Transfer to a cooling rack. Repeat this process with the remaining dough. Note: If the dough gets dry, knead in a tablespoon of water.",
    "Recipe courtesy TastingTable.com."
  ],
  "ingredients": [
    "0",
    "Chile Braised Brisket",
    "3 pounds brisket (second cut), split in half 2 teaspoons kosher salt",
    "1 teaspoon freshly ground black pepper",
    "2 tablespoons canola oil",
    "1 cup chopped celery",
    "1 cup chopped yellow onion",
    "1 cup chopped carrot",
    "2 cloves garlic",
    "5 sprigs fresh thyme",
    "1 dried guajillo chile, stem removed 1 bay leaf",
    "1/2 teaspoon smoked paprika",
    "1/2 teaspoon ground cumin",
    "2 cups Coca-Cola",
    "2 cups beef stock",
    "1 cup diced fresh plum tomatoes",
    "Pickled Red Onions",
    "1/2 cup red wine vinegar",
    "1/2 cup water",
    "1 teaspoon salt",
    "1 teaspoon sugar",
    "1/2 teaspoon red pepper flakes",
    "1 large red onion, thinly sliced",
    "Matzah Tortillas",
    "2 cups matzah meal",
    "1 1/2 cups warm water",
    "1 tablespoon olive oil",
    "1 teaspoon salt"
  ],
  "__v": 1
}