{
  "hash": "47637e99ab2913c8bc3141820fc24daa38223e07",
  "title": "Easy No Knead Focaccia Bread with Rosemary & Sea Salt",
  "image": "https://cmt.azureedge.net/media/easy_no_knead_focaccia_bread_with_rosema_201812022243330351637ecae9.jpg",
  "href": "https://www.copymethat.com/r/XwTN7xE/easy-no-knead-focaccia-bread-with-rosema/",
  "extension": "",
  "firstAdded": "2018-12-27T18:31:35.792000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Steps",
    "In a large mixing bowl combine the flour, yeast and salt then add 1 tablespoon of olive oil.",
    "Add the water and mix well until you can see no more dry flour and you have a wet, slightly lumpy looking mess. Make sure to scrape right into the bottom of the bowl. (See my picture in the collage near the top of my post above for reference).",
    "Cover with cling wrap or a clean shower cap and leave on the kitchen counter for a minimum of 7 hours and a maximum of 9 hours. Do not refrigerate and do not leave anywhere really warm. Just normal room temperature is fine.",
    "About 20 minutes before the time is up preheat your oven to 400°F and line an 8 x 8 square pan (a cake tin or brownie pan) with parchment paper. See recipe notes for tin alternatives.",
    "When the oven is at temperature, scrape the dough out of the bowl and into the pan. I use a dough scraper but a silicone spatula or spoon will be fine. It will be clingy and sticky but that is normal.",
    "Once it's all in the pan, flatten it out so it's as even as you can get it all over, then using a finger dipped in olive oil, make dimples all over the top.",
    "Drizzle over the olive oil (be as generous as you feel comfortable with) and sprinkle on the rosemary and salt.",
    "Place in the preheated oven and bake for about 37 - 40 minutes.",
    "When done it will be starting to go golden brown in places on the top. If you want it a little crustier you can bake it for another 5 minutes but no longer as otherwise it will become dry.",
    "Remove from the oven, lift out using the paper as handles and place on a cooling rack.",
    "Leave to cool for at least 15 minutes before cutting.",
    "Notes",
    "I have included amounts in cups as well as weights but I would highly recommend using the weight measurements for the very best results. Cup measurements are too variable & there is a chance they could affect your results. Digital kitchen scales can be purchased really cheaply for around $10-$15 & they really do make all the difference for baked goods where accuracy is key to good results).",
    "If you don't have an 8 x 8 square tin then you can use a 9 inch round pan instead. You could also use a slightly bigger pan but the bread will end up thinner so will need a bit less time to bake. 8 x 8 or 9 inch round are the optimum sizes for a decent depth and finish though."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "500 g | 3¾ cups plus 4 ½ teaspoons all purpose flour or bread flour cups measured by spooning the flour into the cups and levelling off with the back of a knife - do not scoop and do not compact the flour down by pressing on it as you fill the cup (in the UK use strong bread flour)",
    "10 g | 1 very full tablespoon instant yeast or quick rise yeast . NOT regular active yeast",
    "10 g | 2 teaspoons salt",
    "1 tablespoon olive oil",
    "450 mls | 1¾ cup plus 2 tablespoons | 15.2 U.S oz COLD water not warm water",
    "60 mls | 4 tablespoons good olive oil for drizzling Just drizzle as much as you feel comfortable with on top - I like a bit more ;O",
    "2 tablespoons fresh or dried rosemary",
    "sea salt flakes or crystals for scattering"
  ],
  "__v": 1
}