{
  "hash": "794d1948302e4566a9e92bf50cdb90dedabd83bf",
  "title": "IRISH BAKED POTATO SOUP WITH CORNED BEEF AND CRISPY LEEKS",
  "image": "https://hostthetoast.com/wp-content/uploads/2016/03/Irish-Baked-Potato-Soup-with-Crispy-Leeks3-150x150.jpg",
  "href": "https://hostthetoast.com/irish-baked-potato-soup-with-corned-beef-and-crispy-leeks/",
  "extension": "",
  "firstAdded": "2019-07-01T15:31:45.770000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Melt the butter in a large pot over low heat. Chop 2 of the leeks, light green and white parts only. Rinse the leeks and then pat dry. Add the leeks and onion to the pot and cover. Cook for 20 minutes.",
    "Add the potatoes to the pot and stir to combine. Cover and cook for an additional 15 minutes.",
    "Pour in the chicken broth and bring the mixture to a boil. Reduce the heat to a simmer and cook until the potato is very soft, about 30 minutes.",
    "As the soup cooks, prepare the crispy leeks. Preheat the oven to 425 degrees F. Cut the remaining leek into long, thin strips. Rinse the strips and then pat dry.",
    "Drizzle the leeks with up olive oil in a large bowl until covered, up to 1 tablespoon. Toss the oiled leeks with the flour, paprika, garlic power, and a generous amount of salt and pepper, until coated.",
    "Spread onto a baking sheet and bake until crisp, about 10 minutes. Let the leeks cool on the sheet.",
    "Once the potatoes are soft, use a hand blender to puree the soup mixture until thick and smooth. Return the pot to heat and mix in the heavy cream. Season with salt and pepper, to taste, and add in half of the chopped corned beef.",
    "Top with the remaining corned beef, cheddar cheese, chives, and crispy leeks, to serve."
  ],
  "ingredients": [
    "0",
    "1/2 cup (1 stick) unsalted butter",
    "3 leeks, divided",
    "1 small onion, sliced",
    "4 cups peeled and diced russet potatoes (about 3 potatoes)",
    "4 cups chicken broth",
    "1 tablespoon olive oil",
    "1/4 cup all purpose flour",
    "2 teaspoons paprika",
    "2 teaspoons garlic powder",
    "Kosher salt and black pepper, to taste",
    "1 cup heavy cream",
    "8 ounces cooked corned beef, chopped",
    "6 ounces Irish cheddar cheese, shredded",
    "1 bunch chives, chopped"
  ],
  "__v": 1
}