{
  "hash": "763fc396919da5cbed8152c70deaa6e983614f22",
  "title": "Spicy Thai Peanut Chicken Sweet Potato Noodle Stir Fry",
  "image": "https://cmt.azureedge.net/media/spicy_thai_peanut_chicken_sweet_potato_n_20181125135211084897psbo8t.jpg",
  "href": "https://www.copymethat.com/r/FPNeh7O/spicy-thai-peanut-chicken-sweet-potato-n/unconfirmed/",
  "extension": "",
  "firstAdded": "2018-12-27T18:35:44.957000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the sauce: In a medium bowl whisk together the peanut butter, soy sauce, ginger, garlic, sriracha, honey, sesame oil and almond/coconut milk until smooth. Set aside.",
    "Cut the ends off of the sweet potato and then use your spiralizer to spiralize it; if you don't have a spiralizer you can use a julienne peeler to make the noodles. Set noodles aside.",
    "Next season the chicken pieces with salt and pepper. Heat 1/2 tablespoon of sesame oil in a large skillet or saucepan over medium high heat. Once oil is hot, add chicken pieces and cook for 4-6 minutes or until no longer pink. Once cooked through, remove chicken and transfer to a bowl.",
    "Add in the other 1/2 tablespoon of sesame oil to the skillet along with broccoli florets and red pepper strips. Stir-fry for about 5 minutes until the broccoli is a little tender, then add in sweet potato noodles and cook for 1-2 minutes longer. Next add in peanut sauce and chicken; stirring to coat veggies. Reduce heat to medium low and cook for another few minutes until sweet potato noodles are al dente. Garnish with green onions, chopped peanuts, and cilantro, if desired. Serves 4.",
    "Notes",
    "Instead of peanut butter, you may use another nut butter such as almond or cashew butter. I would recommend cashew butter."
  ],
  "ingredients": [
    "0",
    "FOR THE SAUCE:",
    "1/4 cup all natural creamy peanut butter",
    "2 tablespoons gluten free soy sauce",
    "1/2 teaspoon ground ginger",
    "1 garlic clove, finely minced",
    "1-2 tablespoons sriracha sauce, depending on how spicy you like things",
    "1/2 tablespoon honey",
    "1 teaspoon sesame oil",
    "3/4 cup unsweetened almond or coconut milk from the carton (or light coconut milk from the can)",
    "FOR THE STIR FRY:",
    "3 medium sweet potatoes, peeled",
    "1 tablespoon sesame oil, divided",
    "1 pound organic chicken breast, cut into 1 inch pieces",
    "2 1/2 cups broccoli florets",
    "1 large red bell pepper, sliced into thin strips",
    "For garnish: green onions, chopped peanuts, and cilantro, if desired",
    "Steps"
  ],
  "__v": 1
}