{
  "hash": "eaadf4d865c83b2aa5e30f160cb98ed9f8cf858f",
  "title": "Cubano",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2012/2/24/3/DV1309H_cubano_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/cubano-recipe.html",
  "firstAdded": "2015-01-24T19:39:22.314000",
  "users": [
    null
  ],
  "keywords": [
    "kosher",
    "salt",
    "brown",
    "sugar",
    "cumin",
    "coriander",
    "allspice",
    "mustard",
    "seed",
    "black",
    "pepper",
    "fennel",
    "bay",
    "leaves",
    "pork",
    "butt",
    "shoulder",
    "bunches",
    "cilantro",
    "roughly",
    "garlic",
    "bottles",
    "beer",
    "belgian",
    "white",
    "best",
    "german",
    "wheat",
    "lager",
    "work",
    "zest",
    "juice",
    "limes",
    "orange",
    "honey",
    "dijon",
    "rings",
    "pureed",
    "pineapple",
    "smallest",
    "bonein",
    "ham",
    "available",
    "loaf",
    "ciabatta",
    "olive",
    "oil",
    "drizzling",
    "swiss",
    "cheese",
    "slices",
    "pickles",
    "recipe",
    "follows",
    "chayote",
    "slaw",
    "plantain",
    "chips",
    "kirby",
    "cucumbers",
    "vinegar",
    "seeds",
    "peppercorns",
    "bunch",
    "dill",
    "radishes",
    "squash",
    "lime",
    "green",
    "plantains",
    "frying"
  ],
  "directions": [
    "0",
    "For the pork: Combine the kosher salt, brown sugar, cumin, coriander, allspice, mustard, pepper, cloves, fennel and bay leaves. Then rub over the pork butt and set aside.",
    "For the marinade: Add the cilantro, garlic and salt to a food processor with 1/4 cup beer. Puree until the mixture becomes pesto-like. Then add the remaining beer, lime zest and juice and orange zest and juice. Cover the pork butt and marinate in the refrigerator for 48 hours.",
    "Preheat the oven to 200 degrees F. Cook the pork until the meat pulls effortlessly off the bone, about 6 hours. Pull the meat and leave in its juices.",
    "For the ham: Preheat the oven to 240 degrees F. Whisk the honey, mustard, brown sugar and pineapple puree. Smother over the outside of the ham. Put the ham in a roasting pan and surround with beer. Cover with tin foil. Cook until the meat pulls effortlessly off the bone, 8 to 10 hours. Pull the meat and leave in its juices.",
    "For the sandwich: Slice the ciabatta in half, drizzle the bread with olive oil and toast for 8 to 10 minutes. Then let it sit out for 30 minutes; the staleness of the bread will allow it to hold the juices from the pork and ham.",
    "To assemble: Preheat the broiler. Layer the bottom half of the bread with the pulled pork and ham. Slice the Pickles lengthwise about 1/8-inch on a mandoline and place on top of the meat. Place the Swiss cheese over the pickles and broil until the cheese is bubbly and golden, about 2 minutes. Top with other half of bread and slice the sandwich in half diagonally on a long bias. Cut into smaller sandwiches and serve with Chayote Slaw and Fried Plantains.",
    "This recipe was provided by a chef, restaurant or culinary professional and makes a large quantity. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results.",
    "Put the cucumbers in an ice bath.",
    "Add 12 cups water, the vinegar, fine salt, mustard seeds, peppercorns, coriander, bay leaves, garlic and dill to a large pot and bring to boil.",
    "Pull the cucumbers from the ice bath and add to mason jars. Carefully pour the boiling brine over the cucumbers and secure the lids, making sure the cucumbers are fully",
    "submerged. Do not refrigerate for 24 hours. Always store the pickles in the brine.",
    "Slice the radishes and chayote 1/4-inch thick on a mandoline. Combine with the cilantro, lime zest and lime juice in a mixing bowl and add salt to taste, adjusting the amount of lime juice as necessary.",
    "Score the plantains on 2 sides and peel the skin. Thinly slice small circles using a mandoline.",
    "Heat the oil in a deep-fryer to 325 degrees F. Add the plantains and fry for 6 to 8 minutes.",
    "Remove to a mixing bowl lined with a paper towel to absorb excess oil. Add the salt and sugar and toss.",
    "Recipe courtesy John DeCoursy, Sidecar Restaurant"
  ],
  "ingredients": [
    "0",
    "1/2 cup kosher salt",
    "1/2 cup brown sugar",
    "2 tablespoons ground cumin",
    "1 tablespoon ground coriander",
    "1 teaspoon ground allspice",
    "1 teaspoon ground mustard seed",
    "1 teaspoon ground black pepper",
    "1/2 teaspoon ground cloves",
    "1/2 teaspoon ground fennel seed",
    "2 bay leaves",
    "3 to 4 pounds pork butt (shoulder)",
    "2 bunches fresh cilantro, roughly chopped",
    "1/4 cup garlic cloves",
    "1 pinch salt",
    "2 bottles beer (Belgian white is best, but German wheat or lager work)",
    "Zest and juice of 2 limes",
    "Zest and juice of 1 orange",
    "4 tablespoons honey",
    "4 tablespoons Dijon mustard",
    "4 tablespoons brown sugar",
    "2 rings fresh cut pineapple, pureed (or two 6-ounce cans pineapple juice)",
    "The smallest bone-in ham available",
    "2 bottles beer (Belgian white is best, but German wheat or lager work)",
    "1 loaf ciabatta",
    "Olive oil, for drizzling",
    "Swiss cheese slices",
    "Pickles, recipe follows",
    "Chayote Slaw, for serving, recipe follows",
    "Plantain Chips, for serving, recipe follows",
    "12 kirby cucumbers",
    "4 cups white vinegar",
    "3/4 cup fine salt",
    "1 tablespoon mustard seeds",
    "1 tablespoon whole peppercorns",
    "2 teaspoons whole coriander",
    "4 bay leaves",
    "2 cloves garlic, sliced",
    "1/2 bunch fresh dill, chopped",
    "1 pint radishes",
    "2 chayote squash",
    "1/4 cup fresh cilantro leaves",
    "Zest and juice of 1 lime",
    "Salt",
    "2 green plantains",
    "Vegetable oil, for frying",
    "1 pinch salt",
    "1 pinch sugar"
  ],
  "__v": 1
}