{
  "hash": "2afb1bfeb194e63dd881d882dce933981fc3a6e6",
  "title": "SRIRACHA MAC + CHEESE",
  "image": "",
  "href": "http://www.shutterbean.com/2013/sriracha-mac-cheese/",
  "extension": "Chrome",
  "firstAdded": "2017-07-03T20:31:29.343000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "to make the mac sauce:",
    "Heat the milk in a pot over medium heat until it just starts to bubble, but is not boiling, 3-4 minutes. Remove from the heat.",
    "Heat the butter over medium heat in a separate, heavy bottomed pot. When the butter has just melted, add the flour and whisk constantly until the mixture turns light brown, about 3 minutes. Remove from heat.",
    "Slowly pour the warm milk, about 1 cup at a time, into the butter-flour mixture, whisking constantly. It will get thick when you first add the milk, and thinner as you slowly pour in the entire 3 cups. This is normal.",
    "Once all the milk has been added, set the pot back over medium-high heat, and continue to whisk constantly. In the next 2-3 minutes the sauce should come together and become silk and thick. Use the spoon test to make sure it’s ready. Dip a metal spoon into the sauce-if the sauce coats the spoon and doesn’t slide off like milk, you know it’s ready. Add the salt and stir to combine.",
    "to make the sriracha mac & cheese:",
    "Preheat oven to 400F.",
    "Cook the pasta in salted boiling water until a little less than al dente. Drain, rinse with cold water, and drain the pasta again.",
    "Mash together the ginger and butter in a small bowl until fully combined.",
    "Add the mac sauce, cheese, and ginger butter to a large heavy-bottomed pot and cook over medium heat. Stir until the cheese is barely melted, about 3 minutes. Add the sriracha and the cooked pasta and continue cooking while stirring continuously until the dish is nice and hot, another 5 minutes. Add the green onions and stir to fully combine.",
    "Pour the mac into a 14-inch casserole pan and sprinkle with panko. Bake until hot and bubbly and the topping is golden, about 20 minutes. Remove from the oven and drizzle with more sriracha. Spoon into bowls and serve."
  ],
  "ingredients": [
    "0",
    "mac sauce:",
    "3 cups whole milk",
    "1/2 cup unsalted butter",
    "1/2 cup all-purpose flour",
    "2 teaspoons kosher salt",
    "for the pasta:",
    "3/4 pound dried elbow pasta",
    "1 tablespoon minced fresh ginger",
    "2 1/2 tablespoons unsalted butter, at room temperature",
    "2 cups grated Havarti",
    "2-3 tablespoons Sriracha sauce, plus more for drizzling",
    "1 cup chopped green onions (both green and white parts)",
    "3/4 cup panko (Japanese bread crumbs)"
  ],
  "__v": 1
}