{
  "hash": "160bb090dd9a59c115b6b75d9e39c4f6583fd54c",
  "title": "Potato Greens and Rice",
  "image": "http://www.african-recipes-secrets.com/images/potato-greens-c.jpg",
  "href": "http://www.african-recipes-secrets.com/potato-greens.html",
  "extension": "Chrome",
  "firstAdded": "2018-01-17T17:13:23.128000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "First, you have to cook your chicken, meat, and shrimp.",
    "Cut your chicken into 1 1/2 inch pieces. Cut stewing beef into 1 inch pieces. Peel and de-vein shrimp.",
    "Combine and add 1 tsp salt and 1 tsp seasoned salt. Stir to spread seasoning evenly. Separate shrimp from beef and chicken.",
    "Add two cookspoon of oil to a large skillet. Heat oil on medium high. When oil is hot, fry chicken until both sides are golden brown. Remove from oil.",
    "Next, fry shrimp until golden brown and add. Reduce heat to medium and sautee’ beef until cooked. Cut turkey in small 1/2 inch pieces and add to pot. Set aside.",
    "Then, prepare your greens.",
    "Remove the leaves from the stems. Do this by snapping the stem about 1/2 inch from the leaf base. Rinse the leaves and transfer to a pan of water. Sprinkle a pinch of baking soda over leaves.",
    "Rub the leaves. Pretend you are scrubbing and washing a piece of cloth between your two hands. Then wring the leaves using your two hands. Transfer to a clean pan.",
    "Now, cook your greens.",
    "Heat one cup of oil in a deep cooking pot on medium high. Sprinkle a pinch of baking soda. Add chopped greens, onions, and pepper. Fry for 20 minutes, stirring frequently.",
    "Reduce heat to medium-low. Cook for 20 more minutes stirring frequently. Add cooked chicken, beef, turkey, and shrimp. Simmer on low about 15 minutes, continuing to stir.",
    "Your greens are ready. Eat on a bed of rice. Serve with fried plantains as a side"
  ],
  "ingredients": [
    "0",
    "2 bags fresh potato greens (4 Cups pressed down)",
    "1 lb peeled shrimp",
    "3 lbs chicken and beef",
    "1 C smoked turkey",
    "2 medium onion (chopped)",
    "1 1/2 tsp salt",
    "2 tsp seasoned salt",
    "1/4 tsp ground black pepper",
    "Baking soda",
    "1 C cooking oil",
    "2 Cookspoon oil",
    "2 Maggi Chicken Soup (optional)",
    "1 or 2 pods hot pepper (optional)"
  ],
  "__v": 1
}