{
  "hash": "cd47f2bd9207e40fea721433b6610626197bf32a",
  "title": "Cast-Iron Cowboy Steak",
  "image": "http://cdn-image.myrecipes.com/sites/all/themes/myrecipes/images/legacy/img_noPhoto150.gif",
  "href": "http://www.myrecipes.com/recipe/cast-iron-cowboy-steak",
  "firstAdded": "2015-01-23T22:45:43.497000",
  "users": [
    null
  ],
  "keywords": [
    "kosher",
    "salt",
    "black",
    "pepper",
    "bonein",
    "ribeye",
    "porterhouse",
    "steak",
    "oil",
    "click",
    "savings",
    "butter",
    "herb",
    "sprigs",
    "thyme",
    "rosemary",
    "oregano",
    "garlic",
    "smashed",
    "savingsclick"
  ],
  "directions": [
    "0",
    "Preheat grill to 400째 to 450째 (high) heat. Heat a 12-inch cast-iron skillet on grill, covered with grill lid, 15 minutes. Sprinkle salt and pepper generously over steak.",
    "Add oil to skillet. (Oil should smoke.) Using tongs, place steak in skillet, and cook on grill, without grill lid, 10 minutes or until dark brown and crusty. Turn steak on fatty edge in skillet, holding upright with tongs, and cook 2 minutes. Place steak, uncooked side down, in skillet. Cook on grill, covered with grill lid, 8 to 10 minutes or to desired degree of doneness. (We recommend an internal temperature of 120째 to 125째 for medium-rare; temperature will rise as steak rests.)",
    "Add butter, herbs, and garlic to side of skillet, and cook 2 to 3 minutes or until butter foams. Tilt skillet slightly, and spoon butter mixture over steak 20 times (being careful not to splatter). Transfer steak, herbs, and garlic to a platter; let stand for 5 to 10 minutes. Slice against the grain."
  ],
  "ingredients": [
    "0",
    "Kosher salt and freshly ground black pepper",
    "1 (1 1/2- to 2-lb.) bone-in rib-eye or porterhouse steak (about 2 inches thick)",
    "1 tablespoon vegetable oil $Click to see savings",
    "3 tablespoons butter $Click to see savings",
    "8 fresh herb sprigs (such as thyme, rosemary, and oregano)",
    "3 garlic cloves, peeled and smashed $Click to see savings$Click to see savings"
  ],
  "__v": 1
}