{
  "hash": "40a405591ca92ede4623c640dee3b53ce5e2e5ba",
  "title": "Spaghetti Squash Lasagna Casserole",
  "image": "https://cdn.ruled.me/wp-content/uploads/2018/01/spaghetti-squash-lasagna-casserole-second.jpg",
  "href": "https://www.ruled.me/spaghetti-squash-lasagna-casserole/",
  "extension": "Chrome",
  "firstAdded": "2018-04-15T16:58:59.182000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 400°F.",
    "Carefully split the spaghetti squash in half lengthwise and scoop out the seeds. Drizzle with 1 tablespoon of olive oil and sprinkle with salt and pepper.",
    "Roast for 35-45 minutes or until the squash is tender and easily shreds with the fork. Remove from the skin into a bowl and set aside. If there’s any visible liquid drain or pat dry.",
    "While the squash roasts, heat the remaining tablespoon of olive oil in a large skillet. Add the chopped onion, sausage, ground beef and garlic.",
    "Cook the meat thoroughly and drain any rendered fat.",
    "Add the marinara sauce to the meat mixture and bring to a boil. Reduce the heat and simmer the sauce for about 15 minutes or until thick and most of the liquid has been reduced.",
    "While the meat simmers combine the ricotta cheese, ½ cup Parmesan cheese, eggs, basil and ½ teaspoon salt and pepper in a medium sized bowl and set aside.",
    "Turn the oven down to 350°F and lightly grease a 2.5 quart casserole dish.",
    "Begin with spaghetti squash, adding half the shreds (about 2 cups) to the bottom of the dish and pressing into a flat layer.",
    "Top with half the ricotta mixture, followed by half the meat sauce, and a layer of half the mozzarella cheese.",
    "Repeat the layers again, starting over with another layer of squash.",
    "Sprinkle the casserole with the remaining 1/4 cup of Parmesan cheese and chopped parsley.",
    "Cover with foil and bake for 30 minutes. Remove the foil and bake another 20 - 30 minutes or until bubbly and golden brown. Let rest for at least 15 minutes before serving."
  ],
  "ingredients": [
    "0",
    "1 whole spaghetti squash",
    "2 tablespoons olive oil, divided",
    "½ medium onion, diced",
    "1 pound breakfast sausage",
    "1 pound 80/20 ground beef",
    "1 tablespoon minced garlic",
    "24 ounces Rao’s marinara sauce",
    "20 ounces whole milk ricotta",
    "2 large eggs",
    "¾ cup grated Parmesan cheese, divided",
    "2 tablespoons chopped basil",
    "½ teaspoon salt",
    "½ teaspoon pepper",
    "8 ounces sliced mozzarella cheese",
    "2 tablespoons chopped parsley"
  ],
  "__v": 1
}