{
  "hash": "16bb2c0c52a469774acd209c878736cfd12ee643",
  "title": "Brown Butter Cinnamon Rolls",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2014/06/Brown-Butter-Cinnamon-Rolls-1.jpg",
  "href": "http://www.gimmesomeoven.com/brown-butter-cinnamon-rolls-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-08-29T00:14:03.724000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Before you begin making the dough and filling, prepare your brown butter.",
    "To make brown butter in the microwave, place butter in a large microwaveable bowl and heat for 3-5 minutes, or until the butter has come to a boil and then turns an amber color. Be careful that the butter does not burn.",
    "To make brown butter on the stove, place butter in a large saucepan and heat over medium-high heat until boiling. Let the butter boil for 2-4 minutes, or until it turns an amber color. Be careful that the butter does not burn.",
    "Pour the milk into a microwave-safe bowl. Heat on high in the microwave for 30 seconds, then remove and stir in the melted brown butter, and test the temperature with your finger. You want the mixture to be lukewarm, but not hot to the touch. If it is too cool, continue heating the mixture in the microwave for 20 second intervals, pausing after each to stir, until the mixture reaches the correct temperature. If the mixture gets too hot, let it sit out for a few minutes until it has cooled to the lukewarm temperature.",
    "In a separate bowl, whisk together 3 cups flour (not all of the flour), sugar and salt until combined.",
    "In the bowl of a stand mixer (**see note below for an alternative method of making this by hand*) fitted with the dough hook attachment, add yeast and lukewarm milk mixture and stir by hand to combine. Add the flour mixture and egg, and beat on medium-low speed until combined. If the dough is sticking to the sides of the bowl, add the remaining flour, 1/4 cup at a time, until the dough begins to form a ball and pulls away from the sides of the bowl. Continue beating for 5 minutes on medium-low speed. Remove the dough hook and cover the bowl with a damp towel and let rest for 10 minutes.",
    "Meanwhile, make your filling by whisking together sugars and cinnamon in a bowl until evenly combined.",
    "When the dough is ready, turn it out onto a floured work surface. Then use a floured rolling pin to roll the dough out into a large rectangle, about 14 x 10 inches in size. (If you want all edges to be even, you can use a pizza slicer to cut the dough into a perfect rectangle.) Use a knife or pastry spatula to spread the melted brown butter evenly over the entire surface of the dough. Then sprinkle the cinnamon and sugar mixture evenly on top of the melted butter so that the entire surface of the dough is covered.",
    "Beginning at the 14-inch edge, tightly roll up the dough. And then give the final seam a little pinch so that it seals. Use a piece of dental floss*** to \"cut\" off the two ends of the roll (an inch on each end) so that they are even, then discard the dough that was cut away. Use the floss to cut the remaining dough into 12 equal pieces.",
    "(***To cut dough with dental floss, simply break off a piece of floss about 12 inches long. Then very carefully slide the middle of the floss under the dough to the place where you want to \"cut\". Then pull the ends of the floss up and cross over the top of the dough, and give a quick tug to literally cut all the way through the dough. This is the best method for not squishing your dough while cutting it -- although the standard knife method still works too.)",
    "Place each of the cut cinnamon rolls into a greased pie plate or 9 x 13-inch baking dish. Then cover again with a damp towel, and leave the dish in a warm place to rise for 25 minutes.",
    "While the dough is rising, make the icing (instructions below).",
    "When the rolls have risen, uncover the dish. Then place on the center rack of the oven and bake at 350 degrees F for 15-20 minutes, or until the rolls are golden and cooked through. Remove and let cool on a wire rack for at least 5 minutes. Drizzle with frosting and serve.",
    "Either in the bowl of an electric stand mixer, or a mixing bowl, whisk the melted brown butter and cream cheese together until combined. Add in powdered sugar and whisk until combined. If the icing is too thick, add a tablespoon or two of milk to thin it out."
  ],
  "ingredients": [
    "0",
    "1 cup milk (I used 2%)",
    "1/4 cup (melted) brown butter (*see instructions for brown butter below)",
    "3 1/2 cups all-purpose flour, divided",
    "1/4 cup granulated sugar",
    "1/2 tsp. salt",
    "1 envelope instant or ‘rapid rise’ yeast (approx. 2 1/4 tsp)",
    "1 egg",
    "1",
    "1/3 cup granulated sugar",
    "1/3 cup packed brown sugar",
    "2 Tbsp. ground cinnamon",
    "1/3 cup (melted) brown butter",
    "2",
    "2 Tbsp. (melted) brown butter",
    "4 ounces cream cheese, softened",
    "1/2 cups powdered sugar",
    "1-2 Tbsp. milk (if needed)"
  ],
  "__v": 1
}