{
  "hash": "0aa8ae117b40552b7f84f845205a45d0e264268a",
  "title": "Sweet Potato Crepes Stuffed with Smoky Millet.",
  "image": "http://www.veganricha.com/wp-content/uploads/2013/02/crepes-728.jpg",
  "href": "http://www.veganricha.com/2013/02/smoky-millet-stuffed-sweet-potato-rice.html",
  "extension": "",
  "firstAdded": "2015-11-25T12:10:18.207000",
  "users": [
    null
  ],
  "keywords": [
    "stuffing",
    "millet",
    "water",
    "oil",
    "red",
    "onion",
    "bell",
    "pepper",
    "carrots",
    "salt",
    "cumin",
    "paprika",
    "garlic",
    "smoke",
    "parsley",
    "black",
    "chili",
    "soy",
    "coconut",
    "aminosoptional",
    "crepes",
    "regular",
    "size",
    "yam",
    "potato",
    "boiled",
    "mashed",
    "dry",
    "rice",
    "used",
    "basmati",
    "lentilsi",
    "yellow",
    "peas",
    "split",
    "gram",
    "oat",
    "flour",
    "flaxmeal",
    "ginger",
    "garam",
    "masala",
    "spice",
    "blend",
    "later",
    "needed",
    "active",
    "yeast",
    "variations",
    "lemon",
    "juice",
    "vinegar",
    "tangy",
    "crepe",
    "chipotle",
    "peppers",
    "toppings",
    "tomatoes",
    "onions",
    "cilantro",
    "pico",
    "gallo",
    "jalapeno",
    "use",
    "plain",
    "aioli",
    "spicy"
  ],
  "directions": [
    "0",
    "Method:",
    "Crepes:",
    "Soak the uncooked rice and split peas/lentils for 30 minutes in hot water.",
    "Drain the water, and add rice and lentils to blender.",
    "Add all the other ingredients and 1 cup water and blend. (I used setting 5 on blendtec)",
    "Add more water if needed to get a smooth thin batter.",
    "Blend 2-3 full cycles so the rice and lentils break down well.",
    "Add yeast to the batter. Mix well and let sit for 30 minutes(to an hour. Can be refrigerated for a day. Best results with rice soaked for an hour and then fermented for an hour.)",
    "Mix well, add more water if needed and proceed to make crepes.",
    "(You can use other flours or rice flour instead of oat flour. Add more flour if the batter gets too thin. cooking times may differ by a minute here and there depending on the flours and water content.)",
    "Heat a non stick pan on medium high heat.",
    "Once hot, Drizzle oil and spread using a damp paper napkin.",
    "Pour a ladle full of the batter and spread any way you like. I usually use indian dosa style Light handed circular motion to spread. The batter should be thin enough to spread on its own by moving the pan too.",
    "Cook for 2-4 minutes until the bottom is golden and easily comes off.",
    "Loosen the entire crepe from the pan before flipping.",
    "Flip and cook for another 2-3 minutes.",
    "Notes:",
    "Make a small first crepe. Taste once done and adjust salt and spice in the batter.",
    "For a Sweet potato Dosa or Uttapam, Soak 1/4 cup split black gram/urad dal and a Tablespoon of fenugreek/methi seeds with the rice. The batter makes soft crepes, thin or fat, because of the sweet potato. See the Dosa post for more tips. Use a good thick bottom pan and spread the crepes thin. I promise it gets easy once you find the pan and temperature that works. You can also use a seasoned cat iron pan like here.",
    "You can make the crepes and store ahead of time, refrigerated, for a day or so."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "Stuffing:",
    "1/2 cup millet",
    "1 1/4 cup water",
    "2 teaspoons oil",
    "1/3 cup chopped red onion",
    "1/4 cup chopped each red bell pepper, bell pepper, carrots",
    "1/2 teaspoon salt or to taste",
    "1/4 teaspoon cumin powder",
    "1/2 teaspoon paprika",
    "1/4 teaspoon garlic powder",
    "1/2-1 teaspoon liquid smoke",
    "1/2 teaspoon dried or fresh parsley",
    "black pepper or red chili powder to taste",
    "1 teaspoon soy sauce or coconut aminos(optional)",
    "Crepes:",
    "1/2 regular size yam or sweet potato, boiled and mashed",
    "1/2 cup dry Rice (I used Basmati)",
    "1/4 cup dry Split peas or other lentils(I used yellow split peas and a little split black gram)",
    "1/4 cup Oat flour or 2 Tbsp rice flour",
    "1 Tablespoon flaxmeal",
    "2 cloves of garlic",
    "1/2 inch ginger",
    "1/2 teaspoon garam masala or other spice blend of choice",
    "chili powder or black pepper to taste",
    "3/4 teaspoon salt (add more later if needed)",
    "1-2 cups water",
    "1 teaspoon active yeast",
    "Variations: Add lemon juice of vinegar for a tangy crepe.",
    "Add some chipotle peppers or sauce.",
    "Toppings:",
    "Chopped tomatoes, red onions and cilantro Or Pico de gallo",
    "Jalapeno Aioli – Use plain or cilantro aioli for less spicy version."
  ],
  "__v": 1
}