{
  "hash": "c0523a49672deb44168caa62cfe90d99b6bc3619",
  "title": "FRIED AUBERGINE / EGGPLANT",
  "image": "https://cdn77-s3.lazycatkitchen.com/wp-content/uploads/2017/05/sabih-spiced-chickpeas-hand-800x1200.jpg",
  "href": "https://www.lazycatkitchen.com/sabih-spiced-chickpeas/",
  "extension": "Chrome",
  "firstAdded": "2017-07-25T19:28:22.500000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "METHOD",
    "FRIED AUBERGINE / EGGPLANT",
    "Cut aubergines into 2.5 cm / 1″ slices. Sprinkle with salt on both sides and set aside for 30 minutes for any excess moisture and bitterness to go.",
    "After 30 minutes, wipe the salt off with a piece of kitchen towel. Blot the slices on the kitchen towel until completely dry.",
    "Heat up a medium non-stick pan with 1 tbsp of oil. Meanwhile, sprinkle the first batch of sliced aubergine with a thin layer of cornstarch – this is optional and not a traditional thing to do, but it minimises the amount of oil the aubergine soaks up during frying and gives it a nice, delicately, crispy texture on the outside. Repeat with the remaining aubergine slices as the first batch finishes frying (sprinkling cornstarch in advance makes aubergine get slippery so wait till just before you are ready to place it on a hot pan).",
    "Once the oil gets medium-hot, place the aubergine slices on the pan and fry them gently until they are browned (about 3-4 min), then flip them to the other side and continue in the same manner. Once you are done with the first batch, continue with the remaining batches adding oil as needed.",
    "SPICY CHICKPEAS",
    "Make sure your chickpeas are completely cooled (if you cooked them yourself from scratch) and drained.",
    "Mix all the spices together with a few pinches of salt in a small bowl.",
    "Heat up a heavy-bottomed pan on a medium-high heat. Pour olive oil on the hot pan and wait a few seconds for the oil to heat up.",
    "Chuck the drained chickpeas into the hot oil and roast the chickpeas for a few minutes, until lightly browned here and there. Make sure you stir them often.",
    "Stir the spice mix in and coat the chickpeas in it. Take the pan off the heat and allow the spices to finish off roasting in the residual heat (ground spices can burn really easily and become bitter). Check the seasoning and set aside.",
    "TAHINI SAUCE",
    "Place the tahini in a small bowl. Add enough water to achieve a creamy and almost pourable consistency sauce – the amount of water depends on the type of your tahini. Mix the two together vigorously.",
    "Season with garlic, maple syrup, salt, pepper and lemon juice (adjust acidity to your palate). Set aside.",
    "ZHOUG",
    "Place coriander, parsley and deseeded chilli in a food processor along with a clove of garlic and all of the spices.",
    "Process, drizzling in some olive oil (I used about 4 tbsp), water and lemon juice (if you like). Take care not to overprocess as this sauce is meant to be a bit on the chunky side (it’s traditionally made by hand).",
    "Season with salt, pepper and a pinch of sugar.",
    "ISRAELI SALAD",
    "Core tomatoes, discard the seeds and chop the fleshy part into a small dice.",
    "Place diced tomatoes and cucumber into a small bowl, mix in sliced spring onions and chopped parsley. Dress with a squeeze of lemon and a tablespoon of olive oil. Season with salt and pepper to taste.",
    "ASSEMBLY",
    "Top warmed-up pitas with hummus (if using), fried aubergine, spicy chickpeas, Israeli salad and condiments (tahini sauce, zhoug and mango pickle)"
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "FRIED AUBERGINE / EGGPLANT",
    "olive oil",
    "2 small aubergines / eggplants",
    "2 tsp fine salt",
    "3 tsp cornstarch / cornflour (optional)",
    "SPICY CHICKPEAS",
    "2 cups cooked chickpeas, drained well",
    "2 tbsp olive oil",
    "1 tsp cumin",
    "1 tsp smoked paprika",
    "½ tsp chilli powder, adjust to taste",
    "fine sea salt, to taste",
    "ZHOUG (spicy herb condiment)",
    "35 g / 1 cup packed fresh coriander leaves",
    "20 g / ½ cup packed fresh parsley leaves",
    "1-2 hot green chillies",
    "½ tsp ground cumin",
    "¼ tsp ground cardamom",
    "¼ tsp ground cloves",
    "a pinch of sugar",
    "½ tsp salt",
    "black pepper, to taste",
    "4 tbsp extra virgin olive oil",
    "2 tbsp lemon juice",
    "2 tbsp water",
    "TAHINI SAUCE",
    "60 ml / 4 tbsp tahini",
    "2 tbsp lemon juice",
    "½ large garlic clove, grated",
    "1 tsp maple syrup",
    "salt & pepper, to taste",
    "ISRAELI SALAD",
    "1 Lebanese cucumber",
    "2 ripe tomatoes",
    "1 medium spring onion, sliced",
    "a few stalks of parsley, chopped finely",
    "1 tbsp extra virgin olive oil",
    "lemon juice, to taste",
    "REMAINING INGREDIENTS",
    "savoury mango pickle (also known as amba)",
    "4 round pitas (GF if necessary)",
    "classic hummus (recipe here), optional"
  ],
  "__v": 1
}