{
  "hash": "3ed580f2b73af3b357cee6e6a160b2a5aaf5b3ae",
  "title": "Banana Bread Recipe\nPrep: 15 minutes\nCook: 45-50 minutes\nCool: 5 to 10 minutes",
  "image": "https://magnolia.com/wp-content/uploads/2016/08/Blog_Banana_Bread-5-of-18-1024x684.jpg?x95606",
  "href": "https://magnolia.com/fresh-banana-bread/",
  "extension": "Chrome",
  "firstAdded": "2020-04-11T02:06:21.926000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 350 degrees F. Spray an 8 x 8-inch pan with nonstick baking spray or line it with parchment paper.",
    "In a stand mixer fitted with the paddle attachment (or in a large bowl with a handheld electric mixer), beat together the butter, brown sugar, eggs, and vanilla until well blended. Add the bananas and mix until combined.",
    "In a medium bowl, whisk together the flour, baking soda, and salt. Add the dry ingredients to the wet ingredients and beat just until combined. Add the pecans (if using) and mix until combined.",
    "Pour the batter into the prepared pan and spread it evenly. Sprinkle the sugar over the top. I like to cover the whole surface completely with sugar; use as much as you’d like.",
    "Bake until a tester inserted in the center comes out clean, 45 to 50 minutes. Let the bread cool slightly in the pan on a rack. Slice and serve warm with butter.",
    "When completely cooled, cover the pan with foil and store at room temperature for up to 2 days."
  ],
  "ingredients": [
    "0",
    "Nonstick baking spray, for the pan",
    "+ 8 tablespoons (1 stick) salted butter, melted and cooled, plus softened butter for serving",
    "+ 1 cup packed light brown sugar",
    "+ 2 large eggs, beaten",
    "+ 1 ½ teaspoons pure vanilla extract",
    "+ 4 to 5 very ripe bananas, mashed (I like to leave them a little chunky)",
    "+ 1 ¾ cups all-purpose flour",
    "+ 1 teaspoon baking soda",
    "+ ½ teaspoon kosher salt",
    "+ ½ cup chopped pecans (optional; see Tip)",
    "+ 1 to 2 tablespoons granulated sugar as needed"
  ],
  "__v": 1
}