{
  "hash": "137d8332fa5fcd371aa6edfd8bc82f067660958e",
  "title": "Fragrant Chargrilled Chicken with Aromatic Thai Rice",
  "image": "http://recipe-folder.com/img/recipe-images/054/593/2014672154.jpg",
  "href": "http://www.ainsley-harriott.com/recipes/view/28/Fragrant-Chargrilled-Chicken-with-Aromatic-Thai-Rice",
  "extension": "Chrome",
  "firstAdded": "2015-12-14T14:40:25.461000",
  "users": [
    null
  ],
  "keywords": [
    "sachet",
    "ainsley",
    "harriott",
    "aromatic",
    "thai",
    "rice",
    "red",
    "curry",
    "jar",
    "carton",
    "coconut",
    "cream",
    "chicken",
    "breast",
    "fillets",
    "skin",
    "sunflower",
    "oil",
    "brushing",
    "stock",
    "roughly",
    "coriander",
    "salt",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "STEP 1",
    "For extra flavour it is recommended to marinade the meat for a minimum of 15 minutes or ideally if time allows 24 hours.",
    "STEP 2",
    "Mix together the Thai red curry paste and coconut cream in a shallow, non-metallic dish. Season to taste.",
    "STEP 3",
    "Pierce each chicken breast three or four times and add to the dish, turning to coat. Cover with cling film and set aside at room temperature for 15 minutes or up to 24 hours in the fridge.",
    "STEP 4",
    "Heat a griddle pan until smoking hot. Drain the chicken breasts from the marinade and reserve for later. Brush the griddle pan with oil and then add the chicken skin-side down. Chargrill for 6-8 minutes on each side, reducing the heat if necessary. Leave to rest for a couple of minutes.",
    "STEP 5",
    "While the chicken is cooking make the Ainsley Harriott Aromatic Thai Rice according to the directions on the sachet.",
    "STEP 6",
    "Place the remaining marinade in a small pan with the stock and bring to the boil, then reduce the heat and simmer for about 5 minutes until it has reduced to a saucy consistency, stirring occasionally. Season to taste.",
    "STEP 7",
    "To serve: Carve the chicken breast on the diagonal and arrange on plates with the rice. Drizzle around the sauce and garnish with the coriander. Eat immediately.",
    "STEP 8",
    "Other Ideas: Substitute the chicken breasts for salmon fillets and chargrill them skin-side down for 3 minutes then turn over and cook for another minute until just tender."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1 x 120g sachet of Ainsley Harriott Aromatic Thai Rice",
    "30ml (2 tbsp) Thai red curry paste (from a jar)",
    "200ml (7fl oz) carton coconut cream",
    "2 x 100g (4oz) chicken breast fillets (skin on)",
    "sunflower oil, for brushing",
    "150ml (5fl oz) chicken stock",
    "30ml (2 tbsp) roughly chopped fresh coriander",
    "salt and freshly ground black pepper"
  ],
  "__v": 1
}