{
  "hash": "84800e9bc636a7dee1e309b06358a44baeb715d3",
  "title": "Blueberry Thyme Skillet Pie",
  "image": "https://cmt.azureedge.net/media/blueberry_thyme_skillet_pie_20180709200359405455u4a4u.jpg",
  "href": "https://www.copymethat.com/r/EwmYVxZ/blueberry-thyme-skillet-pie/",
  "extension": "",
  "firstAdded": "2018-12-27T18:07:53.037000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "FOR THE CRUST:",
    "I make my pie crust in a food processor. If you don’t have one, follow the alternative instructions.",
    "In a Food Processor: Pulse the flour and salt until blended. Add the butter and pulse 5 to 8 times. While pulsing, slowly add the ice water until the mixture forms a solid ball. Carefully remove from the food processor and knead the dough for approximately 1 minute. Divide the dough into two parts and pat them into discs. Wrap in a towel and refrigerate for at least and 45 minutes. Make the filling.",
    "FOR THE FILLING:",
    "In a medium sauce pan, add the blueberries, lemon juice, zest, thyme, sugar, and water and stir to combine. Bring the mixture to a boil on medium-high heat. When the liquid is boiling, reduce the heat to a low boil and stir frequently until the liquid begins to evaporate, approximately 20 minutes. Remove 1 cup of the filling with a measuring cup and add the starch to the cup. Whisk until the starch completely dissolves. You shouldn’t see any lumps. Add the mixture back to the pan and stir well. Cook for another 15 minutes and remove from heat. Let cool then refrigerate for at least an hour.",
    "Preheat oven to 350°F (177°C)",
    "TO CONSTRUCT THE PIE:",
    "Once the dough and filling has chilled and set, remove from the refrigerator and begin constructing the pies.",
    "Divide one of the halves of dough by two and roll it out on a floured surface, approximately 1/8 of an inch (3 mm) thick and place in the bottom of a skillet. Press it into the pan so it hugs the bottom and edges, then trim any overlapping crust around the edges, leaving enough of a border to pinch the top crust together. Repeat with the other half and put it in the other skillet.",
    "Fill the pans with the blueberry filliing.",
    "Divide one of the halves of dough by two and roll it out on a floured surface, approximately 1/8 of an inch (3 mm) thick and place it on top of one of the pies. Trim the excess dough and then pinch the bottom and top crusts together. Press a fork around the edges of the pie and cut slits on the top of the crust with a sharp knife so steam can escape while baking. Brush the pie with 1 tbsp (15 ml) olive oil and sprinkle with a bit of sugar. Repeat with the second pie.",
    "Place the pies on a baking sheet to capture any spillage. This will save your oven from a big mess! Bake for approximately 1 hour, or until the pie crust is golden brown. Let the pies cool for at least fifteen minutes before cutting."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "FOR THE CRUST:",
    "2 cups (264 g) stone ground flour (you can also use all purpose)",
    "2 tsp (10 g) ground sea salt",
    "16 tbsp (233g) very chilled vegan butter (I use Miyoko’s or Earth Balance), cut into cubes",
    "¼ cup (60 ml) to ½ cup (120 ml) ice water",
    "FOR THE FILLING:",
    "5 cups (500 g) fresh blueberries",
    "¼ cup (60 ml) lemon juice",
    "1 tbsp (15 g) lemon zest",
    "1 tbsp (15 g) fresh thyme, chopped",
    "¼ cup (48 g) granulate sugar (make sure it’s made without bone char)",
    "¼ cup (60 ml) water",
    "2 tbsp (30 g) of potato starch or corn starch",
    "2 tbsp (30 ml) extra-virgin olive oil (optional)",
    "Sugar for decorating the crust (optional)"
  ],
  "__v": 1
}