{
  "hash": "a39532fe0e1a67953a69bfdab868066f85bbaf8f",
  "title": "CORNBREAD STUFFING",
  "image": "",
  "href": "http://www.cooks.com/rec/story/215/",
  "extension": "Chrome",
  "firstAdded": "2016-07-17T22:31:22.804000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 450°F.",
    "In a mixing bowl, combine the dry ingredients.",
    "Beat eggs using a whisk or a fork. Pour in the buttermilk while beating for 1 minute.",
    "Gradually add egg mixture to the dry ingredients, Stirring just enough to combine.",
    "Melt butter in a warmed 10-inch cast-iron skillet and swirl to allow butter to coat all sides. Place empty pan in oven to heat for 5 minutes, then add cornbread batter to hot pan, spreading evenly.",
    "Bake until a toothpick inserted in center of cornbread comes out clean and top is golden brown (about 20 minutes).",
    "Remove pan from oven and run a blunt knife around edges. Remove cornbread from pan and let cool on wire rack. Break up cornbread into good sized chunks for stuffing and leave on countertop for 1 hour to crisp up. The cornbread can be baked the day before.",
    "1",
    "Transfer stuffing to a foil-lined greased baking dish or loaf pan (makes about 2 loaves) or use to fill a 20 lb turkey. If stuffing turkey, stuff just before putting the turkey in the oven and wait for stuffing to cool in refrigerator for 1 hour before using. Fill turkey about 3/4 full with the stuffing. About 3/4 pound of stuffing per pound of turkey will be sufficient. A stuffed bird will take slightly longer to roast (see the roasting chart on Cooks.com)."
  ],
  "ingredients": [
    "0",
    "4 cups cornmeal",
    "1 tsp. salt",
    "4 tsp. baking powder",
    "1 tsp. baking soda",
    "1 quart buttermilk",
    "6 eggs, beaten",
    "8 tbsp. butter (1 stick)",
    "1/2 lb. pancetta, cubed or 4-5 strips bacon",
    "2 cups chopped onions",
    "2 cups chopped celery",
    "3 shallots, minced",
    "4 cloves garlic, minced",
    "1 lb. mushrooms, sliced",
    "giblets, chopped (optional)",
    "5 eggs, beaten",
    "1 cup chicken stock (more or less as needed)",
    "8 tbsp. butter",
    "2 tsp. thyme",
    "1/4 cup fresh Italian parsley",
    "2 tsp. rubbed sage or Bell's Seasoning",
    "2-3 cups pecans or walnuts (optional)",
    "2 cups dried cranberries (optional)"
  ],
  "__v": 1
}