{
  "hash": "9872a9d7703fc715783f86628011996cd9d6e596",
  "title": "Chicken Chorizo Chili",
  "image": "",
  "href": "https://www.bonappetit.com/recipe/chicken-chorizo-chili",
  "extension": "Firefox",
  "firstAdded": "2020-01-02T09:50:06.990000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat 2 Tbsp. oil in a large heavy pot over high. Cook chorizo, stirring occasionally and breaking up with spoon, until lightly browned, about 4 minutes. Transfer to a plate.",
    "Reduce heat to medium-high and add remaining 1 Tbsp. oil to pot, then onion and garlic; season with salt and pepper. Cook, stirring often, until onion is soft, about 5 minutes. Add lager and bring to a boil, scraping up any browned bits on bottom of pot; cook until liquid is completely evaporated, about 5 minutes. Add chili powder, oregano, and cinnamon and cook, stirring, until fragrant, about 1 minute. Stir in bay leaves, diced tomatoes, broth, and tomato purée and bring to a boil. Reduce heat to medium-low and continue to cook, stirring occasionally, until liquid is reduced slightly and beginning to thicken, 30–35 minutes. Return chorizo to pot, cover, and cook 10 minutes. Add beans, cover, and cook 10 minutes longer.",
    "Serve chili in bowls topped with cheddar, avocado, cilantro, and sour cream.",
    "Do Ahead: Chili (without toppings) can be made 4 days ahead. Let cool; cover and chill. Reheat gently over low, adding a splash of stock or water to loosen if needed."
  ],
  "ingredients": [
    "0",
    "3 tablespoons olive oil, divided",
    "1½ pounds chicken or turkey chorizo, casings removed",
    "1 large onion, chopped",
    "2 garlic cloves, finely grated",
    "Kosher salt, freshly ground pepper",
    "1 cup lager or water",
    "⅓ cup chili powder",
    "1 tablespoon crushed dried oregano",
    "¼ teaspoon ground cinnamon",
    "2 bay leaves",
    "1 28-ounce can diced tomatoes",
    "2 cups low-sodium chicken broth",
    "1 cup tomato purée",
    "1 15-ounce can cannellini (white kidney) beans, rinsed",
    "Grated cheddar, diced avocado, chopped cilantro, and sour cream (for serving)"
  ],
  "__v": 1
}