{
  "hash": "3a69a51f1c68a04a0ef3968d9a56f69eede133bc",
  "title": "Easy Duck Confit",
  "image": "",
  "href": "http://cooking.nytimes.com/recipes/1013002-easy-duck-confit?em_pos=medium&emc=edit_ck_20160103&nl=cooking&nlid=67052010",
  "extension": "Firefox",
  "firstAdded": "2016-01-03T18:31:02.652000",
  "users": [
    null
  ],
  "keywords": [
    "kosher",
    "salt",
    "black",
    "pepper",
    "thyme",
    "bay",
    "leaf",
    "crumbled",
    "moulard",
    "duck",
    "legs",
    "total",
    "rinsed",
    "patted",
    "dry",
    "trimmed",
    "roasted",
    "potatoes",
    "noodles",
    "sturdy",
    "bitter",
    "salad",
    "greens",
    "arugula",
    "chicory",
    "andor",
    "radicchio"
  ],
  "directions": [
    "0",
    "Preparation",
    "In a small bowl, combine salt, pepper, thyme and bay leaf pieces. Sprinkle duck generously with mixture. Place duck legs in a pan in one layer. Cover tightly with plastic wrap and refrigerate for 24 hours.",
    "The next day, heat oven to 325 degrees.Place duck legs, fat side down, in a large ovenproof skillet, with legs fitting snugly in a single layer (you may have to use two skillets or cook them in batches). Heat duck legs over medium-high heat until fat starts to render. When there is about 1/4 inch of rendered fat in pan, about 20 minutes, flip duck legs, cover pan with foil, and place it in oven. If you have used two pans, transfer duck and fat to a roasting pan, cover with foil and place in oven.",
    "Roast legs for 2 hours, then remove foil and continue roasting until duck is golden brown, about 1 hour more. Remove duck from fat; reserve fat for other uses.",
    "Serve duck hot or warm, over roasted potatoes or noodles or sturdy salad greens."
  ],
  "ingredients": [
    "0",
    "1 ½teaspoons kosher salt",
    "1teaspoon freshly ground black pepper",
    "½teaspoon dried thyme",
    "1bay leaf, crumbled",
    "8moulard duck legs (about 4 pounds total), rinsed and patted dry but not trimmed",
    "Roasted potatoes, noodles or sturdy for serving",
    "Bitter salad greens such as arugula, chicory and/or radicchio, for serving"
  ],
  "__v": 1
}