{
  "hash": "ed6ad2d4141b7cbbd3ab1a6c6ee394285662cb03",
  "title": "Balsamic Roasted Brussels Sprouts with Polenta",
  "image": "https://32lxcujgg9-flywheel.netdna-ssl.com/wp-content/uploads/2015/02/Brussels-Sprout-and-Meyer-Lemon-Pizza-200x200.jpg",
  "href": "https://naturallyella.com/balsamic-roasted-brussels-sprouts-with-polenta/",
  "extension": "Chrome",
  "firstAdded": "2017-09-18T20:43:28.270000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Bring the vegetable broth and water to a boil in a medium pot. Add in the polenta, whisking quite a bit, until the mixture begins to thicken. Reduce the heat to a simmer, cover, and let cook for 25 to 30 minutes, stirring every once in awhile (full technique can be found here- it's the only way I make polenta). Once done, stir in butter and salt/pepper as desired.",
    "Preheat oven to 400˚. Trim the ends from the Brussels sprouts and cut each brussels sprout in half, keeping any leaves that fall off. Toss the brussels sprouts, loose leaves, and onions with olive oil, salt and pepper. Spread out into a single layer on a roasting pan and bake for 15 to 20 minutes, stirring once halfway through. Brussels sprouts should be browning.",
    "While the brussels sprouts are roasting, place the balsamic vinegar in a small sauce pan. Bring to a boil, reduce heat to medium-low, and let cook until mixture has reduced down to 1/4 cup and has thickened slightly, 8 to 10 minutes.",
    "Once Brussels sprouts are finished, toss with 1 to 2 tablespoons of the balsamic mixture and walnut pieces.",
    "Divide polenta into two bowls and top with Brussels sprout mixture."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1 cup water",
    "1 cup low-sodium vegetable broth",
    "1/2 cup medium-grind polenta",
    "1 tablespoon butter",
    "salt and pepper, to taste",
    "1/2 pound Brussels sprouts",
    "1/4 medium red onion, thinly sliced",
    "2 teaspoons olive Oil",
    "Pinch of salt",
    "Pinch of black pepper",
    "1/2 cup balsamic vinegar",
    "2 tablespoons chopped toasted walnut pieces"
  ],
  "__v": 1
}