{
  "hash": "22a13b2bd7d62e8d8a51f250f6bc01f0a3f9c2d2",
  "title": "Papas Rellenas Colombianas (Patatas)",
  "image": "http://3.bp.blogspot.com/-jI3kKAu_LQk/VPBGa92lDLI/AAAAAAAAEd8/kstLHbetMvg/s1600/pricipal%2Bpatata_baja.jpg",
  "href": "http://cocinaconclau1.blogspot.com.es/2015/03/papas-patatas-rellenas-colombianas.html",
  "extension": "Chrome",
  "firstAdded": "2015-04-15T10:54:52.900000",
  "users": [
    null
  ],
  "keywords": [
    "grs",
    "tomate",
    "carne",
    "picada",
    "cebolla",
    "ajo",
    "comino",
    "sal",
    "taza",
    "arroz",
    "cocido",
    "patatas",
    "cocidas"
  ],
  "directions": [
    "0",
    "Preparación del relleno.",
    "Cortamos en cuadritos la cebolla y el tomate. Lo ponemos a sofreír con el aceite y el sartén caliente. Cuando la cebolla este transparente, añadimos las especias y removemos. Incorporamos la carne picada removiendo de forma que no se apelmace. Tapamos y dejamos cocinar. Cuando la carne este apunto y haya soltado jugos añadimos la media taza de arroz cocido. Removemos y dejamos tapado por aproximadamente 5 minutos a fuego muy bajo.",
    "Retiramos del fuego y dejamos enfriar.",
    "La masa de patata o papa:",
    "Es importante que las patatas estén muy secas, que no tengan nada de líquido ni humedad. Machacamos de forma que hagamos un puré y luego amasamos con las manos para darle mayor suavidad.",
    "Preparación del plato.",
    "Te he preparado un vídeo para que puedas ver de forma visual como hacer las patatas rellenas, de todas maneras te lo explicare de la forma posible para que lo puedas entender.",
    "Ver vídeo Cómo Hacer las Patatas Rellenas",
    "Ponemos sobre una superficie un papel film. Extenderemos una bola de masa de patata sobre la superficie* y añadimos el guiso de carne que hemos preparado previamente y que debe estar frio. Con el papel film nos ayudamos para envolver el guiso con las patatas. Los acamos del papel film y le terminamos de dar forma de pelota. Lo pasamos por huevo y harina terminando de mejorar la forma redondeada. Lo ponemos a freir en abundante aceite caliente. Lo sacamos cuando este doradito y lo ponemos sobre papel absorbente. Super importante, porque es desagradable comer algo con exceso de aceite."
  ],
  "ingredients": [
    "0",
    "85 grs de tomate",
    "200 grs de carne picada",
    "60 grs de cebolla",
    "Ajo",
    "Comino",
    "Sal",
    "½ taza de arroz cocido",
    "1 kg Patatas cocidas"
  ],
  "__v": 1
}