{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 375°F. Coat four 10-ounce ramekins (or a 2- to 2 1/2-quart soufflé dish) with cooking spray and place them on a baking sheet.",
    "Place broccoli in a medium, microwave-safe bowl. Cover and microwave until the broccoli is tender-crisp, 1 to 2 minutes. Set aside.",
    "Melt butter and oil in a large saucepan over medium-high heat. Whisk in flour and cook, whisking, for 1 minute. Adjust heat as needed to prevent the mixture from getting too dark; it should be the color of caramel. Add milk, mustard, rosemary and salt and cook, whisking constantly, until thickened, 1 to 2 minutes. Remove from heat and immediately whisk in goat cheese and 3 egg yolks until well combined. Transfer to a large bowl.",
    "Beat the 5 egg whites in a medium bowl with an electric mixer on high speed until soft peaks form. Add cream of tartar and continue beating until stiff peaks form. Using a rubber spatula, gently fold half of the whipped whites into the milk mixture. Gently fold in the remaining egg whites and the reserved broccoli just until no white streaks remain. Transfer to the prepared ramekins or soufflé dish.",
    "Bake until puffed, firm to the touch and an instant-read thermometer inserted into the center registers 160°F, about 20 minutes in ramekins or 30 minutes in a soufflé dish. Serve immediately."
  ],
  "firstAdded": "2014-05-10T01:26:23.873000",
  "hash": "7d6161df6242dc2431822736cadac27b86ac81f7",
  "href": "http://www.eatingwell.com/recipes/broccoli_cheese_souffle.html",
  "image": "http://assets.eatingwell.com/sites/default/files/imagecache/standard/recipes/MV6517.JPG",
  "ingredients": [
    "0",
    "1 1/2 cups finely chopped broccoli florets",
    "1 tablespoon butter",
    "1 tablespoon extra-virgin olive oil",
    "2 tablespoons all-purpose flour",
    "1 1/4 cups low-fat milk",
    "1 teaspoon Dijon mustard",
    "1/4 teaspoon dried rosemary",
    "1/4 teaspoon salt",
    "1/2 cup crumbled goat cheese",
    "3 large eggs, separated",
    "2 large egg whites",
    "1/4 teaspoon cream of tartar"
  ],
  "keywords": [
    "broccoli",
    "florets",
    "butter",
    "extravirgin",
    "olive",
    "oil",
    "allpurpose",
    "flour",
    "lowfat",
    "milk",
    "dijon",
    "mustard",
    "rosemary",
    "salt",
    "crumbled",
    "goat",
    "cheese",
    "eggs",
    "separated",
    "egg",
    "whites",
    "cream",
    "tartar"
  ],
  "title": "Broccoli & Goat Cheese Souffle",
  "users": [
    null
  ]
}