{
  "hash": "84d990495b47d0b0517f7bb870904b723fb14c33",
  "title": "Zucchini Lasagna",
  "image": "//www.melskitchencafe.com/wp-content/uploads/2013/07/Zucchini-Lasagna3.jpg",
  "href": "http://www.melskitchencafe.com/zucchini-lasagna/",
  "extension": "Chrome",
  "firstAdded": "2015-05-01T21:14:08.506000",
  "users": [
    null
  ],
  "keywords": [
    "tomatoes",
    "basil",
    "oregano",
    "garlic",
    "onion",
    "sugar",
    "salt",
    "pepper",
    "cream",
    "cheese",
    "light",
    "regular",
    "softened",
    "room",
    "partskim",
    "ricotta",
    "cottage",
    "medium",
    "zucchini",
    "noboil",
    "lasagna",
    "noodles",
    "mozzarella"
  ],
  "directions": [
    "0",
    "Preheat the oven to 375 degrees F. Lightly grease a 9X13-inch baking dish and set aside.",
    "In a medium saucepan, combine all the sauce ingredients. Bring the mixture to a simmer and cook for about 10 minutes.",
    "While the sauce is cooking, proceed with prepping the rest of the ingredients. In a medium bowl, stir together the cream cheese, ricotta or cottage cheese, salt and pepper.",
    "Trim the knobby ends from each zucchini and cut in half lengthwise (see pictures below) and then slice each half very thinly. The pieces should look like thin, zucchini pasta sheets or noodles. In a medium bowl, toss the zucchini with the garlic and oregano and season with salt and pepper to taste (about 1/4 to 1/2 teaspoon of each).",
    "To assemble the lasagna, spread 1/2 cup sauce on the bottom of the pan. It will be a very thin, splotchy layer - that's ok. Spread out a single layer of zucchini so they aren't overlapping but cover most of the pan. A few empty spots are ok as long as it is mostly covered. Layer four no-boil lasagna noodles, slightly overlapping (I use the Barilla brand that calls for overlapping noodles; consult your particular lasagna noodle box to see if you should use 3 or 4 noodles for each layer - some brands say not to overlap; you basically want the noodles to cover the whole area of the baking pan).",
    "Dollop 1/3 of the ricotta mixture over the noodles and spread into a somewhat even layer. Spread 3/4 cup of the sauce over the top, one layer of zucchini and sprinkle with 1/3 of the mozzarella. You'll repeat this two more times (4 noodles, 1/3 of the ricotta mixture, 3/4 cup sauce, zucchini layer and mozzarella). On the final layer if you have more than 3/4 cup of sauce, that's fine, just use it all.",
    "Cover the lasagna with aluminum foil and bake for 30-35 minutes. Uncover and bake for another 10-15 minutes until golden and bubbly. Remove from the oven and let stand for 10-15 minutes before serving."
  ],
  "ingredients": [
    "0",
    "28 ounces crushed tomatoes",
    "1/2 teaspoon dried basil",
    "1/4 teaspoon dried oregano",
    "1/4 teaspoon garlic powder",
    "1/4 teaspoon onion powder",
    "1 teaspoon sugar",
    "1/2 teaspoon salt",
    "1/4 teaspoon pepper",
    "8 ounces cream cheese, light or regular, softened to room temperature",
    "3 cups part-skim ricotta or cottage cheese",
    "1/2 teaspoon salt",
    "1/4 teaspoon pepper",
    "4 small to medium zucchini",
    "2 garlic cloves, finely minced",
    "1 teaspoon dried oregano",
    "12 no-boil lasagna noodles",
    "8 ounces part-skim mozzarella cheese, shredded"
  ],
  "__v": 1
}