{
  "hash": "7c84685991a60ac2edc30ebc326c450dc6297b36",
  "title": "Red Lobster Shrimp Nachos",
  "image": "",
  "href": "http://www.copykat.com/2012/04/22/red-lobster-shrimp-nachos/",
  "extension": "Chrome",
  "firstAdded": "2015-03-29T03:24:00.976000",
  "users": [
    null
  ],
  "keywords": [
    "mild",
    "cheddar",
    "cheese",
    "monterey",
    "jack",
    "cream",
    "milk",
    "raw",
    "shrimp",
    "plum",
    "tomatoes",
    "red",
    "onions",
    "jalapeno",
    "pepper",
    "use",
    "nachos",
    "spicy",
    "cilantro",
    "slices",
    "sour",
    "nacho",
    "chips"
  ],
  "directions": [
    "0",
    "If you purchase frozen shrimp thaw shrimp completely before cooking. You can place them in a sieve and simply rinse cold water over them until they thaw. Drop the shrimp into a medium sized pot of boiling water. I personally like to add a little crab boil seasoning to the water to give the shrimp an additional layer of flavor. This is not necessary. Cook shrimp until they turn pink, and remove immediately, this will only take 2 to 4 minutes.",
    "Prepare cheese sauce by combining Monterey Jack cheese, Cheddar cheese, and cream cheese in a medium sized pot over a low to medium heat. Add milk to thin the sauce, you can add additional milk if you desire.",
    "Preheat the oven to 350 degrees, place nacho chips on a heat resistant plate. You will want to heat the chips until they are crisp. Heat chips for approximately 5 to 7 minutes. While the chips are heating prepare the pico de gallo by combining the tomatoes, chopped jalapeno pepper, onion, together.",
    "Assemble the nachos by spooning cheese sauce over the nachos. Then top with the pico de gallo you just made, top with shrimp. Garnish your nachos with sour cream, and slices of fresh jalapeno peppers."
  ],
  "ingredients": [
    "0",
    "1 cup of mild cheddar cheese",
    "1/4 cup Monterey Jack Cheese",
    "4 ounces cream cheese",
    "1/4 cup milk",
    "1/4 to 1/2 pound raw peeled and deveined shrimp",
    "2 plum tomatoes - diced",
    "1 tablespoon red onions - chopped fine",
    "1 teaspoon jalapeno pepper - use more if you like your nachos spicy",
    "2 teaspoons chopped cilantro",
    "2 or 3 slices of fresh jalapeno pepper",
    "2 tablespoons sour cream",
    "40 to 50 nacho chips"
  ],
  "__v": 1
}