{
  "hash": "6325d8cb838eb0cf5757d82485c81446ce4f2e81",
  "title": "Cherry-Strawberry Chia Seed Fool with Vanilla Bean Coconut Whipped Cream",
  "image": "http://cdn.ohsheglows.com/wp-content/uploads/2015/06/cherrystrawberrychiaseedfool-9659.jpg",
  "href": "http://ohsheglows.com/2015/06/30/cherry-strawberry-chia-seed-fool-with-vanilla-bean-coconut-whipped-cream/",
  "extension": "Chrome",
  "firstAdded": "2016-02-15T21:18:10.756000",
  "users": [
    null
  ],
  "keywords": [
    "coconut",
    "whipped",
    "cream",
    "fullfat",
    "milk",
    "chilled",
    "overnight",
    "natural",
    "cane",
    "sugar",
    "vanilla",
    "bean",
    "seeded",
    "cherry",
    "strawberry",
    "chia",
    "seed",
    "jam",
    "makes",
    "heaping",
    "frozen",
    "strawberries",
    "hulled",
    "using",
    "cherries",
    "maple",
    "syrup",
    "seeds",
    "salt",
    "lemon",
    "juice",
    "beet",
    "use",
    "microplane",
    "zester",
    "adds",
    "bolder",
    "red",
    "hue",
    "garnishes",
    "almonds",
    "zest"
  ],
  "directions": [
    "0",
    "Directions:",
    "Chill the cans of coconut milk in the fridge for 12-24 hours so the coconut cream can solidify before use.",
    "For the chia seed jam: Add the berries and maple syrup into a medium saucepan. Stir to combine. Increase heat to medium, and simmer until the berries release their juices and soften, about 10 minutes. After the berries release water you can increase the heat even more to cook off the water. Watch closely and stir frequently. When the berries look a bit soft, stir in the chia seeds. Keep cooking over medium heat until the chia thickens the mixture slightly, about 5-10 more minutes. Reduce heat if necessary to avoid burning. Remove from heat and stir in the salt, vanilla, lemon, and optional grated beet. Pour into a glass container and let it cool on the counter for at least 30 minutes before covering and chilling in the fridge for at least 2 hours, preferably longer.",
    "Chill a medium bowl in the freezer (this helps the coconut cream stay thick while whipping).",
    "Open the chilled cans of coconut milk and carefully scoop off the white coconut cream from each can and place it into a medium bowl. You should have 1.5-2 cups worth of cream. You can reserve the leftover coconut water for another use, such as a smoothie or you can freeze it into coconut water ice cubes (also great in smoothies).",
    "With electric mixers or a whisk, beat the cream and the cane sugar in the chilled bowl until smooth. Whisk in the vanilla.",
    "Layer the coconut cream and the chia jam in parfait glasses. Top with optional toasted sliced almonds, flaked coconut, lemon zest, and a cherry on top! Enjoy immediately or cover and transfer to the fridge until ready to serve. The chia seed jam will keep for up to a week in the fridge in an air-tight container, and I expect the coconut whipped cream will keep for at least 5 days.",
    "Tips:",
    "Tip: If for some reason your chia seed jam didn't thicken enough after chilling (this might be the case if the water wasn't cooked off enough), stir in another tablespoon of chia seeds and chill it for another hour. That should do the trick!"
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "For the Coconut Whipped Cream",
    "2 (15-oz) cans full-fat coconut milk, chilled overnight",
    "2 tablespoons natural cane sugar, or to taste",
    "1/4 teaspoon pure vanilla bean powder or 1 vanilla bean, seeded",
    "For the Cherry Strawberry Chia Seed Jam (makes 2 1/3 cups)",
    "2 heaping cups fresh or frozen strawberries (hulled if using fresh)",
    "3 cups fresh or frozen sweet cherries (pitted if using fresh)",
    "3-4 tablespoons pure maple syrup, to taste",
    "2 tablespoons chia seeds",
    "pinch fine sea salt",
    "1 teaspoon pure vanilla extract or 1/2 teaspoon pure vanilla bean powder",
    "1-2 teaspoons fresh lemon juice, to taste",
    "1 teaspoon peeled and finely grated red beet (I use a microplane lemon zester), adds bolder red hue",
    "Optional garnishes:",
    "Toasted sliced almonds",
    "Coconut Flakes",
    "Lemon Zest",
    "Fresh cherries"
  ],
  "__v": 1
}