{
  "hash": "938341a25abad3eddd414bde1709ad44ccbb9066",
  "title": "Bolognese A La Aida",
  "image": "https://data-members.beyonddiet.com/getimage.imhx?img=00_56_76_09_567609-286298.jpg&sw=1500&sh=1498&w=710&cust=4x3",
  "href": "https://members.beyonddiet.com/recipe/bolognese-a-la-aida",
  "extension": "Chrome",
  "firstAdded": "2018-10-25T16:22:47.382000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Place carrot, celery, and onion in a food processor and chop them as finely as possible. (No food processor? Just finely chop the veggies with a knife.)",
    "Heat coconut oil in a pan over medium heat. Add carrot, celery, and onion mixture to the pan and sweat the veggies for 5-8 minutes, until the whole mixture starts turning yellow from the carrot juices.",
    "Add smoked paprika, Italian herbs, onion powder, herbs, and oregano; stir to mix. Add ground beef and cook, stirring as needed, until browned. Mix in minced garlic and stir a few more times to combine.",
    "(If using a crockpot or slow cooker, now is the time to transfer it all to the slow cooker, add the remaining ingredients, and cook on high for about 2 hours.)",
    "Add the chopped tomatoes, tomato puree, mustard and tomato paste. Add the chicken stock (or sub vegetable broth). Cover and let it simmer for 10 to 20 minutes depending on how thick you like your sauce.",
    "Season with sea salt and pepper to taste. Serve over pasta, rice, quinoa, or vegetables. You can even top it with raw, organic cheese."
  ],
  "ingredients": [
    "0",
    "1 med. carrot",
    "1 stlk. celery",
    "1 med. onion",
    "1 tbs. coconut oil",
    "1 tsp. smoked paprika",
    "1 tsp. Italian seasoning",
    "1 tsp. onion powder",
    "1 tsp. dried oregano",
    "1 lbs. ground beef",
    "2 clove garlic",
    "14 oz. diced tomatoes, canned",
    "1 c. tomato puree",
    "1 tsp. tomato paste",
    "1 tsp. dijon mustard",
    "2 c. chicken stock",
    "sea salt & black pepper to taste"
  ],
  "__v": 1
}