{
  "hash": "8929c2fa8c7f0a51ce9df43701f724ef4cae85af",
  "title": "AUBERGINE LASAGNE",
  "image": "http://uitpaulineskeuken.nl/wp-content/uploads/2017/03/Aubergine-lasagne-9-9-710x380.jpg",
  "href": "http://uitpaulineskeuken.nl/2017/03/aubergine-lasagne.html",
  "extension": "Chrome",
  "firstAdded": "2017-03-13T20:14:47.745000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Hak 1 teentje knoflook grof. Meng dit samen met een royale scheut olijfolie, een tl oregano en wat peper en zout in een bakje. Deze kruidenolie gebruik je om de aubergines mee in te smeren.",
    "Snijd de aubergines (evt. met een mandoline) in dunne plakken. Laat een grillpan goed heet worden. Bestrijk ieder plakje met de kruidenolie en grill ze aan weerszijden goudbruin. Laat ze goed uitlekken op een keukenpapiertje.",
    "Pel en snipper de ui en hak de overige 2 teentjes knoflook en de rode peper (zonder zaadjes) fijn. Fruit dit aan in iets olijfolie. Voeg de tomaten passata toe.",
    "Voeg nu beetje bij beetje de spinazie toe.",
    "Breng de tomatensaus op smaak met peper, zout, oregano en de verse basilicum. Laat het zo’n 10 minuutjes pruttelen.",
    "Meng de ricotta met de Parmezaan in een kom. Houd iets Parmezaan achter ter garnering.",
    "Neem een grote ovenschaal en begin met een laagje tomatensaus. Verdeel daarover een paar plakjes gegrilde aubergine. Verdeel een paar lepels van het ricotta mengsel over de aubergine en herhaal de voorgaande stappen. Ga net zo lang door totdat alles saus en aubergine op is.",
    "Eindig met een laagje Parmezaan ricotta. En verdeel tot slot nog wat vers geraspte Parmezaan over de aubergine lasagne.",
    "Bak de veggie lasagne in 15 minuten af in een voorverwarmde oven op 180 graden.",
    "Serveer met brood, want dan kan je lekker in de saus dippen."
  ],
  "ingredients": [
    "0",
    "3 grote aubergines",
    "400 gr spinazie",
    "1 liter tomaten passata (= gezeefde tomatensaus)",
    "1 ui",
    "2 + 1 teentjes knoflook",
    "0,5 rode peper",
    "350 gr ricotta",
    "40 gr Parmezaan",
    "Handje verse basilicum",
    "2 + 1 tl oregano",
    "Peper en zout",
    "Olijfolie"
  ],
  "__v": 1
}