{
  "__v": 2,
  "directions": [
    "0",
    "To prepare filling: If you’re roasting a half-breast of turkey, preheat oven to 170°C. Lightly rub turkey with oil and roast in shallow pan until temperature probe registers 76°C, 50-60 minutes. When cool enough to handle, remove meat from bones and cut into 2cm cubes. If not using immediately, keep refrigerated.",
    "Cook bacon, if using, until crisp. Remove to paper towels to cool, then crumble.",
    "In a large saucepan, melt butter, then add onion and sauté over medium-low heat for 10 to 15 minutes, stirring occasionally, until soft and translucent.",
    "While the onions are cooking, heat the stock to just boiling. Add potatoes and carrots to the stock and cook for two to three minutes, until slightly tender. Turn off heat. With a slotted spoon, remove vegetables to a bowl and set aside.",
    "To the softened onions, add flour and cook, stirring constantly, for two minutes.",
    "Add the hot stock to the onions and simmer until thick, stirring constantly, about one minute.",
    "Stir in salt, pepper and ¼ cup heavy cream. Add turkey, potatoes, carrots, peas and parsley, stirring to mix well. Check for proper seasoning. Remove from heat.",
    "To prepare glaze: In a small bowl, beat egg yolk with two teaspoons cream. Set aside.",
    "To assemble pot pies: Divide the filling among six 250ml ovenproof ramekins or straight-sided dishes no more than 10cm wide. Divide crumbled bacon among the pies. (If there’s any leftover filling, serve it on toast!)",
    "Remove crust dough from plastic wrap (remember: you took it out of the refrigerator 30 minutes ago), and place on lightly floured surface. Roll dough into a 25cm by 40cm rectangle. With a knife or pizza cutter, cut six 13cm squares. (You can use the remaining pastry to make decorative leaves.)",
    "With a small brush or your finger, brush the rim of each bowl with beaten egg yolk, then drape pastry over the filling, pressing gently on rim to seal.",
    "Brush the entire surface of pastry with egg glaze.",
    "With a sharp paring knife, cut small leaf shapes from the remaining dough, using the blade to press “veins” into the surface. Arrange two or three leaves on each pie. Stir paprika into the remaining egg glaze, then paint the leaves with this tinted mixture.",
    "To bake: Preheat oven to 180°C. Place pies on a rimmed baking sheet; this will catch any possible drips. Bake in oven for 30 to 40 minutes, or until the tops are golden and the filling is bubbling hot."
  ],
  "firstAdded": "2014-10-14T17:43:41.612000",
  "hash": "7b9cb423742e7179dc0e96b050d0c0b917181a53",
  "href": "http://www.thestar.com.my/Lifestyle/Food/Recipes/2013/12/17/Turkey-Pot-Pie-Filling/",
  "image": "http://www.thestar.com.my/~/media/Images/TSOL/Photos-Gallery/features/2013/12/14/str2_jg_1412_p26c_MCTPOTPIE.ashx?w=620&h=413&crop=1&",
  "ingredients": [
    "0",
    "Makes enough for 6 individual pot pies",
    "-------------------",
    "3 to 4 cups diced turkey, from leftover turkey or roasted half-breast",
    "Vegetable oil",
    "2 slices bacon (not thick-cut)",
    "1/2 cup (125g) unsalted butter",
    "1 1/2 cup finely chopped yellow onion",
    "4 cups chicken or turkey stock",
    "1 cup small red potatoes, cut into 2cm cubes",
    "1 cup carrot, peeled, cut into 2cm cubes",
    "1/2 cup flour",
    "1 1/2 tsp salt",
    "Freshly ground pepper",
    "1/4 cup heavy cream",
    "1 cup frozen peas",
    "1/2 cup chopped parsley leaves",
    "------------------------",
    "Glaze",
    "-------------------------",
    "1 egg yolk",
    "2 tsp heavy cream",
    "1/2 tsp paprika"
  ],
  "keywords": [
    "makes",
    "individual",
    "pot",
    "pies",
    "leftover",
    "turkey",
    "roasted",
    "halfbreast",
    "oil",
    "slices",
    "bacon",
    "thickcut",
    "unsalted",
    "butter",
    "yellow",
    "onion",
    "chicken",
    "stock",
    "red",
    "potatoes",
    "cubes",
    "carrot",
    "flour",
    "salt",
    "pepper",
    "cream",
    "frozen",
    "peas",
    "parsley",
    "leaves",
    "glaze",
    "egg",
    "yolk",
    "paprika"
  ],
  "title": "Turkey Pot Pie Filling",
  "users": [
    null
  ]
}