{
  "hash": "e9b3891815a4caa8f8f5cea21af2b8ed2b293bdc",
  "title": "Chicken Enchilada Casserole",
  "image": "http://12tomatoes.com/system/blog_photos/photos/000/000/200/large/13603642_xl.jpg?1392258922&caption=true",
  "href": "http://12tomatoes.com/2014/02/dinner-recipe-chicken-enchilada-casserole.html",
  "extension": "Chrome",
  "firstAdded": "2015-05-04T21:06:07.421000",
  "users": [
    null
  ],
  "keywords": [
    "chicken",
    "monterey",
    "jack",
    "blend",
    "desired",
    "cheese",
    "combo",
    "green",
    "chilies",
    "undrained",
    "flour",
    "corn",
    "tortillas",
    "refried",
    "beans",
    "enchilada",
    "equivalent",
    "medium",
    "onions",
    "slow",
    "cooker",
    "recipes",
    "dinner",
    "impossible",
    "mess",
    "casserole"
  ],
  "directions": [
    "0",
    "First, make sure the chicken is cooked and cut into cubes – for instance, you could brush it with olive oil and bake it at 350 degrees F, for 35-45 minutes or until it’s fully cooked; or use your own preferred method.",
    "Once your chicken is cooked, make sure the oven is preheated to 350 degrees F. Grease a 13x9 casserole dish with cooking spray.",
    "Mix the chicken, 1 1/2 cups of cheese, and the chiles in a bowl together.",
    "Add a few spoonfuls of enchilada sauce to the bottom of the casserole dish and spread it evenly across the dish. Then layer three tortillas on top of the sauce, making sure that the entire bottom of the dish and part of the sides are completely covered by the tortillas. It might help to cut one of the tortillas into smaller pieces to fit over the small gaps.",
    "Spread about half of the beans on top of the tortillas, followed by half the chicken mixture and then half of the enchilada sauce. Put another three tortillas on top of this layer, followed by the rest of the beans and chicken mixture.",
    "Put two tortillas on top of this layer, overlapping a bit, then add the rest of the enchilada sauce on top of these tortillas. Finish by sprinkling the rest of the cheese (1 1/2 cups) on top.",
    "Cover the dish in foil and bake it for 45 to 55 minutes, or until bubbly (peek under the foil to check). Garnish with green onions if desired, then serve after letting the dish stand for about five minutes.",
    "Enjoy!"
  ],
  "ingredients": [
    "0",
    "2 cups diced cooked chicken",
    "3 cups shredded Monterey Jack cheese blend (or desired cheese combo)",
    "1 4.5-ounce can chopped green chilies, undrained",
    "1 package of flour or corn tortillas",
    "1 16-ounce can refried beans",
    "1 19-ounce can enchilada sauce (or equivalent of homemade sauce)",
    "1/4 cup medium green onions, sliced (optional, for garnish)",
    "1",
    "Top 10 Slow Cooker Recipes",
    "15 Dinner Recipes that are Impossible to Mess Up",
    "Top 5 Casserole Recipes"
  ],
  "__v": 1
}