{
  "hash": "e644c862e0a2807077eb13c1a94c4eeb0916bd63",
  "title": "Baked Falafel Burgers",
  "image": "https://minimalistbaker.com/wp-content/uploads/2014/11/Healthy-Simple-BAKED-Falafel-Burgers-Perfect-on-greens-or-pita-with-a-simple-hummus-garlic-sauce-vegan.jpg",
  "href": "https://minimalistbaker.com/baked-falafel-burgers/",
  "extension": "",
  "firstAdded": "2018-01-16T03:10:01.524000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add parsley, garlic, lemon juice, cumin, and a healthy pinch each salt and pepper to a food processor and mix to combine.",
    "Add chickpeas and pulse until incorporated but still slightly chunky. You want to maintain a bit of texture.",
    "Transfer to a mixing bowl and add nut meal (or oat flour) and mix again until a loose dough is formed that's firm enough to be handled. Taste and adjust seasonings as needed. I added a touch more salt.",
    "Draw an “x” in the dough to form 4 sections, then use your hands to form into 4 large patties roughly 1/2-inch thick.",
    "Place on a foil-lined baking sheet and refrigerate or freeze for 15 minutes to firm up. Preheat oven to 375 degrees F (in the meantime.",
    "OPTIONAL STEP: For a little extra crust on the outside, before baking heat a large skillet over medium to medium-high heat and add 2 Tbsp olive or canola oil. Swirl to coat pan, then add falafel. Carefully flip once golden brown – about 3-4 minutes - and then cook on the other side until golden brown as well - 3-4 more minutes. Return to baking sheet to continue baking. Otherwise, just add them straight to the oven for baking.",
    "Bake for a total of 30-40 minutes, flipping once at the halfway point for even cooking. The longer you bake them, the firmer they’ll get!",
    "Serve warm wrapped in a pita or chard bun and desired sauces / toppings. Alternatively, serve atop a salad and use the garlic sauce as a dressing.",
    "Burgers will store in the fridge, layered with parchment paper in an airtight container, for several days. Freeze to keep longer."
  ],
  "ingredients": [
    "0",
    "1 bundle fresh parsley (~2 cups chopped)",
    "3 large cloves garlic",
    "1 large lemon (~2 1/2 Tbsp juice)",
    "scant 1/2 tsp sea salt + black pepper",
    "1 1/4 tsp cumin",
    "1 15-ounce can chickpeas, well rinsed and drained",
    "1/4 - 1/2 cup ground raw walnuts, pecans, almonds, or GF oat flour",
    "1",
    "Garlic Dill sauce",
    "Chili Garlic Sauce or Sriracha",
    "5-minute Hummus",
    "Tomato",
    "Lettuce",
    "Onion",
    "Pita or sturdy greens, such as chard or collard greens"
  ],
  "__v": 1
}