{
  "hash": "fa3e396cbdbba1092d49a6e2497310f57d6d4272",
  "title": "Banana Chocolate Chip Crumb Cake",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2014/02/Banana-Chocolate-Chip-Crumb-Cake-super-moist-and-decadent.-There-wont-be-a-crumb-left.jpg",
  "href": "https://sallysbakingaddiction.com/2014/02/04/banana-chocolate-chip-crumb-cake/",
  "extension": "Chrome",
  "firstAdded": "2018-09-16T22:11:56.429000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350°F (177°C). Grease a 8x8 or 9x9 baking pan. Set aside.",
    "In a medium bowl, toss the flour, cinnamon, baking soda, baking powder, and salt together. Set aside.",
    "Using a handheld or stand mixer with a paddle attachment, beat the butter on high speed until creamy, about 1 minute. Scrape down the sides and the bottom of the bowl as needed. Switch the mixer to medium speed and beat in the sugar until combined. Beat in the egg and vanilla extract, scraping down the sides and bottom of the bowl as needed. Add the mashed banana and yogurt and turn the mixer on high and beat until creamy, about 1 minute. Turn the mixer off and pour the dry ingredients into the wet ingredients. Turn the mixer on low and slowly beat until combined. Do not overmix.",
    "Make the streusel by combining all of the streusel ingredients into a small bowl. Layer half of the batter into the prepared baking pan. Top with half of the streusel. Repeat with the rest of the batter and streusel. Bake for 40-50 minutes, covering the cake with aluminum foil after 25 minutes to prevent the edges from browning too quickly. Bake until the center is baked through, mine took 45 minutes exactly. Test doneness with a toothpick; if it comes out clean, the cake is done.",
    "Allow to slightly cool for ten minutes before cutting and serving. Cake stays fresh covered tightly at room temperature for up to 4 days.",
    "Make ahead tip: The cake can be baked and covered tightly at room temperature overnight. Cake can be frozen up to 2 months. Thaw overnight in the refrigerator and bring to room temperature before serving."
  ],
  "ingredients": [
    "0",
    "1 and 1/2 cups (190g) all-purpose flour (measured correctly)",
    "1/2 teaspoon ground cinnamon",
    "3/4 teaspoon baking soda",
    "3/4 teaspoon baking powder",
    "1/4 teaspoon salt",
    "5 Tablespoons (75g) unsalted butter, softened to room temperature",
    "1/2 cup (100g) granulated sugar",
    "1 large egg",
    "1 teaspoon vanilla extract",
    "1 and 1/2 cup mashed bananas, very ripe (about 3 large bananas)",
    "1/4 cup (60g) yogurt1"
  ],
  "__v": 1
}