{
  "__v": 1,
  "directions": [
    "0",
    "Mettete l'acqua a bollire in una casseruola capiente e salatela.",
    "In una padella antiaderente tipo wok, fate sciogliere i filetti di acciuga in 3 cucchiai d'olio ed insaporite con lo spicchio d'aglio senza fare soffriggere.",
    "Tagliate le zucchine a bastoncini.",
    "Eliminate il pistillo dai fiori di zucca e puliteli delicatamente con un panno. Tagliateli a strisce piuttosto grandi.",
    "Una volta sciolta l'acciuga ed insaporito l'olio, versate le zucchine e fatele saltare per 5/7 minuti. Dovranno cuocere ma restare comunque croccanti.",
    "Aggiungete le olive taggiasche snocciolate e tagliate grossolanamente, e per finire i fiori di zucca. Aggiustate di sale e pepe e spegnete.",
    "Cuocete i fusilli nell'acqua bollente e scolateli conservando un po' di acqua di cottura, ancora al dente.",
    "Versateli nel wok e fate saltare la pasta qualche istante, aggiungendo le foglioline di menta tagliate sottili e l'acqua di cottura se necessario.",
    "Impiattate e distribuite la burrata ridotta a straccetti su ogni piatto. Servire immediatamente irrorando con un filo d'olio Riviera Ligure DOP."
  ],
  "firstAdded": "2014-10-08T19:37:27.583000",
  "hash": "68d72f84bf9be0748f2186280ac31ce7d350b54c",
  "href": "http://www.andantecongusto.it/2013/07/una-mattina.html",
  "image": "http://4.bp.blogspot.com/-SYMUnjvg4mg/UdVqQi09AYI/AAAAAAAAKGs/cjyL5ViBSNM/s640/VICINA.jpg",
  "ingredients": [
    "0",
    "Ingredienti per 4 persone",
    "320 gr di Fusilli (io Garofalo)",
    "3 zucchine chiare medie",
    "8 fiori di zucca",
    "200 gr di burrata freschissima",
    "50 gr di olive taggiasche",
    "4 filetti di acciughe sott'olio",
    "1 spicchio d'aglio",
    "un ciuffetto di foglie di menta fresca",
    "Olio extra-vergine Riviera Ligure DOP",
    "sale - pepe"
  ],
  "keywords": [
    "ingredienti",
    "persone",
    "fusilli",
    "garofalo",
    "zucchine",
    "chiare",
    "medie",
    "fiori",
    "zucca",
    "burrata",
    "freschissima",
    "olive",
    "taggiasche",
    "filetti",
    "acciughe",
    "sottolio",
    "spicchio",
    "daglio",
    "ciuffetto",
    "foglie",
    "menta",
    "fresca",
    "olio",
    "extravergine",
    "riviera",
    "ligure",
    "dop",
    "sale",
    "pepe"
  ],
  "title": "pasta con zucchine chiare, fiori di zucca, taggiasche e burrata",
  "users": [
    null
  ]
}