{
  "hash": "deb33402343335bce8f7ed643e2992ad88ed303e",
  "title": "Instant Pot Butter Chicken",
  "image": "http://myheartbeets.com/wp-content/uploads/2016/03/paleo-butter-chicken.jpg",
  "href": "http://myheartbeets.com/instant-pot-butter-chicken/",
  "extension": "Chrome",
  "firstAdded": "2017-05-30T21:43:12.251000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Press the “saute” button on the Instant Pot, and add the ghee and onions to the pot. Stir-fry the onions for 8-10 minutes or until the onions begin to brown.",
    "Add the garlic and ginger, stir-fry for 30 seconds.",
    "Stir in the spices, then add the chicken and mix until well combined. Continue to stir this for 4-5 minutes to sear the chicken.",
    "Add the tomato sauce and green bell pepper, then cover and lock the lid. press the “Keep Warm/Cancel” button on the Instant Pot, then press the “Manual” button to begin the pressure cooking and set the time for 10 minutes. Make sure the steam valve is closed.",
    "Once the curry is done, the Instant Pot will automatically switch to the “Keep Warm” mode. Allow the pressure to release naturally or use the quick release if you want your food on your plate sooner.",
    "Unlock the lid, stir in the coconut cream and fenugreek leaves.",
    "Garnish with cilantro if desired, then serve."
  ],
  "ingredients": [
    "0",
    "1 ½ pounds skinless chicken thighs, cut into bite-sized pieces",
    "2 tablespoons ghee, grassfed butter or fat of choice",
    "1 onion, diced",
    "5 garlic cloves, minced",
    "1-inch knob ginger, minced",
    "1 teaspoon garam masala",
    "1 teaspoon paprika",
    "1 teaspoon coriander powder",
    "1 teaspoon turmeric",
    "1 teaspoon salt",
    "¼ teaspoon cayenne",
    "¼ teaspoon cumin",
    "¼ teaspoon black pepper",
    "1 green bell pepper, chopped in large pieces",
    "1 (15 ounce) can tomato sauce",
    "1",
    "1 cup coconut cream",
    "Pinch of dried fenugreek leaves (kasoori methi)",
    "Cilantro for garnish, optional"
  ],
  "__v": 1
}