{
  "hash": "96e80fefa4e47dc4635c3d1307795076a5bc30ef",
  "title": "Creamy Tomato & Spinach Pasta",
  "image": "http://static.budgetbytes.com/wp-content/uploads/2013/07/Creamy-Tomato-Spinach-Pasta-pan.jpg",
  "href": "http://www.budgetbytes.com/2013/07/creamy-tomato-spinach-pasta/",
  "firstAdded": "2015-02-27T22:03:44.505000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "onion",
    "garlic",
    "tomatoes",
    "oregano",
    "basil",
    "red",
    "pepper",
    "cracked",
    "salt",
    "tomato",
    "cream",
    "cheese",
    "parmesan",
    "penne",
    "pasta",
    "spinach"
  ],
  "directions": [
    "0",
    "Bring a large pot of water to a boil over high heat. Add the pasta and cook until tender (7-10) minutes. Drain the pasta in a colander.",
    "While waiting for the pasta to cook, dice the onion and mince the garlic. Cook both in a large skillet with the olive oil over medium-low heat until softened and transparent (about 5 minutes).",
    "Add the diced tomatoes (with juices), oregano, basil, red pepper flakes, salt, and some freshly cracked pepper to the skillet with the onions and garlic. Stir to combine. Add the tomato paste and a ½ cup of water to the skillet and stir until the tomato paste is dissolved into the sauce.",
    "Turn the heat down to low. Cut the cream cheese into a few pieces and then add them to the skillet with the tomato sauce. Use a whisk to stir the sauce until the cream cheese has fully melted in and the sauce is creamy. Add half of the Parmesan to the skillet and whisk until it is melted in. Add the remainder of the parmesan and whisk until melted in again.",
    "Add the fresh spinach and gently stir it into the sauce until it has wilted (3-5 minutes). Add the pasta and stir until it is well coated in the creamy tomato sauce. Taste and adjust the salt and pepper as needed. Serve warm."
  ],
  "ingredients": [
    "0",
    "1 Tbsp olive oil",
    "1 small onion",
    "2 cloves garlic",
    "1 (15 oz.) can diced tomatoes",
    "½ tsp dried oregano",
    "½ tsp dried basil",
    "pinch red pepper flakes (optional)",
    "freshly cracked pepper to taste",
    "½ tsp salt",
    "2 Tbsp tomato paste",
    "2 oz. cream cheese",
    "¼ cup grated Parmesan",
    "½ lb. penne pasta",
    "½ (9 oz.) bag fresh spinach"
  ],
  "__v": 2
}