{
  "hash": "6d76d2f5d9a43d85887ab970d6e562084ca36cb8",
  "title": "Raisin Bran Muffins Recipe",
  "image": "http://www.seriouseats.com/recipes/assets_c/2016/12/20161205-bran-muffins-vicky-wasik-10-thumb-1500xauto-435683.jpg",
  "href": "http://www.seriouseats.com/recipes/2017/01/easy-raisin-bran-muffin-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2017-01-10T00:36:25.816000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Adjust oven rack to middle position and preheat to 350°F (177°C). In a large measuring cup, combine wheat bran and boiling water. Let stand 5 minutes, then stir in Greek yogurt and eggs. Meanwhile, combine whole wheat flour, all-purpose flour, sugar, cinnamon, baking powder, salt, baking soda, and butter in the bowl of a stand mixer fitted with a paddle attachment. Mix on low speed until the butter is incorporated, then add bran mixture and continue only until the batter is well combined. With a flexible spatula, scrape the bowl and fold the batter once or twice to make sure it's well mixed from the bottom up, then fold in the raisins if using.",
    "Divide the batter between 12 lightly greased muffin cups, about 4 ounces (1/2 cup; 115g) each. This is enough to completely fill each cup with a little mountain of batter, but do not be alarmed; it will rise significantly but spread very little overall. If you like, sprinkle with flaxseed, and bake until puffed and firm, about 18 minutes. Serve warm, and store leftovers in an airtight container for up to 2 days."
  ],
  "ingredients": [
    "0",
    "2 ounces wheat bran, such as Bob’s Red Mill (1 cup; 55g)",
    "8 ounces boiling water (1 cup; 225g)",
    "4 ounces plain, non-fat Greek yogurt (1/2 cup; 115g)",
    "2 large eggs, cold",
    "6 1/2 ounces whole wheat flour (1 1/2 cups; 185g)",
    "5 1/2 ounces all-purpose flour (1 cup plus 1 tablespoon; 155g)",
    "5 1/4 ounces sugar (3/4 cup; 150g)",
    "1/2 ounce ground cinnamon (1 tablespoon; 15g)",
    "2 teaspoons baking powder",
    "3/4 teaspoon (3g) Diamond Crystal kosher salt; for table salt, use half as much by volume or use the same weight",
    "1/4 teaspoon baking soda",
    "1/8 teaspoon grated nutmeg",
    "6 ounces unsalted butter, soft and creamy—about 68°F (20°C)(12 tablespoons; 170g)",
    "6 ounces golden raisins (1 cup; 170g), optional",
    "3/4 ounce flaxseed (3 tablespoons; 20g), optional"
  ],
  "__v": 1
}