{
  "hash": "b345193472c0d6dcabb3ccbb30f7da9007f36d1a",
  "title": "Italian Stuffed Squash",
  "image": "https://data.beyonddiet.com/getimage.imhx?img=00_40_94_21_409421-115173.jpg&w=710&cust=2x1",
  "href": "https://www.beyonddiet.com/Recipes/24190/italian-stuffed-squash?food=potato&utm_source=pinterest&utm_medium=post&utm_content=ItalianStuffedSquash",
  "extension": "Chrome",
  "firstAdded": "2017-01-03T03:08:36.816000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions",
    "Preheat oven to 350°F.",
    "Cut squash in half lengthwise and scoop out seeds. Set squash halves aside.",
    "Heat coconut oil and saute chopped onions, chopped peppers, and chopped mushrooms over medium high heat. When onions start to turn clear, add minced garlic and saute for one minute more. Remove from heat and put into separate mixing bowl.",
    "Brown ground beef with the parsley and basil. Drain and return to pan. Add cooked vegetables to cooked meat. Add tomato sauce and simmer until the mixture has thickened and liquid has cooked off, about 10 minutes. Then turn off heat.",
    "Line baking sheet with foil and place squash on the sheet, open end up.",
    "Add 3/4 cup of shredded cheese to meat sauce and stir to combine. Spoon the meat and cheese mixture into the squash havles, pressing down with the spoon and mounding it up a little over the top.",
    "Bake stuffed squash for 20 minutes. Remove from oven and use remaining cheese to top each one with a pinch of cheese. Put back in oven and bake 10-15 minutes more, until squash is slightly soft when pierced with a fork and cheese is melted and lightly browned. Serve hot."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 lrg. squash, yellow, fresh, organic",
    "1 med. onion, red, organic",
    "1 med. bell pepper, green, fresh, organic",
    "1 clove garlic, fresh, organic",
    "1 tbs. parsley, fresh, organic",
    "1 1/2 tsp. basil, fresh, organic",
    "1 lbs. beef, ground, free-range or grass-fed, organic",
    "2 c. tomato sauce, organic",
    "1 c. cheese, mozzarella, whole fat, raw, grass-fed or pastured, organic",
    "1/2 c. mushrooms, white, organic",
    "1 tsp. coconut oil, raw, extra-virgin, organic"
  ],
  "__v": 1
}