{
  "hash": "55a7ae17b170cdffc5bd6ab755d0c0cb7570a0a7",
  "title": "Roasted Garbanzo and Vegetable Salad Recipe with Garlic, Feta, Olives, and Basil",
  "image": "http://1.bp.blogspot.com/-oKdaLVajJ-k/UW2TkJJzV8I/AAAAAAAAe3E/0NDf5-BH6Ik/s1600/1-roasted-garbanzo-vegetable-salad-500x500-kalynskitchen.jpg",
  "href": "http://www.kalynskitchen.com/2013/04/roasted-garbanzo-vegetable-salad-feta-olives.html",
  "firstAdded": "2014-12-21T18:23:26.070000",
  "users": [
    null
  ],
  "keywords": [
    "garbanzo",
    "beans",
    "rinsed",
    "cold",
    "water",
    "red",
    "bell",
    "peppers",
    "seeds",
    "stem",
    "pieces",
    "square",
    "onion",
    "olive",
    "oil",
    "brushing",
    "roasting",
    "sheet",
    "dont",
    "use",
    "spray",
    "garlic",
    "salt",
    "freshground",
    "black",
    "pepper",
    "crumbled",
    "feta",
    "weight",
    "olives",
    "leaves",
    "parsley",
    "basil",
    "dressing",
    "wine",
    "vinegar",
    "lemon",
    "juice"
  ],
  "directions": [
    "0",
    "Preheat oven to 400F/200C. Put garbanzo beans in a colander placed in the sink and rinse well with cold water until no more foam appears, then let drain well. (You can blot dry with paper towels if you need to speed up the draining step.)",
    "While garbanzos drain, chop red bell peppers and red onion. Toss drained garbanzos, chopped red bell pepper, chopped red onion, minced garlic, and olive oil and spread out on a baking sheet that you've sprayed with olive oil or non-stick spray. Season to taste with salt and fresh-ground black pepper. Roast the beans and vegetables about 20 minutes, or until vegetables are starting to soften.",
    "While garbanzos and vegetables roast, crumble the feta, drain the olives and slice in half, and wash the basil, spin dry, and slice into strips.",
    "When garbanzos and vegetables are done, put back into the bowl and toss with dressing, then let cool for about 10-15 minutes. When cooled, stir in the Feta and sliced olives. Add the strips of basil (or chopped parsley) and stir gently to combine. Season again with salt and fresh ground black pepper (to taste; I didn't add much salt). Serve slightly warm or at room temperature."
  ],
  "ingredients": [
    "0",
    "2 cans (15 oz.) garbanzo beans, rinsed well with cold water and drained",
    "2 large red bell peppers, seeds and stem removed and chopped into pieces about 3/4 inch square",
    "1 large red onion, peeled and chopped into pieces about 3/4 inch square",
    "2 T olive oil (plus more for brushing roasting sheet if you don't use non-stick spray)",
    "1 T minced garlic",
    "salt and fresh-ground black pepper to taste",
    "1/2 cup crumbled Feta",
    "1 can (6 oz. drained weight) black olives, drained and cut in half",
    "3/4 cup sliced fresh basil leaves (or use 1/2 cup chopped parsley if you don't have basil)",
    "Dressing Ingredients:",
    "1 T red wine vinegar",
    "1 tsp. fresh lemon juice",
    "2 T olive oil"
  ],
  "__v": 1
}