{
  "__v": 1,
  "directions": [
    "0",
    "Take half the lobster meat and chop it finely.\nCrush the saffron into the white wine and stir well.\nIn a heavy, medium-sized pot, heat the olive oil over medium-high heat and saute the shallots for 2-3 minutes. Do not let them color.\nAdd the garlic and the rice and stir well for about a minute. Add the finely chopped lobster meat, about a 1/4 teaspoon of salt and the white wine-saffron mixture and stir to combine. Bring to a boil.\nStirring frequently -- about once every 90 seconds or so -- let the white wine boil down. Turn the heat to medium and start adding the lobster stock about 1/2 cup at a time, stirring all the while.\nKeep cooking until the rice is done, but still a little al dente. You don't want mushy rice. Add the rest of the lobster meat and the parsley, then check for salt -- add some if needed.\nServe at once with white wine. A perfect match would be a Sardinian Vermentino or a Sicilian Grillo, but an unoaked Chardonnay, white Cotes du Rhone blend or an off-dry Riesling would be fine as well. A Spanish Albarino would also be good."
  ],
  "hash": "875f70db5dba7902dafc486a7eae89f7b2319681",
  "href": "http://fishcooking.about.com/od/recipesforbothmaineand/r/Lobster_risotto.htm",
  "image": "http://0.tqn.com/d/fishcooking/1/I/A/3/-/-/lobster_risotto.jpg",
  "ingredients": [
    "0",
    "1/2 lb lobster meat",
    "2 cups Arborio or Carnaroli (or other short-grain) rice",
    "4 T. olive oil",
    "2 finely chopped shallots",
    "2 finely chopped garlic cloves",
    "1 T. chopped parsley",
    "Large pinch of saffron",
    "1/4 cup white wine (Vermentino would be ideal)",
    "1 qt. lobster (or fish or chicken) stock",
    "Salt"
  ],
  "keywords": [
    "lobster",
    "meat",
    "arborio",
    "carnaroli",
    "shortgrain",
    "rice",
    "olive",
    "oil",
    "shallots",
    "garlic",
    "parsley",
    "saffron",
    "white",
    "wine",
    "vermentino",
    "ideal",
    "fish",
    "chicken",
    "stock",
    "salt"
  ],
  "title": "Lobster Risotto",
  "users": [
    null
  ]
}