{
  "hash": "3667355634c73445600c6dbb726d0ca8d2368af9",
  "title": "Индийская лепешка наан с чесноком и зеленью",
  "image": "http://www.povarenok.ru/data/cache/2014sep/13/47/859377_78617-300x0.jpg",
  "href": "http://www.povarenok.ru/recipes/show/94871/",
  "extension": "Chrome",
  "firstAdded": "2015-12-17T16:07:46.703000",
  "users": [
    null
  ],
  "keywords": [],
  "directions": [
    "0",
    "Муку просеять, добавить все сухие ингредиенты и хорошо размешать. Добавить в миску йогурт и начать смешивать с мукой прямо рукой, постепенно добавлять теплое молоко, продолжая вымешивать. Когда сформируется липкое тесто, выложить его на поверхность и хорошенько вымешать. При необходимости добавить муки, тесто должно быть эластичным, мягким, немного липким, но не приставать к рукам.",
    "Накрыть миску с тестом пищевой пленкой, а поверху кухонным полотенцем. Убрать в темное теплое место подальше от сквозняков и оставить подходить на полтора-два часа, пока не увеличится вдвое.",
    "Еще раз вымесить тесто, чтобы ушел лишний воздух. Смазать руки растительным маслом. Отрывать от теста небольшие кусочки и формировать из них плоские овальные лепешки. С одной стороны намазать лепешки чесноком и посыпать зеленью, чуть утапливая и чеснок и зелень в тесте.",
    "Чесноком и посыпать зеленью, чуть утапливая и чеснок и зелень в тесте.",
    "4.\tПожарить лепешки на сухой горячей сковороде с одной стороны – с чистой, где нет посыпки 2-3 минуты до румяного цвета. Верх проколоть вилкой. Убрать на противень и поставить в духовку в режим гриль (без фена, чтобы была самая высокая возможная температура) на 2-3 минуты. В это время от духовки не отходить и вообще желательно выставлять время на таймере, потому что горят лепешки очень быстро. Повторить с оставшимся тестом.",
    "5.\tСмазать каждую лепешку кусочком сливочного масла и подавать с вашим любимым карри."
  ],
  "ingredients": [
    "0",
    "Мука — 2 стак.",
    "Молоко — 1 стак.",
    "Йогурт — 1/2 стак.",
    "Сахар — 1 ч. л.",
    "Соль — 1 ч. л.",
    "Дрожжи — 2 ч. л.",
    "Разрыхлитель теста — 1/2 ч. л.",
    "Чеснок (пропущенный через пресс) — 3 ч. л.",
    "Кинза (рубленная) — 3 ст. л.",
    "Масло растительное"
  ],
  "__v": 1
}