{
  "hash": "54c07e5c7f38f1e3dff4ef8ea0292f6ec1efa394",
  "title": "Simple Chocolate Sachertorte",
  "image": "https://domesticateddarling.files.wordpress.com/2013/01/sachertorte.jpg?w=551",
  "href": "https://domesticateddarling.wordpress.com/2013/01/08/simple-chocolate-sachertorte/",
  "extension": "Chrome",
  "firstAdded": "2015-05-19T03:08:43.766000",
  "users": [
    null
  ],
  "keywords": [
    "dark",
    "chocolate",
    "broken",
    "butter",
    "softened",
    "castor",
    "sugar",
    "freerange",
    "eggs",
    "separated",
    "almonds",
    "heaped",
    "apricot",
    "jam"
  ],
  "directions": [
    "0",
    "Method:",
    "1. Preheat oven to 150°c (fan), 170°c, gas mark 6. Line the base of a 20-22cm springform cake tin with baking parchment. Melt the chocolate in a glass bowl set over a pan of simmering water, then set aside.",
    "2. Using an electric whisk, cream the butter and sugar together till fluffy. Add the egg yolks, melted chocolate and ground almonds and mix until evenly combined.",
    "3. In a separate bowl, whisk the egg whites with an electric whisk till soft peaks form, then carefully fold into the cake mix. Pop in the tin and bake for 35 minutes, then cool completely in the tin.",
    "4. For the topping, melt the chocolate and butter in a glass bowl set over a pan of simmering water. Leave to cool slightly.",
    "5. Carefully remove the cool cake from its tin, then spread the jam over the top of the cake. Dribble over the warm chocolate topping, letting it drip down the sides a little and leave it to set. Serve at room temperature.",
    "Toni sprinkled her’s with icing sugar and served plain. You could serve it with ice cream or whipped cream, and could even get fancy and put some chocolate decoration on the top.",
    "This cake is dense and rich and could last a while (if you can avoid the temptation of eating it at every opportunity)."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "200g 70% dark chocolate, broken up",
    "160g butter, softened",
    "120g castor sugar",
    "4 large free-range eggs, separated",
    "200g ground almonds",
    "Topping",
    "100g 70% dark chocolate, broken up",
    "50g butter",
    "3 heaped tbsp apricot jam"
  ],
  "__v": 1
}