{
  "hash": "f7bcd1bb003b963232466d7cc75df93a6117bdad",
  "title": "Homemade Vegan Cheese",
  "image": "http://vegangela.com/wp-content/uploads/2011/10/IMG_8383.jpg",
  "href": "http://vegangela.com/2011/10/15/homemade-vegan-cheese/",
  "extension": "",
  "firstAdded": "2015-11-12T17:41:26.063000",
  "users": [
    null
  ],
  "keywords": [
    "raw",
    "cashews",
    "nutritional",
    "yeast",
    "onion",
    "salt",
    "garlic",
    "plain",
    "soy",
    "milk",
    "agar",
    "canola",
    "oil",
    "yellow",
    "white",
    "miso",
    "lemon",
    "juice",
    "truffle",
    "chives"
  ],
  "directions": [
    "0",
    "Lightly oil 3-4 small ramekins.",
    "Using the pulse button, finely grind the cashews in a food processor (do not allow the cashews to turn into a paste). Add the nutritional yeast, onion powder, salt and garlic powder. Pulse 3 more times to blend in the spices.",
    "Combine the soy milk, agar, and oil in a heavy medium saucepan. Bring to a simmer over high heat. Decrease the heat to medium-low. Cover and simmer for 10 minutes, stirring occasionally, or until the agar is dissolved. With the food processor running, gradually pour the milk mixture through the feed tube and into the cashew mixture. Blend for 2 minutes, or until the mixture is very smooth and creamy. Blend in the miso, lemon juice, and truffle oil and chopped chives (if using). Note: if your food processor isn't very big, simply pour the cashew mixture into the saucepan and stir it vigorously for a minute or so, and then add the remaining ingredients.",
    "For grated or sliced cheese: Transfer the cheese to a container; cover and refrigerate until it is very firm, about 4 hours. Once it is firm, use a knife to gently remove the cheese from the ramekin. Grate or slice the cheese as desired.",
    "For melted cheese: Use the cheese immediately as melted cheese. To make the cheese in advance, cover and refrigerate it. When ready to use, melt it in a saucepan over medium heat until it is smooth and creamy, stirring frequently and adding more soy milk to the melted cheese to thin, if necessary.",
    "The cheese will keep for 4 days, covered and refrigerated."
  ],
  "ingredients": [
    "0",
    "½ cup + 2 tablespoons raw cashews",
    "¼ cup nutritional yeast",
    "1 teaspoon onion powder",
    "1 teaspoon sea salt",
    "½ teaspoon garlic powder",
    "1+3/4 cups plain unsweetened soy milk",
    "½ cup agar flakes (or 8 teaspoons agar powder)",
    "¼ cup canola oil",
    "2 tbsp yellow or white miso",
    "1 tablespoon fresh lemon juice",
    "3 teaspoons white truffle oil (optional)",
    "Chopped chives (optional)"
  ],
  "__v": 1
}