{
  "hash": "cb1942bb449b242dcd366a832a314bafc780f134",
  "title": "ools’ easy chicken curry",
  "image": "//cdn.jamieoliver.com/recipe-database/oldImages/335_448/1487_2_1430148812.jpg",
  "href": "https://www.jamieoliver.com/recipes/chicken-recipes/jools-easy-chicken-curry/",
  "extension": "Chrome",
  "firstAdded": "2017-10-22T01:34:12.090000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Method",
    "Peel and slice the onion. Peel the ginger and garlic, then finely chop or grate them on a microplane.",
    "Heat a lug of oil in a large pan over a medium heat, add the onions and cook for around 8 minutes, or until softened and slightly golden, stirring regularly. Add the ginger and garlic cook for a further 2 minutes.",
    "Meanwhile, mix the tikka masala paste, yoghurt and tomato purée together in a bowl. Halve and add the chicken thighs to the bowl. Stir everything together and get all the chicken covered in the paste mixture.",
    "Scrape everything into the pan, making sure you get all the paste mixture in there. Cook the chicken for 5 minutes or so, or until you see it start to colour.",
    "Add the tinned tomatoes, drained lentils and coconut milk. Bring to the boil, reduce the heat and simmer for 1 hour, stirring occasionally. Add splashes of water to loosen, if needed.",
    "When the time’s up, stir in the spinach (if using) and allow it to wilt. Next add the mango chutney and taste for seasoning.",
    "Pull the chicken apart with forks and stir it through. Serve with wholemeal basmati rice and yoghurt on the side, if you like."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 onion",
    "4cm piece of ginger",
    "2 cloves of garlic",
    "olive oil",
    "2 tablespoons tikka masala paste",
    "3 tablespoons natural yoghurt",
    "2 tablespoons tomato purée",
    "8 skinless higher-welfare chicken thighs",
    "1 x 400 g tin of chopped tomatoes",
    "1 x 400 g tin of green lentils",
    "1 x 400 g tin of light coconut milk",
    "2 handfuls of baby spinach , optional",
    "2 tablespoons quality"
  ],
  "__v": 1
}