{
  "hash": "534cb69d8c85661d98981a8ec94133ec4a09e705",
  "title": "Mole Verde",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/mole-verde",
  "extension": "Chrome",
  "firstAdded": "2017-07-01T02:14:19.273000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation",
    "Place chayote and green beans in a medium pot and add water to cover by 1\". Bring to a boil and cook until tender, about 4 minutes. Drain and transfer to a medium bowl.",
    "Cook jalapeños, tomatillos, and garlic in a large skillet, preferably cast iron, over medium heat, turning occasionally, until almost completely blackened, 10–15 minutes. Transfer to separate bowls. Cover jalapeños with plastic and let sit 5 minutes. Remove skins and stems, then cut a slit lengthwise along 1 side and remove seeds and veins. (If you like it spicy, leave a few seeds and veins.) Peel garlic.",
    "Meanwhile, purée masa and 2 cups broth in a blender until smooth. Strain through a fine-mesh sieve into a Dutch oven or other large pot set over medium heat. Cook, stirring constantly, until sauce is very thick and you can see the bottom of pot when you stir, about 5 minutes.",
    "Meanwhile, purée jalapeños, tomatillos, garlic, cilantro, parsley, allspice, cloves, cumin, and 1 cup broth in clean blender until smooth. Stir into sauce. Reduce heat to low and cook mole until thickened, about 5 minutes. Add more broth, if sauce gets too thick. For optimal color and flavor, be careful not to overcook. Add chayote and green beans and cook until warmed through. Season with salt and serve with meat or fish of choice."
  ],
  "ingredients": [
    "0",
    "Mole Verde",
    "There are no dried chiles in this green mole; it boasts bright, fresh flavors instead.",
    "Ingredients",
    "SERVINGS",
    "1 medium chayote, peeled, sliced ¼\" thick",
    "4 ounces fresh green beans, trimmed",
    "2 jalapeños",
    "4 tomatillos, husks removed, rinsed",
    "2 garlic cloves, unpeeled",
    "2 tablespoons masa harina",
    "3 cups low-sodium chicken broth, divided",
    "½ cup fresh cilantro leaves",
    "½ cup fresh parsley leaves",
    "2 whole allspice berries",
    "2 whole cloves",
    "Pinch of ground cumin",
    "Kosher salt",
    "Ingredient Info",
    "Chayote, a squash-like fruit native to Mexico and Central America, can be found at Latin markets and some supermarkets. Masa harina, also known as masa flour, can be found at Latin markets and many supermarkets."
  ],
  "__v": 1
}