{
  "hash": "aa2d973c2b0fed0f8ddac59cf7c9d02f0bc15951",
  "title": "Crispy Chicken with Italian Sauce and Bowtie Noodles (NEW and IMPROVED)",
  "image": "https://jamiecooksitup.net/wp-content/uploads/2014/09/The-one.jpg",
  "href": "https://jamiecooksitup.net/2014/09/crispy-chicken-with-italian-sauce-and-bowtie-noodles-new-and-improved/",
  "extension": "Firefox",
  "firstAdded": "2019-03-03T08:23:00.147000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a small food processor crush the corn flakes into crumbs.",
    "Add the 1/2 t salt to the 3/4 C flour. Stir to combine.",
    "Place the flour, milk and crushed corn flakes each into their own separate pan. Loaf pans work well for this. If you don’t have three loaf pans, do not dismay. You could use pie tins, or round cake pans…what ever works for you.",
    "Place your chicken breasts in a gallon sized Ziploc bag and seal the top.",
    "Pound the chicken flat with a meat mallet. You will really be thankful for the Ziploc bag in this step. Who wants a bunch of chicken guts flying around their kitchen? Not me…that’s who.",
    "5. Take a pair of sharp kitchen scissors and cut each breast in half.",
    "6. Dredge the chicken in the flour. Be sure it gets covered on both sides.",
    "Lay the floured chicken onto a small cookie sheet and slide the sheet into the freezer. Let it hang out there for about 5 minutes.",
    "7. Start cooking your pasta.",
    "8. Remove the chicken from the freezer and dredge each piece in the milk……",
    "…..and then immediately into the corn flake crumbs. Again, be sure both sides are covered well.",
    "9. Add the olive oil to a hot skillet.",
    "10. Carefully lay each chicken piece into the hot oil. Sprinkle with a little bit of salt and pepper. Cook over medium high heat for about 5 minutes….",
    "….or until the underside of each piece is nice and golden brown. Turn the pieces over. If the bottom of the pan is dry add just a bit more olive oil to the side of the pan. Swirl the pan around a bit to let the oil flow to all sides.",
    "11. Cover the pan and reduce the heat to medium. Let the chicken cook for about 7 more minutes, being careful not to burn the bottoms. Burned bottoms are not advised. In any shape or form. Thank you.",
    "12. When your chicken has been cooked through remove it from the pan and place it on a plate. Cover with tin foil.",
    "IMG_0258_edited-1",
    "13. Grab 1 package cream cheese and place it in a small bowl. Pop it into the microwave for 30 seconds. Add 1 tsp Italian seasoning, 1/4 tsp granulated garlic, 1/2 tsp oregano, 1/4 tsp seasoned salt, 1 tsp chicken bullion granules.",
    "IMG_0257_edited-1",
    "Stir it all in to combine.",
    "IMG_0262_edited-1",
    "14. Into your skillet place 1 tablespoon of butter and allow it to melt. Add 2 (10 ounce) cans cream of chicken soup, 1 C chicken broth (I used 1 C warm water + 1 tsp chicken bullion) and 1/2 C milk and the seasoned cream cheese. Whisk it well over medium high heat until it starts to bubble up. Let it cook for about 2 minutes.",
    "14. Slice your chicken into strips and serve over your cooked pasta and sauce. Garnish with chopped parsley if you choose.",
    "Enjoy!"
  ],
  "ingredients": [
    "0",
    "CHICKEN:",
    "3 large chicken breasts",
    "5 C corn flakes",
    "3/4 C flour",
    "1/2 t salt",
    "1/2 C milk",
    "6 T olive oil",
    "1 12 oz package bowtie noodles (farfalle)",
    "SAUCE:",
    "1 (8 ounce) package cream cheese",
    "1 tsp Italian seasoning",
    "1/4 tsp granulated garlic",
    "1/2 tsp oregano",
    "1/4 tsp seasoned salt",
    "1 tsp chicken bullion granules",
    "1 Tb butter",
    "2 (10 ounce) cans cream of chicken soup",
    "1 C chicken broth (I used 1 C warm water + 1 tsp chicken bullion)",
    "1/2 C milk"
  ],
  "__v": 1
}