{
  "hash": "e9b0fd1e6aa430358a91487c83d2a4418b08e3e8",
  "title": "mediterranean potato hash with asparagus, chickpeas and poached eggs",
  "image": "https://www.themediterraneandish.com/wp-content/uploads/2017/04/Mediterranean-Potato-Hash-with-Asparagus-Chickpeas-and-Poached-Eggs-12-267x400-150x150.jpg",
  "href": "https://www.themediterraneandish.com/mediterranean-potato-hash-asparagus-chickpeas-poached-eggs/",
  "extension": "",
  "firstAdded": "2018-05-05T20:06:47.362000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat 1 1/2 tbsp olive oil in a large cast-iron skillet. Turn the heat to medium-high and add the chopped onions, garlic and potatoes. Season with salt and pepper. Cook for 5-7 minutes, stirring frequently until the potatoes are tender (some of the potatoes may gain a bit of a golden crust, which is good!)",
    "Add the chickpeas, asparagus, a dash more salt and pepper and the spices. Stir to combine. Cook for another 5-7 minutes. Turn the heat to low to keep the potato hash warm; stir regularly.",
    "Meanwhile, bring a medium pot of water to a steady simmer and add 1 tsp vinegar. Break the eggs into a bowl. Stir the simmering water gently and carefully slide the eggs in. The egg whites should warp around the yoke. Cook for 3 minutes exactly, then remove the eggs from the simmering water and onto kitchen towel to drain briefly. Season with salt and pepper.",
    "Remove the potato hash from the heat and add the chopped red onions, tomatoes, feta and parsley. Top with the poached eggs. Enjoy!"
  ],
  "ingredients": [
    "0",
    "Olive oil",
    "1 small yellow onion, chopped",
    "2 garlic cloves, chopped",
    "2 russet potatoes, diced",
    "Salt and pepper",
    "1 cup canned chickpeas, drained",
    "1 lb baby asparagus, hard ends removed, chopped into 1/4 inch pieces",
    "1 1/2 tsp ground all-spice",
    "1 tsp Za’atar",
    "1 tsp dried oregano",
    "1 tsp paprika or hot paprika",
    "1 tsp coriander",
    "Pinch sugar",
    "4 eggs (to be poached)",
    "Water",
    "1 tsp White Vinegar",
    "1 small red onion, finely chopped",
    "2 Roma tomatoes, chopped",
    "1/2 cup crumbled feta",
    "1 cup chopped fresh parsley, stems removed"
  ],
  "__v": 1
}