{
  "hash": "411c0a1bf23d214eedf97a725c7d03bd34dbb923",
  "title": "Potato-Leek Soup With Bacon",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2011/3/1/0/FNM_040111-WN-Dinners-034_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/food-network-kitchens/potato-leek-soup-with-bacon-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-06-29T14:03:29.603000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 400 degrees F. Make the croutons: Melt 1 tablespoon butter, then mix with the paprika in a bowl. Add the bread cubes and toss. Spread on a baking sheet and bake until golden, 8 to 10 minutes.",
    "Meanwhile, cook the bacon in a large saucepan over medium heat until crisp, about 8 minutes. Transfer with a slotted spoon to a paper towel-lined plate. Discard all but about 1 tablespoon fat from the pan. Add the remaining 1 tablespoon butter, then add the leeks and garlic; cover and cook until soft, about 5 minutes. Add the broth, 2 cups water, the potatoes and 1/4 teaspoon each salt and pepper; cover and bring to a boil over high heat. Reduce the heat to medium and simmer, partially covered, until the potatoes are tender, about 10 minutes.",
    "Puree half the soup in a blender (remove the filler cap to let steam escape), then return to the pot. Add the cream and bring to a simmer. Add the peas and cook until tender, about 3 minutes. Season with salt and pepper. Serve topped with the croutons, bacon and parsley.",
    "Per serving: Calories 446; Fat 25 g (Saturated 13 g); Cholesterol 91 mg; Sodium 555 mg; Carbohydrate 42 g; Fiber 6 g; Protein 15 g",
    "Photograph by Antonis Achilleos",
    "When blending hot liquids, first let cool for 5 minutes or so, then transfer to a blender, filling only halfway. Put the lid on, leaving one corner open; Cover the lid with a kitchen towel to catch splatters and pulse until smooth.",
    "Recipe courtesy of Food Network Magazine"
  ],
  "ingredients": [
    "0",
    "2 tablespoons unsalted butter",
    "1/2 teaspoon smoked paprika",
    "1 1/2 cups cubed crusty bread",
    "4 slices bacon, chopped",
    "2 large leeks, white and light green parts only, thinly sliced",
    "2 cloves garlic, chopped",
    "4 cups low-sodium chicken broth",
    "2 medium russet potatoes, peeled and cut into 1/2-inch pieces",
    "Kosher salt and freshly ground pepper",
    "1/2 cup heavy cream",
    "1 1/2 cups frozen peas (do not thaw)",
    "1/4 cup chopped fresh parsley"
  ],
  "__v": 1
}