{
  "hash": "2cbb67942fac0b2c893365f160b28ee975a45838",
  "title": "Baby Yorkshire puds (creamy smoked trout & horseradish pate)",
  "image": "//cdn.jamieoliver.com/recipe-database/oldImages/335_448/36_1_1436525767.jpg",
  "href": "https://www.jamieoliver.com/recipes/fish-recipes/baby-yorkshire-puds-creamy-smoked-trout-horseradish-pate/",
  "extension": "Chrome",
  "firstAdded": "2018-01-07T13:18:18.562000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Method",
    "I can’t lie: this dish has become one of my new favourite things. Each mouthful is an outrageously delicious bit of heaven that anyone sensible won’t be able to resist. The contrast of hot crispy soft Yorkshire pudding and cold creamy smoky trout with a good hit of horseradish is unbelievable. You can put the creamy smoked fish in one big serving bowl if you like, but I think it’s quite sweet to make up a few individual servings in little teacups. Around May and June you’ll start to see flowering chives around, and those are beautiful for decorating the top of the potted fish if you’re out to impress. This is dead quick, so easy and absolutely perfect for a starter – just whack it right in the middle of the table so everyone can help themselves. Your guests will be fighting over it, I promise.",
    "Put the cream cheese into a mixing bowl with the horseradish, the zest of 1 lemon and the juice from half, and mix together. Mix in most of the chopped chives, then have a taste and add a pinch of salt and pepper. It’s very important that this mixture has a bolshie attitude – it should be hot, smoky, salty, so add more horseradish or lemon juice if needed. Flake in the trout, removing any skin and bones, then use a spatula to fold the mixture together gently so you have smaller bits and nice chunks. Decant into a single nice serving dish or several little bowls or cups, then drizzle over a little rapeseed oil and sprinkle over a few more chopped chives. Cover with clingfilm and put into the fridge to get nice and cold.",
    "When you’re nearly ready to eat, preheat the oven to full whack (about 240°C/475°F/gas 9) while you make your Yorkshire pudding batter. Get yourself a mini muffin tin (you can buy these easily online or in cooks’ shops) and pour a little thimble of vegetable oil into the 16 compartments of the tin, so you have a thin layer covering the bottom of each. Pop the tray on to the top shelf in the hot oven for around 10 to 15 minutes, so the oil gets so hot that it smokes. While you’re doing that, aggressively beat the eggs, flour, milk and a pinch of salt and pepper together, either by hand or in a food processor, until light and smooth. Transfer the mixture into a jug.",
    "Carefully take the tray out of the oven and quickly and confidently pour the batter into the hot tin so it nearly fills each well. Return the tray to the top shelf of the oven to cook for around 10 to 12 minutes, or until the Yorkies are puffed up and golden. Whatever you do, don’t open the oven door! Get your cold cups and bowls of potted fish out of the fridge and serve on a board with those sizzling hot little Yorkies and some lemon wedges.",
    "To. Die. For."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "FOR THE CREAMY SMOKED FISH",
    "125 g cream cheese",
    "2-3 heaped teaspoons jarred horseradish",
    "1 lemon",
    "1 small bunch fresh chives , finely chopped",
    "sea salt",
    "ground pepper",
    "125 g hot-smoked trout , from sustainable sources, ask your fishmonger, skin removed",
    "rapeseed oil",
    "FOR THE YORKIES",
    "vegetable oil",
    "2 large free-range eggs",
    "100 g plain flour",
    "100 ml milk",
    "lemon wedges , to serve"
  ],
  "__v": 1
}