{
  "hash": "8db63880ab2dd6928665fbbae579e38203edb4d5",
  "title": "S'mores Cannoli",
  "image": "http://dandiesmarshmallows.com/dandies-recipe/photos/smores-cannolis-3-thumb.jpg",
  "href": "http://dandiesmarshmallows.com/recipes/smores-cannolis",
  "extension": "Chrome",
  "firstAdded": "2016-07-06T23:43:45.237000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Who knew combining the flavors of S'mores and cannolis into one majestic treat would be insanely good?! I'll be honest, cannolis take a bit of effort to make, but the payoff is definitely worth it.",
    "Makes approximately 18-20 cannolis",
    "Instructions",
    "In a cup, mix together ground flax and 3 Tbsp water, and set aside. In a mixing bowl, cut margarine into the flour until it becomes crumbly. Stir in sugar and cinnamon. Slowly mix in wine, a few drops at a time. Add flax mixture. Mix until pastry holds together. If mixture appears too dry add a few more drops of wine. Roll pastry into a ball, cover and refrigerate for 1 hour. Divide dough into quarters. On a lightly floured surface begin rolling out dough as thin as possible. Take a piece of cardboard and cut into an oval shape about 4 inches long. Place cardboard on dough and cut out shape with a pizza cutter, or knife. Loosely wrap each oval around a cannoli form or metal tube. Brush the touching ends with non dairy milk and make sure they are firmly sealed. Deep fry in approximately 2 inches of vegetable oil at 400 degrees. Remove from oil when cannoli shell turns golden brown. Place on a cookie rack lined with a paper towel. Let the shells cool down a bit before removing the metal form. The shells must be completely cool before filling them!",
    "Filling",
    "In a microwave, heat up Dandies in 30 second intervals until fully melted. Let cool for a minute. In a mixing bowl, combine cream cheese, vanilla, powdered sugar, coconut cream and melted Dandies. Whip on high speed until marshmallow cream is fully mixed in with the other ingredients. Cover and refrigerate for at least 30 minutes before filling cannoli shells.",
    "Assembly",
    "In a microwave safe cup or bowl, melt chocolate chips in 30 second intervals, giving a quick stir between each one. Once melted, dip each end of the cannoli shells into the chocolate, and then into a the graham cracker crumbs. Place on a cookie rack and let chocolate harden. Transfer cream filling into a pastry bag. Fill each shell and dust with powdered sugar. Garnish with some additional chocolate chips, and enjoy!",
    "Recipe by Chelsie Jangord"
  ],
  "ingredients": [
    "0",
    "Cannoli Pastry",
    "3 Tbsp vegan margarine (we like Earth Balance)",
    "2 cups flour",
    "2 Tbsp sugar",
    "1/2 tsp cinnamon",
    "1/4 cup any cooking wine",
    "1 Tbsp ground flax",
    "3 Tbsp water",
    "Non-dairy milk",
    "2-3 cups vegetable oil",
    "Filling",
    "Dandies Mini Marshmallows or Dandies Marshmallows",
    "8oz vegan cream cheese",
    "1 can of coconut cream (refrigerate overnight, scoop the thick layer of coconut cream from the top, leaving the separated liquid)",
    "1 tsp vanilla",
    "1/2 cup to 3/4 cup powdered sugar - to taste",
    "Garnish",
    "1 cup vegan chocolate chips - melted",
    "8 graham crackers - crushed into crumbs"
  ],
  "__v": 1
}