{
  "hash": "a68bf8e6f03a639ce35f51d53484ab0a1a0584cf",
  "title": "CHOPPED CHICKPEA SALAD",
  "image": "https://api.norecipes.com/wp-content/uploads/2014/06/recipechopped-chickpea-salad.1024x1024.jpg",
  "href": "https://norecipes.com/chopped-chickpea-salad",
  "extension": "Chrome",
  "firstAdded": "2018-06-25T14:06:33.008000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Rinse the dried chickpeas well and soak them in plenty of water overnight.",
    "The next day, drain and rinse the chickpeas.",
    "In a pressure cooker over medium-high heat, add 1 tablespoon of oil, the carrot sticks, onion, and celery in a single layer and fry them undisturbed until browned on one side. Flip and brown the other side.",
    "Add drained chickpeas and then slowly add enough water to cover the chickpeas by 1-inch. Add the salt and then seal the lid, setting the pressure to high.",
    "Turn up the heat to high and let the cooker come up to full pressure (it should make a loud whistling noise). Set the timer for 15 minutes and then lower the heat so that you're getting a low steady whistle. If the whistling stops, just turn up the heat a bit.",
    "When the timer is up, turn off the heat and let the pressure drop naturally.",
    "When the pressure has dropped open the lid and discard the vegetables. Ideally you'll want to let the chickpeas cool in the liquid and soak overnight, but if you're in a hurry, you can cool the chickpeas quickly by putting the pot in a large bowl full of ice water for about 15 minutes.",
    "To make the dressing whisk together the olive oil, red wine vinegar, thyme, rosemary, garlic, lemon zest and salt.",
    "Roughly chop the chickpeas and add them to a bowl with the bell peppers, preserved lemons, olives, red onion, celery, parsley, sumac and dressing.",
    "Mix everything together and serve as a sandwich or salad."
  ],
  "ingredients": [
    "0",
    "For Chickpeas",
    "135 grams\tDried chick peas (~3/4 cup)",
    "1 tablespoon\tOlive oil",
    "0.5\tCarrot (cut into sticks)",
    "0.5 large\tOnion (cut into wedges)",
    "0.5 rib\tCelery (cut into sticks)",
    "1 teaspoon\tSalt",
    "For Dressing",
    "2 tablespoons\tOlive oil",
    "1 tablespoon\tRed wine vinegar",
    "1\tFresh thyme (minced)",
    "0.5 sprig\tFresh rosemary (minced)",
    "2 grams\tGarlic (~1 small clove, grated)",
    "1/2 teaspoon\tLemon zest",
    "1/4 teaspoon\tSalt",
    "For Salad",
    "1\tRoasted red bell pepper",
    "45 grams\tPreserved lemons (about 1/2 a lemon chopped)",
    "45 grams\tKalamata olives (pitted and chopped)",
    "30 grams\tRed onion (1/4 small onion)",
    "30 grams\tCelery (~1/2 rib, diced)",
    "13 grams\tFlat leaf parsley (~1/3 packed cup, minced)",
    "1 tablespoon\tSumac (optional)"
  ],
  "__v": 1
}