{
  "__v": 1,
  "directions": [
    "0",
    "For the donuts:",
    "In a bowl, sift together the cake flour, baking powder, salt, and nutmeg.",
    "In the bowl of a stand mixer fitted with a paddle attachment, beat the butter and sugar together until sandy. Add the egg yolks and mix until light and thick. Add the dry ingredients to the mixing bowl in 3 additions, alternating with the sour cream, ending with the flour. The dough will be sticky. Cover with plastic wrap and chill for 1 hour.",
    "On a floured surface, roll out the dough to about 1/2 inch thickness. Use a doughnut cutter or two differently sized biscuit cutters to cut out as many donuts as possible, dipping the cutters into flour as necessary to prevent sticking. You should get about 12 doughnuts and holes.",
    "Pour 2 inches of canola oil into a heavy bottomed pot with a deep-fry thermometer attached. Heat to 325°F. Fry the doughnuts a few at a time, being careful not to overcrowd the pot. Fry on each side about 2 minutes, being careful not to let them burn. Let drain on a paper bag to soak up the excess grease.",
    "FOR THE GLAZE:",
    "Mix all ingredients in a bowl with a whisk until smooth. Immerse each doughnut into the glaze. Place on a wire rack above a sheet pan to catch any excess glaze. Let sit for 20 minutes until glaze is set. Doughnuts are best served the day they are made but may be store in an air tight container at room temperature for a few days."
  ],
  "firstAdded": "2014-08-08T00:40:17.703000",
  "hash": "680ab72647398e02e38e1e990f6a97f5652f370d",
  "href": "http://www.handletheheat.com/old-fashioned-sour-cream-doughnuts/",
  "image": "http://www.handletheheat.com/wp-content/uploads/2014/05/Sour-Cream-Doughnuts-04.jpg",
  "ingredients": [
    "0",
    "2 1/4 cup (255 grams) cake flour",
    "1 1/2 teaspoons baking powder",
    "1 teaspoon salt",
    "1/2 teaspoon ground nutmeg",
    "1/2 cup sugar",
    "2 tablespoons butter, at room temperature",
    "2 large egg yolks",
    "1/2 cup sour cream",
    "Canola oil, for frying",
    "FOR THE GLAZE:",
    "3 1/2 cup (350 grams) powdered sugar, sifted",
    "1 1/2 teaspoons corn syrup",
    "1/4 teaspoon salt",
    "1/2 teaspoon vanilla extract",
    "1/3 cup hot water"
  ],
  "keywords": [
    "cake",
    "flour",
    "baking",
    "salt",
    "nutmeg",
    "sugar",
    "butter",
    "room",
    "egg",
    "yolks",
    "sour",
    "cream",
    "canola",
    "oil",
    "frying",
    "glaze",
    "sifted",
    "corn",
    "syrup",
    "vanilla",
    "hot",
    "water"
  ],
  "title": "Old-Fashioned Sour Cream Doughnuts",
  "users": [
    null
  ]
}