{
  "hash": "f17e5668a56f0c006c86eed2330c4b3a826905e9",
  "title": "Roasted Garlic and Herb No-Knead Bread",
  "image": "http://recipe-folder.com/img/recipe-images/035/747/446213235.gif",
  "href": "https://www.thekitchn.com/roasted-garlic-herb-no-knead-bread-22987118",
  "extension": "Chrome",
  "firstAdded": "2020-02-02T16:41:50.829000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Measure 3 cups all-purpose flour, 1 teaspoon kosher salt, and 3/4 teaspoon active dry yeast into a large bowl and stir to combine. Make a well in the flour mixture, add 1 1/2 cups warm water to the well, and stir until a rough, shaggy dough forms. Cover the bowl and let the dough rise in a warm place until doubled in bulk and bubbly, 6 to 8 hours. Meanwhile, roast the garlic.",
    "Arrange a rack in the middle of the oven and heat the oven to 400ºF. Remove the excess papery skins from 1 large head garlic and slice a thin layer off the top to expose the cloves. Wrap the garlic completely in aluminum foil and bake until tender, about 30 minutes. Let cool completely, then squeeze the roasted cloves out of their skins and reserve.",
    "Lightly flour a piece of parchment paper and turn the dough out onto it. Sprinkle the dough with the roasted garlic cloves, 1 tablespoon fresh thyme leaves, and 2 teaspoons finely chopped fresh rosemary leaves. Fold the dough over onto itself 4 times to incorporate the add ins. Flip the dough over and quickly shape it into a tight, round ball.",
    "Cover with a towel and let rise until nearly doubled in size, 1 to 1 1/2 hours. About 30 minutes before the dough is ready, arrange a rack in the middle of the oven, remove any racks above it, and heat the oven to 450°F. Place a large Dutch oven and its lid in the oven while it is heating.",
    "Remove the Dutch oven from the oven. Using the parchment paper as a sling, carefully transfer the dough into the Dutch oven. Quickly drizzle the loaf with 2 tablespoons olive oil and sprinkle with 1 teaspoon flaky salt.",
    "Cover the Dutch oven, place it back in the oven, and bake for 30 minutes. Uncover and bake until the top is browned, about 15 minutes more. Another way to know that the is bread ready is if an instant-read thermometer inserted into the top or side registers 210°F. Remove the Dutch oven from the oven and use the parchment paper to transfer the bread to a wire rack. Cool at least 15 minutes before slicing the bread."
  ],
  "ingredients": [
    "0",
    "3 cups all-purpose flour",
    "1 teaspoon kosher salt",
    "3/4 teaspoon active dry yeast",
    "1 1/2 cups warm water",
    "1 large head garlic",
    "1 tablespoon fresh thyme leaves",
    "2 teaspoons finely chopped fresh rosemary leaves",
    "2 tablespoons olive oil",
    "1 teaspoon flaky salt"
  ],
  "__v": 1
}