{
  "hash": "06dd97e2440b3979f651555eeb27ab8d47b44d47",
  "title": "Black-eyed Peas and Kale Soup",
  "image": "",
  "href": "http://nutritionstripped.com/black-eyed-peas-and-kale-soup/",
  "extension": "",
  "firstAdded": "2015-04-16T09:06:09.103000",
  "users": [
    null
  ],
  "keywords": [
    "blackeyed",
    "peas",
    "quarts",
    "stock",
    "organic",
    "kale",
    "carrots",
    "stalks",
    "celery",
    "onion",
    "garlic",
    "coconut",
    "oil",
    "rosemary",
    "sage",
    "cumin",
    "red",
    "pepper",
    "salt",
    "use",
    "black",
    "hot"
  ],
  "directions": [
    "0",
    "In a saucepan on medium heat, add coconut oil and onions and cook until softened. Add in celery, carrots, and garlic and cook until the mixture is nice and caramelized and cooked through (look for the onions to get slightly golden brown and reduced).",
    "Add spices, salt, and pepper to this mixture.",
    "In a large pot or crockpot (which is what I used), pour in vegetable stock, beans, and kale.",
    "Add the sauteed mixture of onions, carrots, celery into the Crockpot and let cook on \"high\" for 2 hours, stiring occasionally, and cooking for another 1-2 hours on \"warm\" or until the beans are cooked.",
    "If you're using a large pot on the stove, simply cook on medium heat for 2 hours or until the beans are nice and soft.",
    "Note: you have a lot of flexibility in the cooking process- if you enjoy your beans very cooked/very soft simply cook for much longer. If you like your vegetables and beans not as soft, cook for less time.",
    "Stir occasionally and taste test to find your happy medium.",
    "Enjoy!"
  ],
  "ingredients": [
    "0",
    "1 pound dried black-eyed peas",
    "2 quarts vegetable stock",
    "4 cups organic kale, chopped",
    "6 large carrots, chopped",
    "2 stalks of celery",
    "1 small onion, diced",
    "2 cloves garlic, minced",
    "2 tablespoons organic coconut oil",
    "1 teaspoon of dried rosemary",
    "1 teaspoon dried sage",
    "1 teaspoon cumin",
    "dash of red pepper flakes",
    "1 teaspoon sea salt (vegetable stock will have some salt in it- use this to taste)",
    "black pepper to taste",
    "Garnish with hot sauce"
  ],
  "__v": 1
}