{
  "hash": "8daba13a8ae60e88681d475355ffd0983f958aa9",
  "title": "One Pan Balsamic Chicken and Veggies",
  "image": "http://www.cookingclassy.com/wp-content/uploads/2015/02/one-pan-balsamic-chicken-and-veggies3-srgb..jpg",
  "href": "http://www.cookingclassy.com/2015/02/one-pan-balsamic-chicken-veggies/",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T20:40:48.741000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a mixing bowl whisk together salad dressing, balsamic vinegar, honey and red pepper flakes, set aside.",
    "Heat olive oil in a 12-inch skillet over medium-high heat. Season chicken with salt and pepper to taste, then place chicken evenly in skillet. Cook about 6 - 7 minutes, rotating once halfway through cooking, until chicken has cooked through (meanwhile, chop asparagus and tomatoes). Add half the dressing mixture to skillet and rotate chicken to evenly coat. Transfer chicken to a large plate or a serving platter while leaving sauce in skillet. Add asparagus and carrots to skillet, season with salt and pepper to taste and cook, stirring frequently, until crisp tender, about 4 minutes. Transfer veggies to plate or platter with chicken.",
    "Add remaining dressing mixture to skillet and cook, stirring constantly, until thickened, about 1 minute. Add tomatoes to chicken and veggies and drizzle dressing mixture in pan over top (or return chicken and veggies to pan and toss to coat).",
    "Recipe source: adapted from BHG"
  ],
  "ingredients": [
    "0",
    "1/4 cup + 2 Tbsp Italian salad dressing (I recommend using Kraft light Italian it's the perfect consistency for this and it's what I used)",
    "3 Tbsp balsamic vinegar",
    "1 1/2 Tbsp honey",
    "1/8 tsp crushed red pepper flakes (more or less to taste)",
    "1 1/4 lbs chicken breast tenderloins",
    "2 Tbsp olive oil",
    "Salt and freshly ground black pepper",
    "1 lb fresh asparagus, trimmed of tough ends, chopped into 2-inch pieces (look for thinner stalks. Green beans are another good option)",
    "1 1/2 cups matchstick carrots",
    "1 cup grape tomatoes, halved"
  ],
  "__v": 1
}