{
  "hash": "c6701846c6723741a0b693dd5eaa199fbbcbed7d",
  "title": "Juniper and Caraway Sauerkraut",
  "image": "http://2.bp.blogspot.com/-jZN_gLgZ3-s/T_-S5wlei-I/AAAAAAAABZ0/chovZxAXVhs/s640/P1050444.JPG",
  "href": "http://www.realfermenting.com/2012/07/juniper-and-caraway-sauerkraut.html",
  "extension": "",
  "firstAdded": "2015-09-27T16:44:12.389000",
  "users": [
    null
  ],
  "keywords": [
    "green",
    "cabbage",
    "roughly",
    "lbs",
    "juniper",
    "berries",
    "caraway",
    "seeds",
    "pacific",
    "salt"
  ],
  "directions": [
    "0",
    "Process",
    "This is a very similar process to the Basic Sauerkraut. I used a slightly smaller cabbage than before. It was a nice looking one, heavy for its volume (juicy), plus I have a little sauerkraut collection going in my fridge so I don't need too much. Hoping to be able to give some away this weekend.",
    "Grate the cabbage in a food processor and knead it in a wide bowl with the salt. You should knead away until your hands cramp up, and then take a break. Knead some more. You need a good amount of cabbage juice (water from the broken down cabbage cells) in the bottom of the bowl. Once the cabbage is starting to get soft and really giving up the juice, you can pour the whole lot into a wide mouth jar or crock. You just need something with enough room for the sauerkraut plus whatever you are going to use to hold the cabbage under the brine",
    "Stir the the juniper berries and caraway seeds and push down the sauerkraut until the brine comes over all the cabbage. You may need to return to the sauerkraut in a couple of hours to push it down again. Once the sauerkraut is submerged, cover the container with a breathable piece of material and set it somewhere out of the way.",
    "Check on the sauerkraut in about a week and every few days after that. It has only been taking a week or so recently for me, but it has been really hot. Whenever it reaches a sourness that is to your liking, go ahead and put it in the fridge. It'll keep for months at those cool temperatures."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "1 green cabbage (roughly 2lbs)",
    "6 juniper berries",
    "1 tsp caraway seeds",
    "1 tbsp Pacific sea salt"
  ],
  "__v": 1
}