{
  "hash": "25017c866967a9e1f5daf09f2800f9d1c7194ddb",
  "title": "The Best Cinnamon Rolls You'll Ever Eat",
  "image": "https://www.ambitiouskitchen.com/wp-content/uploads/2017/05/Monique-Cinnamon-Rolls-2-1.jpg",
  "href": "https://www.ambitiouskitchen.com/best-cinnamon-rolls/",
  "extension": "Chrome",
  "firstAdded": "2019-05-05T11:49:13.753000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add warm milk to the bowl of an electric mixer and sprinkle yeast on top. You’ll know your yeast has activated if it begins to foam after a few minutes. If it hasn’t, then start over; your milk was either too hot or too cold.",
    "Once yeast begins to foam, add in sugar, egg, egg yolk and butter. Mix until well combined. Next stir in flour and salt with a wooden spoon until a dough begins to form.",
    "Place dough hook on mixer and knead dough on medium speed for 8 minutes. Dough should form into a nice ball and be slightly sticky. (If you don’t want to use an electric mixer, you can use your hands to knead the dough for 8-10 minutes on a well-floured surface.)",
    "Transfer dough ball to a well oiled bowl, cover with plastic wrap and a warm towel. Allow dough to rise for 1 hour to 1 ½ hours, or until doubled in size.",
    "After dough has doubled in size, transfer dough to a well-floured surface and roll out into a 14x9 inch rectangle. Spread softened butter over dough, leaving a ¼ inch margin at the far side of the dough.",
    "In a small bowl, mix together brown sugar and cinnamon. Use your hands to sprinkle mixture over the buttered dough, then gently rub in into the butter a little. Tightly roll dough up, starting from the 9 inch side and place seam side down making sure to seal the edges of the dough as best you can. Cut into 1 inch sections with a serrated knife or floss. You should get 9 large pieces.",
    "Place cinnamon rolls in a greased 9x9 inch baking pan or round 9 inch cake pan. (I also recommend lining the pan with parchment paper as well, in case any of the filling ends up leaking out.) Cover with plastic wrap and a warm towel and let rise again for 30 minutes.",
    "Preheat oven to 350 degrees F. Remove plastic wrap and towel and bake cinnamon rolls for 20-25 minutes or until just slightly golden brown on the edges. You want to underbake them a little so they stay soft in the middle, that’s why we want them just slightly golden brown. Allow them to cool for a 5 minutes before frosting. Makes 9 cinnamon rolls.",
    "To make the frosting: In the bowl of an electric mixer, combine cream cheese, butter, powdered sugar and vanilla extract. Beat until smooth and fluffy. Spread over cinnamon rolls and serve immediately."
  ],
  "ingredients": [
    "0",
    "For the dough:",
    "¾ cup warm milk (110 degrees F)",
    "2 ¼ teaspoons active yeast (1/4-ounce package yeast)",
    "¼ cup granulated sugar",
    "1 egg plus 1 egg yolk, at room temperature",
    "¼ cup unsalted butter, melted",
    "3 cups bread flour",
    "3/4 teaspoon salt",
    "For the filling:",
    "2/3 cup dark brown sugar",
    "1 ½ tablespoons ground cinnamon",
    "¼ cup unsalted butter, softened",
    "For the cream cheese frosting:",
    "4 oz cream cheese, softened",
    "3 tablespoons unsalted butter, softened",
    "¾ cup powdered sugar",
    "½ teaspoon vanilla extract"
  ],
  "__v": 1
}