{
  "hash": "0537457a73c012f1fd18fe2546b69a6863248872",
  "title": "French Baguettes",
  "image": "https://www.monpetitfour.com/wp-content/uploads/2016/03/homemade-baguettes_5-copy-150x150.jpg",
  "href": "https://www.monpetitfour.com/french-baguettes/",
  "extension": "Chrome",
  "firstAdded": "2019-01-02T23:40:10.058000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "To a small bowl, add the active yeast. Follow with the warm water and give the mixture a gentle stir. Let this mixture rest for 5 minutes.",
    "Combine the yeast mixture with the rest of the ingredients (flour, salt, cold water) in the bowl of a stand mixer on low speed with the paddle attachment. Let the dough mix for approximately 1 minute. Let the dough rest for 5 minutes, then mix again on low speed for another 1 minute.",
    "Grease your work surface with some olive oil. Turn out the dough onto the oiled surface. Now, grab one end of the dough and stretch it out before bringing the flap in towards the center. Repeat this step for the remaining 3 sides of the dough to create a square pocket shape with a total of 4 flaps that have been folded into the center. Turn the dough over so that all the flaps are facing downward and the smooth side of the dough is facing upward. Let the dough rest for 10 minutes. Repeat this step with the stretching and folding, then 10 minute rest, 2 more times.",
    "Grease the mixing bowl with olive oil, then transfer the dough to the bowl. Cover the bowl with a sheet of plastic wrap; refrigerate the dough overnight. Note: Dough can be refrigerated for up to 4 days.",
    "The next day, place the covered bowl of dough out on the counter 1 hour prior to baking. After an hour, preheat the oven to 475°F. Now, very gently turn the dough out onto a greased work surface. You want to do this as carefully as possible so as to not disturb the bubbles in the dough. Gently shape the dough into a slight rectangle (just so that it's a little bit bigger than a square).",
    "Take a pizza cutter, and cut one strip of dough off the rectangle. Transfer the strip to a baking sheet or a baguette pan. Note: You should ideally end up with 3-4 baguettes (a couple of them can be smaller and the other two larger, or all of them can be medium sized - your choice!). If you can't fit all of the dough strips onto the baking sheet, then bake the ones you can and loosely cover the remaining dough with a sheet of plastic wrap while the other dough bakes. Sprinkle flour over your baguettes.",
    "Place your baking sheet into the oven on the middle rack. Bake the baguettes for 16 to 20 minutes until golden brown (baking time will depend on the size of the baguettes) and your type of oven. Throughout the baking process, use a spray bottle to spray water into the oven (in the space above the baguettes) every few minutes. Cool the baguettes on a wire cooling rack."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "4.5 cups bread flour plus more for dusting",
    "1.75 tsp salt",
    "1.5 tsp active yeast",
    "1/2 cup warm water 110°F",
    "1.5 cups iced cold water",
    "olive oil for greasing"
  ],
  "__v": 1
}