{
  "hash": "fc53e95c39870c24328fe552d3a50f71ff6cf6ef",
  "title": "Homemade English Muffins",
  "image": "",
  "href": "http://www.spoonforkbacon.com/2018/11/homemade-english-muffins/",
  "extension": "Chrome",
  "firstAdded": "2018-11-05T23:13:39.611000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "1. In a mixing bowl, combine 1/2 cup warm milk, sugar and yeast. Allow mixture to sit for about 10 minutes, until bubbling and foamy on top.",
    "2. Add remaining milk, 4 tablespoons melted butter, salt, and egg and stir together.",
    "3. Stir flour into yeast mixture, 1/2 cup at a time until dough comes together. Turn out onto a lightly floured and clean surface and knead until dough is smooth and elastic, roughly 8 to 10 minutes.",
    "4. Transfer dough to lightly greased and cover. Store dough in a warm place and allow to double in size, about 1 hour.",
    "5. Sprinkle all but 2 tablespoons cornmeal evenly onto a baking sheet.",
    "6. Turn dough out onto a lightly floured and clean surface and roll dough out until 1/2 inch thick. Using a 3.5” round cutter, cut out 10-12 (as many as you can get in one round of cutting) English muffins.",
    "7. Carefully transfer muffins to baking sheet lined with cornmeal, about 1 1/2 inches apart. Top each English muffin with a sprinkle of remaining cornmeal.",
    "8. Cover and allow muffins to rest, about 30 minutes.",
    "9. Place a griddle onto the stove over medium-low heat. Brush with 1 1/2 tablespoons butter and add half the English muffins.",
    "10. Cook each muffin for about 7 to 8 minutes or until golden brown on the bottom. Flip and continue to cook each muffin for 4 to 6 minutes, or until golden brown and just cooked through.",
    "11. Transfer English muffins to a cooling rack, wipe away any excess cornmeal from the griddle’s surface and repeat steps 9 and 10.",
    "12. To serve: Using a fork, crack an English muffin in half, toast and serve with soft salted butter, jam, honey, etc."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "1 1/2 cups warm milk, divided (100-110˚F)",
    "2 tablespoons sugar",
    "1 package (2 1/4 teaspoons) dry, active yeast",
    "7 tablespoons unsalted butter, melted and divided",
    "2 teaspoons salt",
    "1 large egg, beaten",
    "4 1/2 to 5 1/2 cups bread flour",
    "1/2 cup medium grind cornmeal"
  ],
  "__v": 1
}