{
  "hash": "47b6f07258482913d6f1e41b15ba8ae9e3a5f22f",
  "title": "How I Conquered Lady Cream Peas",
  "image": "http://katydid972.files.wordpress.com/2010/09/img_1988.jpg",
  "href": "http://austingastronomist.com/how-i-conquered-lady-cream-peas/",
  "extension": "Chrome",
  "firstAdded": "2015-08-28T13:10:02.455000",
  "users": [
    null
  ],
  "keywords": [
    "lady",
    "cream",
    "peas",
    "onion",
    "bell",
    "pepper",
    "jalapeno",
    "seeds",
    "ribs",
    "tomatoes",
    "garlic",
    "salt",
    "slices",
    "applewood",
    "bacon",
    "chicken",
    "veg",
    "stock",
    "water"
  ],
  "directions": [
    "0",
    "n a heavy-bottomed (hee hee) saucepan, cook the bacon over medium heat. (If no bacon, start with a Tbs. olive oil.) Once the bacon grease begins to render, add the garlic, onions, and peppers. Add tomatoes, stirring constantly, after the onions begin to turn translucent. Once all the veggies are tender, add the peas and enough stock or water to cover things. Bring the liquid to a boil and cover. Simmer, covered, for 30-60 minutes*, until beans are velvety, creamy, lady soft. Serve in a bowl with the cooking liquid and a wedge of skillet corn bread**.",
    "*FYI, I have noticed some slight differences in cooking time between the purple hull and lady cream peas, so watch out for that if you decide to get adventurous with yer cow pea varietals.",
    "**Lady Cream Peas NEED to be served with corn bread. Not any mushy fluffy crumbly boxed cornbread either. Dense, southern style skillet corn bread is best since it will soak up the delicious cooking liquid around the peas. Do not mess around with the cornbread/creampea symbiosis. Just make the cornbread while the peas cook or else you will regret it forever and ever. Or until the next time you make peas, whichever comes first.",
    "0 16"
  ],
  "ingredients": [
    "0",
    "About 1.5 cups fresh Lady Cream Peas",
    "1 onion, diced",
    "1 bell pepper, diced",
    "1 jalapeno pepper, seeds & ribs removed, diced",
    "2 tomatoes, chopped",
    "2 cloves garlic, minced",
    "salt and pepper",
    "4 slices thick cut applewood bacon, chopped (optional)",
    "about 2 cups of chicken or veg. stock or water"
  ],
  "__v": 1
}