{
  "hash": "8788157739d7894ea7e198d0e97c5fd190804248",
  "title": "Asparagus with Grapefruit \"Snow\" and Toasted Almonds",
  "image": "http://prodstatics3cdn1.tastingtable.com/images/articles/2013_05/SCS_CRE_xl_LB.jpg",
  "href": "http://www.tastingtable.com/entry_detail/chefs_recipes/13565/Asparagus_with_Grapefruit_Snow_and_Toasted_Almonds.htm",
  "firstAdded": "2015-01-20T19:39:45.704000",
  "users": [
    null
  ],
  "keywords": [
    "grapefruit",
    "almonds",
    "ice",
    "mediumthick",
    "asparagus",
    "spears",
    "kosher",
    "salt",
    "extravirgin",
    "olive",
    "oil",
    "flaky",
    "pinches"
  ],
  "directions": [
    "0",
    "Preheat the oven to 350°. On a cutting board, place the:",
    "Slice off the two ends of the grapefruit. Stand the grapefruit upright and slice off the rind from top to bottom, exposing the flesh and slicing away the bitter white pith. Hold the grapefruit in your hand or on a cutting board and slice between the membranes to release the segments. Place half of the segments on a small plate or parchment-paper-lined baking sheet so that the segments aren't touching, and freeze until the grapefruit is completely frozen, at least 30 minutes (if freezing longer than 1 hour, cover the grapefruit with plastic wrap before freezing).",
    "2. To a rimmed sheet pan, add the:",
    "Toast the almonds until they are golden, 4 to 5 minutes. Transfer the almonds to a large plate and set aside to cool.",
    "3. To a large bowl, add the:",
    "Cover the ice with cold water. Fill a large pot with water and bring to a boil. On the cutting board, place the:",
    "Use a paring knife to slice away the tough ends. Use a vegetable peeler to peel each spear up to about ½ inch below the base of the tip. Add the peeled asparagus to the boiling water along with the:",
    "Cook the asparagus for 20 seconds or until just tender, then use a slotted spoon, frying spider or tongs to transfer the asparagus to the bowl of ice water. Chill the asparagus for 2 minutes, then transfer to a kitchen-towel-lined plate to drain.",
    "4. Place the asparagus on a large plate. Drizzle the asparagus with the:",
    "Sprinkle with the:",
    "Remove the grapefruit segments from the freezer. Using a box grater or a Microplane-style grater, grate the grapefruit over the asparagus. Serve immediately, sprinkled with the:"
  ],
  "ingredients": [
    "0",
    "Large grapefruit, 1",
    "Sliced almonds, 2 tablespoons",
    "Ice, 2 cups",
    "Medium-thick asparagus spears, 10",
    "Kosher salt, ¼ teaspoon",
    "Extra-virgin olive oil, 2 tablespoons",
    "Flaky salt, 2 pinches"
  ],
  "__v": 1
}