{
  "hash": "1f5a41828a24c41b247e2f242ab435923b78e126",
  "title": "ONE POT SPICY EGGS AND POTATOES",
  "image": "http://dagzhsfg97k4.cloudfront.net/wp-content/uploads/One-Pot-Spicy-Eggs-and-Potatoes-with-Goat-Cheese-3.jpg",
  "href": "http://pinchofyum.com/one-pot-spicy-eggs-and-potatoes",
  "extension": "Chrome",
  "firstAdded": "2015-04-26T21:31:15.015000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "divided",
    "white",
    "onion",
    "roughly",
    "garlic",
    "ancho",
    "chili",
    "salt",
    "chicken",
    "broth",
    "tomatoes",
    "eggs",
    "klondike",
    "golden",
    "baby",
    "potatoes",
    "kale",
    "goat",
    "cheese"
  ],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "SAUCE: Heat one tablespoon oil in a deep pot over medium heat. Add the onions and saute until very soft. Add the garlic, salt, two teaspoons of the ancho chili powder, vegetable broth, and tomatoes. Simmer for 10-15 minutes. Transfer to a blender and puree until smooth.",
    "POTATOES: In the same pot that the sauce was in, heat the remaining one tablespoon oil over medium heat. Add the potatoes and remaining one teaspoon of ancho chili powder. Saute the potatoes for a few minutes until browned out the outside. Add the sauce back to the pot (be careful - it might splatter if it's too hot) and simmer for another 10 minutes to cook the potatoes.",
    "EGGS AND KALE: Stir in the kale. Use a spoon to make little holes for the eggs on top of the sauce. Crack the eggs directly into the warm sauce and cover. With the heat on low (sauce barely bubbling) and the cover on, cook the eggs for 10 minutes. Remove from heat and keep cover on for another 5 minutes. This should give you medium-soft yolks. Leave the cover on as much as possible during this time so that heat does not escape - I found it easiest to just shake the pan lightly to check the doneness of the eggs (if they jiggle a lot, they're probably not done). Top with goat cheese and serve with crusty bread for sopping up that sauce.",
    "NOTES",
    "This serves four, but that's sort of awkward since there are six eggs. I just found that sometimes I'd want two eggs and sometimes I wanted just one, so usually it worked up to about four servings total."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "2 tablespoons olive oil, divided",
    "½ white onion, roughly chopped",
    "3 cloves garlic, minced",
    "3 teaspoons ancho chili powder, divided",
    "1 teaspoon salt",
    "½ cup chicken or vegetable broth",
    "1 28 ounce can tomatoes (can be diced or whole)",
    "5-6 eggs",
    "1 cup diced potatoes (like those little Klondike golden baby potatoes)",
    "2 cups kale, chopped finely",
    "4 ounces goat cheese"
  ],
  "__v": 1
}