{
  "hash": "fa72dfddb71f2dc2c147db7285cdc5e8c9542cef",
  "title": "Creamy Lemon Garlic Instant Pot Chicken Breasts",
  "image": "https://nitrocdn.com/QpRITogWwpubMNxcBLCqtUiSkQNrcUhi/assets/static/optimized/rev-d940ecb/wp-content/uploads/2018/03/Instant-Pot-creamy-lemon-garlic-chicken-breasts-3.jpg",
  "href": "https://sweetpeasandsaffron.com/instant-pot-creamy-lemon-chicken-breasts/",
  "extension": "Firefox",
  "firstAdded": "2020-04-20T19:13:56.383000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Combine all ingredients in a 6 quart Instant Pot (unless listed as 'after reducing sauce').",
    "Cook on high pressure for 8 minutes (for average 7 oz chicken breasts). Release the pressure when the Instant Pot beeps (quick pressure release).",
    "Using a pair of tongs, carefully remove the chicken from the Instant Pot and allow to rest while you reduce the sauce.",
    "Reduce the sauce: select 'sautee' on the Instant Pot, and simmer, stirring occasionally, for 7-10 minutes.",
    "When roughly 1/3 of a cup of the sauce remains (and you start to see the bottom of the IP as you stir), stir in the parmesan cheese, cream, and lemon (for the lemon garlic chicken only). Stir until cheese is melted and sauce is heated through (but not boiling), and remove the pot from the Instant Pot base using oven mitts.",
    "Spoon the sauce over chicken breast, rice and veggies.",
    "To prepare freezer pack:",
    "Combine all ingredients in a gallon freezer bag (unless listed as 'after reducing sauce').",
    "Squeeze out as much air as possible. Freeze for up to 3 months.",
    "Thaw completely before cooking as instructed above."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 boneless skinless chicken breasts roughly 1 lb",
    "1/2 teaspoon dried oregano",
    "1/2 teaspoon dried basil",
    "1/4 teaspoon red pepper flakes",
    "4 cloves garlic minced",
    "1 cup chicken stock",
    "AFTER REDUCING SAUCE:",
    "2 tablespoons lemon juice",
    "1/4 cup parmesan cheese freshly grated",
    "3/4 cup heavy cream aka: whipping cream for Canadians"
  ],
  "__v": 1
}