{
  "hash": "cf9c18634e1ffcd6b98732560a2b0e22b44ae20c",
  "title": "Magic 5 Cookies, Holiday Edition",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2016/11/white-chocolate-cranberry-pecan-oatmeal-cookies-6.jpg",
  "href": "https://sallysbakingaddiction.com/2016/11/30/white-chocolate-cranberry-pecan-oatmeal-cookies/",
  "extension": "Chrome",
  "firstAdded": "2018-10-09T17:44:41.505000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Whisk the flour, baking soda, cinnamon, salt, and oats together. Set aside.",
    "Using a hand mixer or a stand mixer fitted with paddle attachment, cream the butter, brown sugar, and granulated sugar together on medium speed until smooth, about 2 minutes. Add the eggs and beat on high until combined, about 1 minute. Scrape down the sides and bottom of the bowl as needed. Add the vanilla and molasses and mix on high until combined.",
    "Add the dry ingredients to the wet ingredients and mix on low until combined. With the mixer running on low speed, add the white chocolate, dried cranberries, coconut, and pecans. Dough will be thick, yet very sticky. Chill the dough for 1 hour in the refrigerator (and up to 2-3 days). If chilling for longer than a few hours, though, allow to sit at room temperature for at least 30 minutes before rolling and baking because the dough will be quite hard and the cookies may not spread.",
    "Preheat oven to 350°F (177°C). Line two large baking sheets with parchment paper or silicone baking mats. (Always recommended for cookies.) Set aside.",
    "Roll balls of dough (about 1.5 tablespoons of dough per cookie) and place 2 inches apart on the baking sheets. Bake for 10-11 minutes until very lightly browned on the sides. The centers will look very soft.",
    "Remove from the oven and let cool on baking sheet for 5 minutes before transferring to a wire rack to cool completely. While the cookies are still warm, I like to press a few more white chocolate chips into the tops-- this is only for looks!"
  ],
  "ingredients": [
    "0",
    "1 and 1/2 cups (190g) all-purpose flour (spoon & leveled)",
    "1 teaspoon baking soda",
    "1 teaspoon ground cinnamon",
    "1/2 teaspoon salt",
    "3 cups (240g) old-fashioned rolled oats",
    "1 cup (230g) unsalted butter, softened to room temperature",
    "1 cup (200g) packed light or dark brown sugar",
    "1/4 cup (50g) granulated sugar",
    "2 large eggs, room temperature",
    "2 teaspoons pure vanilla extract",
    "1 Tablespoon molasses (optional, see post above)",
    "1/2 cup each: white chocolate chips (90g), dried cranberries (60g), sweetened shredded coconut (40g), chopped pecans (64g)"
  ],
  "__v": 1
}