{
  "hash": "5a7f171cfab0f91d169f44277322aab7efae0b23",
  "title": "How to Make Cabbage Rolls {Recipe & Video}",
  "image": "http://seemomclick.com/wp-content/uploads/2014/07/How-to-Make-Cabbage-Rolls-Recipe-200x300.jpg",
  "href": "http://seemomclick.com/how-to-make-cabbage-rolls-recipe-video/",
  "extension": "Firefox",
  "firstAdded": "2015-04-19T17:51:22.275000",
  "users": [
    null
  ],
  "keywords": [
    "head",
    "cabbage",
    "beef",
    "pork",
    "use",
    "tomato",
    "divided",
    "onion",
    "uncooked",
    "rice",
    "blend",
    "white",
    "brown",
    "wild",
    "red",
    "good",
    "tblsp",
    "parsley",
    "salt",
    "dill",
    "weed",
    "cayenne",
    "pepper",
    "tomatoes",
    "undrained",
    "soup",
    "sugar"
  ],
  "directions": [
    "0",
    "In a large pot cook whole head of cabbage in 3-4\" of boiling water for 4 minutes or until you see outer leaves wilting. Take cabbage out of pot and let cool for a few minutes.",
    "Carefully use a knife and cut 12 outer leaves away from cabbage: Cut from the stem edge and gingerly (so you don't tear the tender leaves) remove the leaves to a large baking sheet to cool. Cut a V out of the thick vein from the bottom of each reserved leaf. (Look in the video to see what the leaves look like after this is cut out to get a better idea.) Set remaining cabbage aside to use later in this dish.",
    "In a small bowl, combine the meat, ½ cup tomato sauce, onion, rice, parsley, salt, dill and cayenne. Mix well.",
    "Place about 2-3 tblsp. meat mixture on each cabbage leaf, overlap cut end. Roll up completely to enclose filling.",
    "Slice the remaining cabbage and in the bottom of a large pot (dutch oven or I used a 9\"x13\" pan) make a bed of cabbage and arrange the cabbage rolls on top seam side down. Combine the canned tomatoes, tomato soup, remaining tomato sauce and sugar. Pour over cabbage rolls.You can put more cabbage leaves on top if you have some left over.",
    "Cover and bake at 350 degrees for 1½ - 2 hours or until meat thermometer reads 160 degrees. Makes 12 cabbage rolls."
  ],
  "ingredients": [
    "0",
    "1 head cabbage",
    "½ lb. ground beef",
    "½ lb. ground pork OR use 1 lb. ground beef",
    "1-15oz can tomato sauce, divided",
    "1 small onion, chopped fine",
    "½ cup uncooked rice (A rice blend of white, brown, wild and red is very good in this.)",
    "1 tblsp. dried parsley flakes",
    "½ tsp. salt",
    "½ tsp. dill weed",
    "⅛ tsp. cayenne pepper",
    "1-14½oz. can diced tomatoes, undrained",
    "1 can of tomato soup",
    "1 tsp. sugar"
  ],
  "__v": 1
}