{
  "hash": "be2a075c2ca6f7599231b411cb42c96acc181360",
  "title": "A killer mac 'n' cheese",
  "image": "http://s3-eu-west-1.amazonaws.com/jamieoliverprod/_int/rdb2/upload/9_1_1408627661_lrg.jpg",
  "href": "http://www.jamieoliver.com/recipes/pasta-recipes/a-killer-mac-n-cheese/",
  "firstAdded": "2015-01-04T23:53:20.302000",
  "users": [
    null
  ],
  "keywords": [
    "salt",
    "black",
    "pepper",
    "butter",
    "heaped",
    "plain",
    "flour",
    "garlic",
    "bay",
    "leaves",
    "litre",
    "semiskimmed",
    "milk",
    "macaroni",
    "tomatoes",
    "cheddar",
    "cheese",
    "parmesan",
    "sprigs",
    "thyme",
    "picked",
    "splashes",
    "worcestershire",
    "grating",
    "nutmeg",
    "breadcrumbs",
    "olive",
    "oil"
  ],
  "directions": [
    "0",
    "Get a large pan of salted water on the boil. Melt the butter in a large ovenproof saucepan over a low heat, then add the flour and turn the heat up to medium, stirring all the time, until you get a paste – this is your roux. Add all the sliced garlic – don't worry about the amount because each slice will caramelise like toffee in the roux. Keep cooking and stirring until golden and the garlic is nice and sticky. Add the bay leaves and slowly whisk in the milk a little at a time to ensure you get a nice smooth sauce. Bring the mixture to the boil, then leave it on a low heat to simmer and tick away, stirring occasionally. Preheat your oven to 220ºC/425ºF/gas 7.",
    "Add the pasta to the pan of boiling salted water and cook according to the packet instructions. Meanwhile, roughly chop the tomatoes on a board and season them well with salt and pepper. Drain the pasta and add it immediately to the sauce. Give it a good stir and take the pan off the heat. Stir in your grated cheeses, chopped tomatoes and thyme leaves. A little Worcestershire sauce added now is nice, and so is a little grating or two of nutmeg. Now work on the flavour – taste it and season it until it's hitting the right spot. You want it to be slightly too wet because it will thicken up again in the oven, so add a splash of water if needed.",
    "If you've made your sauce in an ovenproof casserole-type pan, leave everything in there; if not, transfer it to a deep earthenware dish. Bake it for 30 minutes in the oven, until golden, bubbling, crispy and delicious.",
    "While it's cooking, put your breadcrumbs and thyme into a pan with a few drizzles of olive oil over a medium heat. Stir and toss the crumbs around until crunchy and golden all over. Remove from the heat and tip into a nice bowl. Serve your macaroni cheese in the centre of the table, with your bowl of crispy breadcrumbs for sprinkling over, and a lovely green salad.",
    "Wine suggestion:",
    "dry Italian white – a good Pinot Grigio"
  ],
  "ingredients": [
    "0",
    "sea salt",
    "freshly ground black pepper",
    "45 g butter",
    "3 heaped tablespoons plain flour",
    "10 cloves garlic, peeled and finely sliced",
    "6 bay leaves",
    "1 litre semi-skimmed milk",
    "600 g dried macaroni",
    "8 tomatoes",
    "150 g Cheddar cheese, freshly grated",
    "100 g Parmesan cheese, freshly grated",
    "a few sprigs fresh thyme, leaves picked",
    "2 splashes Worcestershire sauce, optional",
    "1 grating nutmeg, optional",
    "3 big handfuls fresh breadcrumbs",
    "olive oil"
  ],
  "__v": 1
}