{
  "hash": "64353653a1289e90d95f3426401a53dc7f22b67b",
  "title": "Fish Cakes With Herbs and Chiles",
  "image": "",
  "href": "http://cooking.nytimes.com/recipes/1017091-fish-cakes-with-herbs-and-chiles?em_pos=medium&emc=edit_ck_20151101&nl=cooking&nlid=67012804",
  "extension": "Firefox",
  "firstAdded": "2015-11-04T16:04:24.281000",
  "users": [
    null
  ],
  "keywords": [
    "olive",
    "oil",
    "frying",
    "garlic",
    "smashed",
    "firm",
    "white",
    "fish",
    "fillets",
    "hake",
    "black",
    "bass",
    "flounder",
    "kosher",
    "salt",
    "needed",
    "pepper",
    "dry",
    "vermouth",
    "wine",
    "russet",
    "potatoes",
    "eggs",
    "roughly",
    "cilantro",
    "basil",
    "scallion",
    "green",
    "parts",
    "serrano",
    "chile",
    "seeded",
    "cayenne",
    "zest",
    "lime",
    "panko",
    "bread",
    "crumbs",
    "allpurpose",
    "flour",
    "pickle",
    "lemon",
    "mayonnaise",
    "wedges"
  ],
  "directions": [
    "0",
    "In a large skillet over medium heat, heat olive oil. Add garlic and cook until golden brown at the edges, about 2 minutes.",
    "Season fish with 1 teaspoon salt and the pepper, add to pan and let cook for 1 minute. Add vermouth and 2 tablespoons water. Turn heat to low, cover and cook until fish is just barely cooked through, 8 to 10 minutes. Move fish to a plate, keeping any liquid and garlic in skillet.",
    "In the same skillet over high heat, add potatoes, remaining 1/2 teaspoon salt and water to just cover. Bring to a boil, reduce to simmer, cover and cook until tender, about 15 minutes.",
    "Flake fish. Drain potatoes and garlic, and place in a large bowl. Roughly mash potatoes and garlic, then add flaked fish, eggs, cilantro, basil, scallion, chile, cayenne, lime zest and panko, and combine. Season with salt if needed. Cover and chill for at least 3 hours.",
    "Place flour on a plate. Form generous 1/4 cup fish patties about 1/2 inch thick. Dip patties into flour to lightly coat each side.",
    "In a large, preferably nonstick skillet, heat 1/8 inch of olive oil over medium heat. Cook fish cakes until golden brown, about 5 to 8 minutes each side, adding more oil as needed. Move to a paper-towel-lined plate.",
    "If using lime pickle or preserved lemon, stir into mayonnaise. Serve fish cakes with the mayonnaise (with or without pickles) and lime wedges."
  ],
  "ingredients": [
    "0",
    "2 tablespoons olive oil, more for frying",
    "2 garlic cloves, smashed and peeled",
    "1 pound firm white fish fillets, such as hake, black sea bass or flounder",
    "1 ½ teaspoons kosher salt, more as needed",
    "¼ teaspoon black pepper",
    "2 tablespoons dry vermouth or white wine",
    "1 pound russet potatoes, peeled and thinly sliced (2 cups)",
    "2 eggs",
    "3 tablespoons roughly chopped cilantro",
    "3 tablespoons roughly chopped basil",
    "1 scallion, white and green parts, finely chopped",
    "1 serrano chile, seeded and minced",
    "Pinch cayenne",
    "Finely grated zest of 1 small lime",
    "⅓ cup panko bread crumbs",
    "½ cup all-purpose flour",
    "3 tablespoons chopped lime pickle or preserved lemon (optional)",
    "½ cup mayonnaise",
    "Lime wedges, for serving"
  ],
  "__v": 3
}