{
  "__v": 1,
  "directions": [
    "0",
    "Preheat oven to 350. 2.Generously butter a 9-inch glass pie plate and arrange the plums cut side down, cutting into smaller pieces to fit as necessary in the middle. 3.In a small saucepan combine the granulated sugar with the rosemary sprigs and 1/3 cup water and cook over medium high heat until it turns a golden amber color, about 10 minutes. Swirl the pan occasionally without stirring. 4.While the caramel sauce is cooking, make your batter. Cream the butter with brown sugar for 3 minutes. On low speed add the eggs one by one. Add the yogurt, lemon zest, and almond extract and mix until combined. 5.Whisk the flour, baking powder, and salt together. Slowly add to the batter on low speed and mix until just incorporated. 6.When your caramel is done, discard the rosemary and pour evenly over the plums. Top the plums with the cake batter and spread to the edge. 7.Bake for 35-45 minutes until the cake is golden and a toothpick in the center comes out clean. 8.Let cool for 15 minutes and then invert the cake onto a large plate. 9.Slice and serve with a dollop of sour cream if the spirit moves you."
  ],
  "firstAdded": "2014-05-10T01:05:31.263000",
  "hash": "a20dbaa5c80d9eb4f474cb2f351d9f624106ef94",
  "href": "http://www.sweetpaulmag.com/food/rosemary-scented-plum-cake?A=SearchResult&SearchID=2979249&ObjectID=4383184&ObjectType=35",
  "image": "http://www.sweetpaulmag.com/1EatContent/images/2012/4383184_281272_Plum1.jpg?Action=thumbnail&Width=512&Height=640&algorithm=fill",
  "ingredients": [
    "0",
    "5-6 ripe red plums, cut in half and pitted",
    "1 cup sugar",
    "3 sprigs rosemary",
    "6 T butter, at room temp",
    "¾ cup brown sugar",
    "2 large eggs",
    "1/3 Greek yogurt",
    "zest of one lemon",
    "½ t almond extract",
    "1 cup plus 2 T flour",
    "½ t baking powder",
    "¼ t salt"
  ],
  "keywords": [
    "red",
    "plums",
    "sugar",
    "sprigs",
    "rosemary",
    "butter",
    "room",
    "temp",
    "brown",
    "eggs",
    "greek",
    "yogurt",
    "zest",
    "lemon",
    "almond",
    "flour",
    "baking",
    "salt"
  ],
  "title": "ROSEMARY SCENTED PLUM CAKE",
  "users": [
    null
  ]
}