{
  "__v": 1,
  "directions": [
    "0",
    "Method",
    "1. First you need to soften up your octopus. You do this simply by freezing it and then thawing; this breaks down the toughness in the cellular structure of the flesh.",
    "2. In a very large pan, simmer the octopus in unsalted water on a medium/low heat with the fennel, onion, celery and parsley stalks until tender enough to push a fork easily through the flesh. This should take no more than one hour.",
    "3. Remove the octopus from the cooking water and allow it to cool. Cut the cooked and cooled octopus into bite-sized pieces, discarding the eyes, beak and mush inside the head. Remove the skin. Rinse the cut pieces in clean water.",
    "4. Cut the peeled potatoes into bite-sized pieces, put into a pan of water, bring to the boil and then simmer until cooked. Be careful not to overcook – they should not disintegrate. Drain and set aside.",
    "5. In a large mixing bowl, gently combine the octopus and potatoes with the garlic, parsley and chilli flakes. Season with salt and pepper and dress with olive oil and lemon juice.",
    "6. Transfer the dressed octopus to a large serving plate and cover with clingfilm. When you are ready to serve, put the dish in the microwave on full for 30 seconds so that the potatoes and octopus gain a little warmth."
  ],
  "firstAdded": "2014-06-26T10:46:05.330000",
  "hash": "fb835eef5811238aef9aa919c8788ba91385311e",
  "href": "http://www.redonline.co.uk/food/recipes/octopus-salad",
  "image": "http://assets.redonline.co.uk/var/ezflow_site/storage/images/media/banners/article-banners/food/recipe-pics/octopus-salad/4115664-1-eng-GB/octopus-salad_article_banner_img.jpg",
  "ingredients": [
    "0",
    "Serves: 4",
    "Preparation time: 20 minutes",
    "Cooking time: 1 hour",
    "You will need",
    "1 medium octopus (1 ½ - 2kg) 1 fennel bulb, cut in half 2 celery stalks, cut roughly 1 handful of parsley stalks, roughly chopped 3 medium waxed potatoes, peeled 1 garlic clove, finely chopped 1 handful of flat parsley leaves, chopped 1 tsp chilli flakes Flaky sea salt and black pepper 4 tbsp extra virgin olive oil 1 tbsp lemon juice"
  ],
  "keywords": [
    "serves",
    "preparation",
    "time",
    "minutes",
    "cooking",
    "hour",
    "need",
    "octopus",
    "fennel",
    "bulb",
    "celery",
    "stalks",
    "roughly",
    "medium",
    "waxed",
    "potatoes",
    "garlic",
    "clove",
    "flat",
    "parsley",
    "leaves",
    "chilli",
    "flaky",
    "salt",
    "black",
    "pepper",
    "extra",
    "virgin",
    "olive",
    "oil",
    "lemon",
    "juice"
  ],
  "title": "Warm octopus salad",
  "users": [
    null
  ]
}