{
  "hash": "444b2f3bedcaa3c87328a44669bb2f85a7299b0e",
  "title": "Ginger Steak Salad",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2014/9/29/0/WU0907_Ginger-Steak-Salad_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/ree-drummond/ginger-steak-salad.html",
  "extension": "Chrome",
  "firstAdded": "2016-07-16T23:23:40.577000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the steak and marinade: Combine the soy sauce, sherry, brown sugar and garlic in a resealable plastic bag. Mix together, place the steak in the bag and seal. Marinate for 5 minutes (or up to 2 hours if you have time).",
    "For the salad dressing: Combine the olive oil, soy sauce, ginger, lime juice, granulated sugar, garlic and jalapenos in a small bowl.",
    "Heat a grill pan over medium-high heat. When hot, brush it with the olive oil. Remove the steak from the marinade, letting any excess drain off, and cook to medium rare on the grill pan, about 1 1/2 minutes per side. Transfer the steak to a plate, allowing it to cool slightly.",
    "For the salad: In a bowl, toss the salad greens, tomatoes and half of the green onions with about three-quarters of the salad dressing.",
    "Place the steak on a cutting board and slice thinly, then pour the juices from the plate over the top of the steak. Mound the tossed salad on a serving plate, then arrange the sliced steak on top. Pour the remaining salad dressing over the top. Sprinkle the remaining green onions over the salad and serve.",
    "Recipe courtesy of Ree Drummond"
  ],
  "ingredients": [
    "0",
    "2 tablespoons soy sauce",
    "1 tablespoon sherry",
    "2 teaspoons brown sugar",
    "2 cloves garlic, minced",
    "1 rib eye, strip or sirloin steak",
    "2 tablespoons olive oil",
    "2 tablespoons soy sauce",
    "1 tablespoon minced fresh ginger",
    "1 tablespoon lime juice",
    "1 tablespoon granulated sugar",
    "2 cloves garlic, finely diced",
    "1/2 jalapeno, seeded and diced",
    "8 ounces salad greens (baby lettuce, endive, radicchio, etc.)",
    "1 cup cherry tomatoes",
    "2 green onions, sliced"
  ],
  "__v": 1
}