{
  "hash": "0b79f1feee95dbcc1c11850667fe87ff98460b98",
  "title": "Basil and Walnut Pesto Quiche [Vegan, Gluten-Free]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2015/04/quiche.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/basil-and-walnut-pesto-quiche/",
  "extension": "Chrome",
  "firstAdded": "2015-05-19T18:33:56.122000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "potatoes",
    "walnuts",
    "avocado",
    "basil",
    "stems",
    "garlic",
    "eggs",
    "chia",
    "seeds",
    "combined",
    "water",
    "juice",
    "lemon",
    "olive",
    "oil",
    "black",
    "olives",
    "kale",
    "tough",
    "chives",
    "sunflower",
    "asparagus",
    "spears",
    "tomatoes",
    "poppy"
  ],
  "directions": [
    "0",
    "Preheat the oven to 400°F.",
    "Make the chia eggs and set aside.",
    "Thinly slice the potatoes and add them to a pan of boiling water. Cook for 5 minutes, until just soft (be careful not to overcook them, you want the slices to remain intact). Drain and leave to cool in a colander.",
    "To make the pesto, begin by blitzing the walnuts in a food processor until coarsely ground. To this, add the avocado, basil, garlic, chia eggs, lemon juice and 1 tbsp of olive oil. Process until you have a smooth and creamy consistency.",
    "Transfer to a large bowl and stir in the olives, kale, chives and sunflower seeds. Season with lots of black pepper.",
    "Next, coat a foil-lined cake tin or flan dish with the remaining olive oil and arrange the potato slices to form a crust. I start by covering the base, then cut a straight edge on the slices for the sides of the tin, to help them stand up more evenly.",
    "Pour in the quiche filling and press down evenly with a spoon.",
    "Arrange the asparagus spears and tomatoes as you wish, pressing down gently, and sprinkle the top with poppy seeds.",
    "Cook on a middle shelf for 40 minutes. Once cooked, leave to stand for 10 minutes before removing from the tin, so that the filling has a chance to set."
  ],
  "ingredients": [
    "0",
    "2 medium potatoes",
    "2 1/2 ounces walnuts",
    "1 avocado",
    "1 ounce fresh basil (including stems)",
    "3 cloves garlic",
    "2 chia eggs (2 tbsp chia seeds combined with 5 tbsp water)",
    "Juice of ½ lemon",
    "1 tbsp olive oil + 1 tsp",
    "10 black olives, pitted and chopped",
    "3 ounces kale, chopped, tough stems removed",
    "1/2 ounce fresh chives, chopped",
    "2 tbsp sunflower seeds",
    "6 asparagus spears",
    "3-4 small tomatoes",
    "1 tbsp poppy seeds"
  ],
  "__v": 1
}