{
  "hash": "c8d9528839c63b98f5380fca726aec4e7bef83a5",
  "title": "Banana Walnut Bread",
  "image": "http://foodnetwork.sndimg.com/content/dam/images/food/fullset/2011/5/27/0/CC_Banana-Walnut-Bread_s4x3.jpg.rend.sni12col.landscape.jpeg",
  "href": "http://www.foodnetwork.com/recipes/food-network-kitchens/banana-walnut-bread-recipe.print.html",
  "extension": "Chrome",
  "firstAdded": "2015-03-09T04:37:35.503000",
  "users": [
    null
  ],
  "keywords": [
    "unbleached",
    "allpurpose",
    "flour",
    "baking",
    "soda",
    "salt",
    "eggs",
    "room",
    "vanilla",
    "unsalted",
    "butter",
    "greasing",
    "pan",
    "sugar",
    "bananas",
    "mashed",
    "fork",
    "walnut",
    "pieces"
  ],
  "directions": [
    "0",
    "Sift the flour, baking soda and salt into a medium bowl and set aside. Whisk the eggs and vanilla together in a liquid measuring cup with a spout and set aside. Lightly brush a 9- by 5- by 3-inch loaf pan with butter. Preheat the oven to 350 degrees F.",
    "Cream the butter and sugar in a stand mixer fitted with the paddle attachment (or with a hand-held mixer) until light and fluffy. Gradually pour the egg mixture into the butter, while mixing, until incorporated. Add the bananas (the mixture will appear to be curdled, so don't worry), and remove the bowl from the mixer.",
    "With a rubber spatula, mix in the flour mixture until just incorporated. Fold in the nuts and transfer the batter to the prepared pan. Bake until a toothpick inserted into the center of the bread comes out clean, about 55 minutes. Cool the bread in the pan on a rack for 5 minutes. Turn the bread out of the pan and let cool completely on the rack. Wrap in plastic wrap. The banana bread is best if served the next day.",
    "***Banana bread is easy to make-just a few simple steps-and irresistible to eat. We recommend making a few extra loaves, wrapping in plastic, and freezing. Thaw at room temperature for an hour and you'll have fresh banana bread ready to go by the time everyone wakes up. Freezing individual slices works well, too."
  ],
  "ingredients": [
    "0",
    "1 1/4 cups unbleached all-purpose flour",
    "1 teaspoon baking soda",
    "1/2 teaspoon fine salt",
    "2 large eggs, at room temperature",
    "1/2 teaspoon pure vanilla extract",
    "1 stick unsalted butter, at room temperature, plus more for greasing the pan",
    "1 cup sugar",
    "3 very ripe bananas, peeled and mashed with a fork (about 1 cup)",
    "1/2 cup toasted walnut pieces"
  ],
  "__v": 4
}