{
  "hash": "09270a693565cc2fa4f5c307722c03a24d2eb077",
  "title": "Instant Pot® Chicken and Mushrooms with Gravy",
  "image": "https://images.media-allrecipes.com/userphotos/560x315/6301202.jpg",
  "href": "https://www.allrecipes.com/recipe/269980/instant-pot-chicken-and-mushrooms-with-gravy/?internalSource=recipe%20hub&referringId=22882&referringContentType=Recipe%20Hub&clickId=cardslot%20209",
  "extension": "Chrome",
  "firstAdded": "2019-03-09T20:15:28.362000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Turn on a multi-functional pressure cooker (such as Instant Pot(R)) and select Saute function. Add 2 tablespoons butter and olive oil. Add onion and salt; stir occasionally until onion starts to brown.",
    "Meanwhile, grease a skillet with 1 tablespoon butter and heat over high heat. Add chicken breasts and cook until browned, about 3 minutes per side.",
    "Switch pressure cooker to Warm function. Pour in chicken stock and stir the pot to release any bits stuck on the bottom. Add mushrooms, ranch seasoning, steak sauce, Worcestershire sauce, and pepper. Stir until combined. Place chicken breasts on top, with a small pat of butter on each chicken breast.",
    "Close and lock the lid. Select high pressure according to manufacturer's instructions; set timer for 6 minutes. Allow 10 to 15 minutes for pressure to build.",
    "Release pressure using the natural-release method according to manufacturer's instructions, about 25 minutes. Transfer chicken breasts and mushrooms to a serving dish. Select Saute function to boil liquid in the pot.",
    "Heat remaining 2 tablespoons butter in a saucepan over low heat. Stir in flour until a smooth, thick paste forms, 2 to 3 minutes. Whisk into the liquid in the pot and cook until thickened, 2 to 3 minutes. Adjust seasoning as desired and pour chicken and mushrooms."
  ],
  "ingredients": [
    "0",
    "6 tablespoons unsalted butter, divided",
    "1 tablespoon extra-virgin olive oil",
    "1 onion, diced",
    "1 pinch salt",
    "3 large boneless, skinless chicken breasts, trimmed of fat",
    "1/4 cup chicken stock, or more to taste",
    "1",
    "1 (16 ounce) package baby bella mushrooms, halved",
    "1 tablespoon ranch seasoning mix",
    "1 teaspoon steak sauce, or more to taste",
    "1 teaspoon Worcestershire sauce, or more to taste",
    "1 pinch freshly ground black pepper",
    "2 tablespoons all-purpose flour"
  ],
  "__v": 1
}