{
  "hash": "af7d8e12d5ce93adb084cd4de19bfaefb90e4276",
  "title": "Eggplant Meatball Casserole",
  "image": "http://www.marthastewart.com/sites/files/marthastewart.com/styles/wmax-520-highdpi/public/d31/eggplant-meatballs-0004-d112283/eggplant-meatballs-0004-d112283_vert.jpg?itok=h-9GXgnF",
  "href": "http://www.marthastewart.com/1122026/eggplant-meatball-casserole?socsrc=facebook_20160620_496566161_Food",
  "extension": "Chrome",
  "firstAdded": "2016-07-06T18:14:25.619000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees. Sprinkle the eggplant slices with salt, place in a single layer around a colander set over a bowl, and let stand for 30 minutes. Rinse eggplant, drain, and squeeze dry, pressing out excess moisture and patting with paper towel. Removing excess moisture helps make it easier to roll the balls.",
    "Meanwhile, spread 1 1/3 cup breadcrumbs in a single layer on a rimmed baking sheet. Bake until dried and just turning golden, 5 minutes. Let cool.",
    "Heat 1 tablespoon oil in a 10 inch cast iron skillet over medium-high heat. Add half the eggplant in a single layer; cook, flipping one time, about 5 minutes. Transfer to colander. Repeat adding another tablespoon of oil and second half of eggplant. If pan gets too hot, adjust heat. Wipe out pan. Let eggplant cool slightly in colander.",
    "Transfer eggplant to a food processor, discarding any extra juices that drained out. Add toasted breadcrumbs, Parmesan, and minced garlic. Pulse until mixture is a chunky paste, about 6 pulses. Transfer to a bowl. Season with salt and pepper. Stir in egg white. Chill until cold, about 30 minutes. Form mixture into 12 balls, coating the outsides with remaining breadcrumbs to help shape the balls. Chill at least 1 hour until firmer and cold and up to overnight. Best results with an overnight chill.",
    "Preheat oven to 425 degrees. Heat 2 tablespoons oil in a 10 inch enameled cast iron casserole or cast iron skillet over medium-high. Add meatballs working in two batches; cook, turning carefully with a spoon to help retain shape, until browned all over, about 6 to 7 minutes. If pan gets too hot, adjust heat. Transfer to a plate. Add remaining tablespoon oil and sliced garlic; stir until fragrant, 30 seconds. Add tomatoes, a large pinch of red pepper flakes, and 1/2 teaspoon coarse salt; bring to a boil. Return meatballs to pan; spooning sauce over to coat. Bake until sauce is slightly thickened, 18 minutes. Remove casserole from oven. Set oven to broil. Top each meatball with a piece of mozzarella; return to oven. Broil until cheese is bubbly and golden in spots, about 3 to 4 minutes."
  ],
  "ingredients": [
    "0",
    "1 eggplant (1 pound), stemmed and cut in 4 3/4-inch planks",
    "Coarse salt and freshly ground pepper",
    "2 1/3 cups fresh breadcrumbs, preferably from a hearty Italian loaf",
    "1/4 cup extra-virgin olive oilPompeian Olive Oil Extra Virgin$4.49 thru 07/12",
    "1/2 cup grated Parmesan cheese (1 1/2 ounces)",
    "1 small garlic clove, minced plus 2 cloves thinly sliced",
    "1 large egg white",
    "1 can (28 ounce) whole plum tomatoes, pulsed in food processor",
    "Red pepper flakes",
    "4 ounces mozzarella cheese, sliced into 12 thin squares"
  ],
  "__v": 1
}