{
  "hash": "f2eb1e13abb5c19aa805e6abdf5253336877c38f",
  "title": "Rose Petal Granola",
  "image": "http://www.101cookbooks.com/mt-static/images/food/arctic_rose_granola_recipe_3.jpg",
  "href": "http://www.101cookbooks.com/archives/rose-petal-granola-recipe.html",
  "extension": "Chrome",
  "firstAdded": "2016-12-05T12:57:07.611000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 300 F / 120 C degrees with racks in the top and bottom thirds of the oven. Set out two rimmed baking sheets.",
    "Combine the oats, walnuts, salt, pepper, currants and half of the rose petals in a large mixing bowl. Heat the butter in a small saucepan over low heat and stir in the honey. Remove from heat and whisk in the rose water. When thoroughly combined, pour the honey mixture over the oat mixture and stir until everything is well coated, at least 30 seconds. If you like a clumpier granola, stir in the egg white. Divide the mixture equally between the two baking sheets and spread into a thin layer.",
    "Bake, stirring a couple times along the way, for about 35 to 40 minutes, or until the granola is toasty and deeply golden. You may want to rotate the pan once, top to bottom, to ensure even baking. Avoid using the bottom shelf.",
    "Remove from the oven and press down on the granola with a metal spatula-you'll get more clumps this way. Let cool completely, sprinkle with the remaining dried rose petals, then store in an airtight container at room temperature.",
    "Makes about 7 cups.",
    "Print Recipe"
  ],
  "ingredients": [
    "0",
    "4 cups / 14 oz / 400 g rolled oats",
    "1 1/2 cups / 6 oz / 170 g walnut halves",
    "1/2 teaspoon fine-grain sea salt",
    "1/8 teaspoon freshly ground pepper",
    "2/3 cup / 3 oz / 85 g dried currants",
    "dried petals from a dozen (or so) small roses",
    "1/2 cup / 4 oz unsalted butter",
    "1/2 cup / 120 ml honey",
    "1/2 teaspoon rose water",
    "1 egg white (large egg), optional"
  ],
  "__v": 3
}