{
  "hash": "c4f360a0093e29437c87641cd82fa955bdf43d16",
  "title": "Tarta czekoladowa na francuskim cieście",
  "image": "http://kuchniaprzemka.blog.pl/files/2015/10/image1-225x300.jpg",
  "href": "http://kuchniaprzemka.blog.pl/2015/10/07/tarta-czekoladowa-na-francuskim-ciescie/",
  "extension": "",
  "firstAdded": "2016-09-17T13:14:48.446000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Wykonanie:",
    "Formę do tarty (śr. 25-30cm) smarujemy masłem.",
    "Rozwijamy ciasto francuskie i wylepiamy nim dno i boki formy. Następnie nakłuwamy gęsto widelcem, na ciasto kładziemy papier do pieczenia i obciążamy specjalnymi kulkami lub np. fasolą.",
    "Wkładamy do piekarnika nagrzanego do 200 stopni Celsjusza i podpiekamy około 15 minut.",
    "Po tym czasie usuwamy papier i dopiekamy ciasto do zrumienienia. Studzimy.",
    "Genasz czekoladowy:",
    "Śmietankę zagotowujemy w rondelku.",
    "Czekoladę łamiemy na kawałki i do tak rozdrobnionej czekolady wlewamy gorącą śmietankę. Mieszamy do całkowitego rozpuszczenia i odstawiamy aby masa lekko przestygła.",
    "Po ostygnięciu krem czekoladowy wylewamy na podpieczony spód tarty.",
    "Krem kakaowy:",
    "Serek mascarpone miksujemy z cukrem pudrem, kakao i wanilią.",
    "Śmietankę ubijamy na sztywno i łączymy z utartym serkiem.",
    "Tak przygotowany krem wykładamy na zastygnięty ganasz czekoladowy i całość wkładamy do lodówki na minimum 2 godziny.",
    "Przed podaniem opruszamy obficie ciemnym kakao.",
    "Teraz pozostało nam rozkoszować się cudownym smakiem czekolady."
  ],
  "ingredients": [
    "0",
    "Dzisiaj zapraszam na przepis dla amatorów czekolady, a będzie to rozpływająca się w ustach i bardzo czekoladowa tarta.",
    "Postanowiłem przygotować ten deser w nieco inny sposób niż standardowo, mianowicie zastąpiłem ciasto kruche ciastem francuskim.",
    "Pomysł ten zrodził się w mojej głowie kiedy to pewnego dnia miałem ogromną ochotę na coś czekoladowego i bardzo kalorycznego ale nie miałem wiele czasu na kucharzenie.",
    "W ten oto sposób powstał przepis na tą bardzo prostą w wykonaniu ale jakże pyszną tartę czekoladową.",
    "Zapraszam Was do przepisu a następnie do kuchni ;)",
    "Składniki:",
    "Opakowanie ciasta francuskiego",
    "350ml śmietanki 30%",
    "200g czekolady gorzkiej 60-90% (można opcjonalnie użyć czekolady deserowej lub mlecznej, pamiętajmy tylko iż nasz deser będzie zdecydowanie słodszy)",
    "100g serka mascarpone",
    "250ml śmietanki 30%",
    "2 łyżki cukru pudru",
    "Łyżeczka ekstraktu waniliowego",
    "2 łyżki ciemnego kakao (dodatkowo łyżka do opruszenia tarty"
  ],
  "__v": 1
}