{
  "hash": "30736153aeb8b22f41c139120f30a4079f27600a",
  "title": "Sweet Potato Pie with Pecan Crust",
  "image": "http://www.recipage.com/images/user274/1321729033/recipe_image.jpg",
  "href": "http://adashofsoul.com/2011/11/06/sweet-potato-pie-with-pecan-crust/",
  "extension": "Chrome",
  "firstAdded": "2017-08-14T18:59:29.845000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Peel the sweet potatoes and cut them into chunks. Boil the chunks in a large pot of water for 30 minutes, or until the potatoes are tender.",
    "Drain the potatoes and mash them well with a potato masher. Cover with saran wrap and set aside.",
    "In a blender or food processor, chop up the nuts just until the largest pieces are pea-sized.",
    "Stir the remaining crust ingredients into the ground nuts until well combined.",
    "Press the nuts into the bottom and sides of either a 9-inch pie pan or a 8-inch springform pan (the springform pan won’t need to use all the crust mixture).",
    "Place the crusted pan in the refrigerator for at least 15 minutes.",
    "Bake the crust in a 350 degree oven for 10 minutes to toast the nuts.",
    "While the crust is baking, blend the mashed sweet potatoes with an electric mixer until very smooth.",
    "Add the remaining filling ingredients and continue to blend until the mixture is very smooth and creamy.",
    "When the crust is done, remove it from the oven and then raise the oven temperature to 400 degrees.",
    "Pour the filling into the crust and return it to the oven to bake for about 45 minutes, or until the top of the pie is lightly browned and the pie does not jiggle around when you move it.",
    "Remove the pie from the oven and let it cool on a rack."
  ],
  "ingredients": [
    "0",
    "2 c. raw pecan halves",
    "2 T. melted coconut oil",
    "2 T. agave nectar",
    "1/4 t. cinnamon",
    "1/4 t. salt",
    "2 large sweet potatoes (enough for 2 1/2-3 c. of flesh)",
    "3 eggs, at room temperature",
    "1 c. evaporated skim milk",
    "1 c. brown sugar (not packed)",
    "1 t. cinnamon",
    "1/4 t. nutmeg",
    "1/4 t. salt",
    "dash of allspice",
    "dash of ginger"
  ],
  "__v": 1
}