{
  "hash": "af159c0de4308d81f95a3f83eede81c6c0464436",
  "title": "Low-Carb Thai Curry",
  "image": "http://low-carb-support.com/wp-content/uploads/2012/09/curry_300.jpg",
  "href": "http://low-carb-support.com/thai-curry-low-carb/",
  "extension": "Chrome",
  "firstAdded": "2016-06-21T11:08:11.988000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Method",
    "Roughly chop all ingredients for the curry paste and blitz them together with coconut milk in a blender",
    "Heat some oil in a wok or a large pan, add the paste and fry for about 3-5 minutes",
    "Add stock and spices and bring to the boil",
    "If using vegetables, add them now",
    "If using meat/poultry",
    "Quickly brown cubed meat or poultry in a frying pan and add to the curry",
    "Simmer for about 45-60 minutes, or until meat is cooked through",
    "If using fish",
    "Fish will need less time to cook – let the curry sauce simmer on its own for about 30 minutes, then add fish for another 15-20 minutes or so.",
    "If using prawns",
    "Prawns will need less time still – raw prawns will need about 5-7 minutes, cooked prawns about 2-3 minutes, so let the sauce simmer by itself for 30-40 minutes or so, and then add them in the very end",
    "Once your protein ingredient is cooked",
    "Add lime juice and fish sauce (if using) and remove curry from heat",
    "Leave to cool for 10-15 minutes before serving",
    "Exact carb count will depend on the vegetables you choose. If you are on a very low-carb plan, remember to also count carbs in garlic, ginger and chillies – they do add up."
  ],
  "ingredients": [
    "0",
    "Curry paste",
    "1 shallot or 1/2 red onion",
    "4-5 cloves of garlic",
    "Thumb-size piece of galangal or ginger",
    "3-4 stalks of lemongrass",
    "1 can of coconut milk or coconut cream – check that it is unsweetened",
    "2-5 chillies (depending on how hot you would like it!) – green for green curry, red (fresh or dried) for red or yellow curry",
    "Optional for green curry – kafir lime leaves",
    "Optional for red curry – 1 tsp tomato ketchup or tomato puree",
    "Main ingredients",
    "1lb or so of protein food – anything really – beef, lamb, chicken, turkey, fish, prawns – whatever you fancy, on its own or combined. I often use a combination of chicken and prawns in the same dish (as on the photograph)",
    "1 cup of stock – beef, chicken, fish, vegetable – whatever goes with your chosen protein as above",
    "1/2lb of vegetables – traditional choices would be bell peppers, tomatoes, aubergines and mushrooms. You can also add cauliflower to make up for the absence of potatoes.",
    "Herbs, spices and condiments",
    "1 tsp ground cumin",
    "1 tsp ground coriander",
    "Fresh lime juice (use 1/2 lime)",
    "Yellow curry only – 2 tsp turmeric",
    "1 tbsp fish sauce – use a sugar-free version if you can find one. If not, you can substitute with several salted anchovies or 1tsp anchovy paste."
  ],
  "__v": 1
}