{
  "hash": "9004f9c17622837e167c9fe393161ab3caa05100",
  "title": "CROCK-POT LOW CARB KETO TACO CASSEROLE",
  "image": "https://www.wholesomeyum.com/wp-content/uploads/2019/10/wholesomeyum-crock-pot-low-carb-keto-taco-casserole-recipe-1-150x150.jpg",
  "href": "https://www.wholesomeyum.com/crock-pot-keto-taco-casserole-recipe/",
  "extension": "Chrome",
  "firstAdded": "2020-02-26T17:14:17.462000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large saute pan, heat avocado oil over medium-high heat. Add the ground beef. Cook, breaking apart with a spatula, for 8-10 minutes, until browned.",
    "Add the water and taco seasoning. Bring to a boil, then simmer for a 2-5 minutes, until it thickens and taco meat forms.",
    "Transfer the beef to the 7 QT Crock-Pot Cook & Carry Easy Clean Slow Cooker. Add the diced peppers, onions, and drained diced tomatoes with green chiles. Mix everything together.",
    "Cover the slow cooker with the lid and cook for 4 hours on Low or 2-3 hours on High. At this point you can take your Crock-Pot Cook & Carry anywhere you need to (use the side latches to seal the lid), and just plug it in to keep it warm when you get there.",
    "Right before serving, stir the casserole. (You can spoon out any excess liquid that may have accumulated, but there shouldn't be much if you drained the tomatoes well.) Set the Crock-Pot slow cooker to High and sprinkle shredded cheese on top. Cover and cook for about 5 minutes, until the cheese melts.",
    "Top your casserole with any toppings you like, such as lettuce, tomatoes, avocados and/or cilantro."
  ],
  "ingredients": [
    "0",
    "1 tbsp Avocado oil",
    "2 lb Ground beef",
    "3/4 cup Water",
    "1/4 cup Taco seasoning",
    "2 large Bell peppers (diced; use orange or yellow for color variety)",
    "1/4 large Onion (diced)",
    "2 10-oz cans Diced tomatoes with green chiles (drained very well - push down when draining; see note on less spicy alternative*)",
    "1 cup Cheddar cheese"
  ],
  "__v": 1
}