{
  "hash": "af558fbcb5927c85b350375c814498f151769011",
  "title": "Zingerman’s Mac and Chees",
  "image": "",
  "href": "https://www.metroparent.com/daily/food-home/kid-friendly-recipes/macaroni-cheese-recipe-zingermans/",
  "extension": "Chrome",
  "firstAdded": "2020-03-20T22:23:56.849000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Bring a large pot of water to a boil. Add 1 to 2 tablespoons salt and the pasta and stir well. Cook for about 13 minutes (if using Martelli) or until the pasta is done. Drain it and set it aside.",
    "Meanwhile, melt the butter for the sauce in a large heavy-bottomed pot over medium-high heat (be careful not to scorch the butter). Add the onion and bay leaf and saute until the onion is soft, about 5 minutes.",
    "Remove the bay leaf. Add the flour and cook for a minute or so, stirring constantly.",
    "Slowly add the milk, a little at a time, stirring constantly to avoid lumping. When the flour and milk have been completely combined, stir in the cream. Keep the mixture at a gentle simmer (not at a high boil) until it thickens, 2 to 3 minutes.",
    "Reduce the heat to medium. Stir in the mustard, cheddar cheese and salt. Simmer for 5 minutes and set aside.",
    "In a heavy bottom skillet, over medium-high heat, get the pan very hot. Add olive oil and, when it begins to smoke, add the cheese sauce and drained cooked noodles. Toss thoroughly and continue to cook, stirring occasionally until you have approximately 15 percent of the mixture golden brown.",
    "Taste and adjust the seasonings if necessary. Remove from heat."
  ],
  "ingredients": [
    "0",
    "1 lb. macaroni",
    "2 Tbsp. butter",
    "1/4 cup diced onion",
    "1 bay leaf",
    "2 Tbsp. all-purpose flour",
    "1 1/2 cups whole milk",
    "1/4 cup heavy cream",
    "1 tsp. Dijon mustard",
    "1 lb. grated raw milk cheddar cheese (Zingerman’s uses two-year-old raw milk cheddar from Grafton Village)",
    "2 tsp. olive oil",
    "Coarse sea salt"
  ],
  "__v": 1
}