{
  "hash": "8b2cbf382784eecfffaa37e0c74ba7f285e3970a",
  "title": "Cauliflower Pepita Chia Crust topped with herbed Beans, peppers and onions",
  "image": "http://www.veganricha.com/wp-content/uploads/2014/06/cauliflower-crust-pizza-0989.jpg",
  "href": "http://www.veganricha.com/2014/06/cauliflower-pepita-chia-crust-with.html",
  "extension": "",
  "firstAdded": "2015-09-23T10:50:10.565000",
  "users": [
    null
  ],
  "keywords": [
    "cauliflower",
    "pepita",
    "chia",
    "crust",
    "topped",
    "herbed",
    "beans",
    "peppers",
    "onions",
    "allergen",
    "information",
    "free",
    "egg",
    "corn",
    "soy",
    "gluten",
    "yeastfree",
    "omitting",
    "nutritional",
    "yeast",
    "oilfree",
    "makes",
    "seeds",
    "flaxmeal",
    "water",
    "head",
    "loaded",
    "florets",
    "pumpkin",
    "use",
    "sunflower",
    "hemp",
    "garlic",
    "thyme",
    "rosemary",
    "extra",
    "virgin",
    "olive",
    "oil"
  ],
  "directions": [
    "0",
    "Toppings:",
    "Pizza sauce/thick marinara or thick white garlic sauce",
    "red onion slices",
    "roasted red peppers",
    "daiya cheese shreds",
    "White Bean Topping",
    "1 15 oz can great northern beans or 1.5 cups cooked beans",
    "2 tsp nutritional yeast",
    "1/4 tsp salt",
    "1/2 tsp dried basil",
    "1/2 tsp fresh thyme",
    "1 tsp lemon juice",
    "Method:",
    "Mix the chia and flax into the water and let sit in the fridge for 30 minutes. Mix again after 15 minutes to redistribute.",
    "Preheat the oven to 425 degrees F.",
    "Pulse the pumpkin seeds into coarse meal in the food processor, add cauliflower and pulse.",
    "Remove from the processor and put the cauliflower pepita mix on a parchment lined sheet. Spread the grated cauliflower mixture and bake for 7 minutes.",
    "Remove from the oven and transfer to a bowl. Cool slightly. Add the chia flax gel to the mix. Add garlic, thyme, rosemary, olive oil and mix well. It should become a soft textured dough.",
    "Press the mix into a 1/4 inch thick crust (8-9 inches) inch crust on a parchment lined sheet. Pack it well.",
    "Bake for 30 to 35 minutes or until the crust is golden and the center is not soft to touch. (bake time depends on the moisture content). Turn the sheet around after 20 minutes. Spray water on the edges so they don’t over brown.",
    "Cool slightly. Add marinara or other vegan cheese sauce, onions, beans, peppers, cheese, or other toppings of choice. For the herbed beans, mix all the ingredients under white bean topping and add to the pizza.",
    "Bake again for 10 -15 minutes. Sprinkle salt and pepper. Cool for 5 minutes before slicing. Serve immediately. do not store.",
    "If the crust starts to brown too quickly, reduce the temperature to 375 and cook until done.",
    "Use any of my vegan cheese recipes as topping.",
    "I am testing the crust here. You might want to add slightly dryer sauce and less heavy toppings so the crust can stay sturdy. This one handles all those beans just fine, but will get soft as it sits for long. The moisture cannot escape because of the heavy toppings. For sturdier and predictable crusts, make this into smaller crusts. Or add some vegan cheese shreds to the cauliflower mixture before shaping into a crust. If there is too much moisture in the cauliflower dough, add some flour(oat/chickpea).",
    "11",
    "189",
    "2",
    "2.67k"
  ],
  "ingredients": [
    "0",
    "Cauliflower Pepita Chia Crust topped with herbed Beans, peppers and onions",
    "Allergen Information: Free of Dairy, egg, corn, soy, gluten, grain. Can be made yeast-free by omitting nutritional yeast. can be made oil-free.",
    "Makes 1 9 inch crust",
    "Ingredients:",
    "3 Tbsp chia seeds",
    "1 Tbsp flaxmeal",
    "1/2 cup water",
    "1/2 head of cauliflower (2.5 loaded cups of florets)",
    "1/4 cup pumpkin seeds (or use sunflower or hemp)",
    "1/2 tsp garlic powder",
    "1/2 tsp thyme",
    "1/2 tsp rosemary",
    "2 tsp extra virgin olive oil"
  ],
  "__v": 1
}