{
  "hash": "5b6271824e9fcedd4d6c39a0524817bf3c3d99ac",
  "title": "Peri Peri Sauce for Portugese Chicken",
  "image": "http://www.rockrecipes.com/wp-content/uploads/2016/06/DSC_0026-1.jpg",
  "href": "http://www.rockrecipes.com/peri-peri-sauce/",
  "extension": "Chrome",
  "firstAdded": "2017-04-11T23:27:11.685000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Start by roasting the red peppers and onions. This can be done on a gas grill, under the broiler or on a cast iron grill pan. You want to get good char marks on the outside of the peppers and onions. Don't worry if they are not fully cooked, they will get fully cooked in the sauce.",
    "Chop the peppers and onions and add them to a food processor or blender. You can us an immersion blender if that is all you have on hand, just take the time to get the ingredients well pureed.",
    "Add the garlic, lemon juice, red wine vinegar, lemon zest, red Thai chilis, smoked paprika, oregano, salt and pepper to the food processor with the grilled onions and peppers and puree until smooth.",
    "Transfer the sauce to a medium saucepan, add the bay leaves and simmer slowly for 20-30 minutes.",
    "Let the sauce cool to warm. Remove the bay leaves then return the sauce to the food processor again.",
    "Add the additional lemon juice, red wine vinegar and lemon zest. Puree for another few minutes until very smooth. Slowly add in the olive oil in a thin stream as the processor is running.",
    "Recipe Notes",
    "To make Peri Peri Chicken, brush a little of the sauce onto all sides of the chicken you are using. You can use bone in, skin on chicken or boneless skinless chicken. Place the chicken pieces in a glass dish and cover with plastic wrap.Let the chicken marinate for several hours or overnight.",
    "Grill over low heat on a glass grill until fully cooked, brushing on additional sauce in the last five to ten minutes of cook time. Serve with extra sauce for dipping at the table."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 large red bell peppers char grilled",
    "1 large red onion char grilled",
    "4 cloves garlic minced",
    "1/2 cup lemon juice",
    "1/4 cup red wine vinegar or apple cider vinegar",
    "zest of one lemon finely grated",
    "10 small red Thai chilis roughly chopped (more to taste for hotter sauce)",
    "1 1/2 tsp smoked paprika or plain paprika",
    "1 1/2 tsp dried oregano",
    "1 1/2 tsp kosher salt",
    "1 tsp black pepper",
    "2 leaves bay",
    "To finish the sauce (when cooked)",
    "1/4 cup lemon juice",
    "zest of one lemon finely minced",
    "1/4 cup red wine vinegar or apple cider vinegar",
    "1/2 cup extra virgin olive oil"
  ],
  "__v": 1
}