{
  "hash": "b767b1f96c784df7925da115ad547bfcb4bc107d",
  "title": "SOPES (THICK MEXICAN CORN CAKES)",
  "image": "https://www.isabeleats.com/wp-content/uploads/2016/02/authentic-mexican-sopes-1.jpg",
  "href": "https://www.isabeleats.com/authentic-3-ingredient-mexican-sopes-thick-corn-cakes/",
  "extension": "Chrome",
  "firstAdded": "2018-12-06T04:13:02.571000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl, mix masa harina and salt together.",
    "Pour 2 1/4 cups of the warm water and mix together to form a ball of dough. The dough should be firm and springy when touched, not dry or super sticky. Add more water in small amounts, if needed, until the dough is the right consistency.",
    "Divide the dough into 16 small balls and cover them with a damp paper towel to keep them from drying out.",
    "Preheat a nonstick griddle over medium-high heat.",
    "To form the sopes, grab a ball of dough and flatten it in between two pieces of parchment paper or a cut plastic gallon-sized food storage bag (as seen in my video) using a tortilla press. If you don't have a tortilla press, do your best to form a circle using a regular rolling pin.",
    "Gently remove the flattened dough from the parchment paper and cook on the hot griddle for about 1 minute, depending on how hot the surface of the griddle is. You want the sope to have beautiful brown marks.",
    "Flip the sope over and cook for another 30 seconds to 1 minute.",
    "Remove the sope and let it cool for about 30 seconds. When the sope is cool enough to handle (it should still be hot but manageable), pinch the edges using your thumb and index finger to create a little boat.",
    "Cover the sope with a towel and repeat steps 5-8 until all the sopes have been formed.",
    "Top the sopes with desired toppings (think beans, cheese, ground beef, shredded chicken, veggies, salsa) and enjoy!"
  ],
  "ingredients": [
    "0",
    "3 cups masa harina",
    "2 1/2 cups warm water",
    "1 1/2 tsp salt"
  ],
  "__v": 1
}