{
  "hash": "5786b66fa0245e54274e17c00fcd1104c47937b0",
  "title": "Cheesy Baked Pumpkin Pasta With Kale",
  "image": "https://static01.nyt.com/images/2018/10/01/dining/sj-baked-pumpkin-pasta-horizontal/merlin_144070671_cd6ad036-b8b3-489c-acc5-e2889bf69d2d-articleLarge.jpg",
  "href": "https://cooking.nytimes.com/recipes/1019598-cheesy-baked-pumpkin-pasta-with-kale?te=1&nl=cooking&emc=edit_fwd_20191227?campaign_id=90&instance_id=14830&segment_id=19905&user_id=4264688f24592aeeb06433e5d96d7150&regi_id=7985911420191227",
  "extension": "Firefox",
  "firstAdded": "2019-12-29T21:40:12.277000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat oven to 500 degrees and butter a shallow 2-quart/9-by-13-inch baking dish. Bring a large pot of salted water to a boil.",
    "Cook the pasta in the boiling water for 4 minutes, adding the kale for the last minute. Drain the pasta and kale, rinse under cold water, then transfer to a large bowl along with the red-pepper flakes and the chopped herbs.",
    "In a blender, add the pumpkin, garlic, salt, pepper, cream and vegetable broth. Blend until smooth. (If you don’t want to use a blender, add the pumpkin, salt and pepper to a large bowl and use a spoon to break it up into a smooth mixture. Slowly whisk in the cream and vegetable broth until mixture is smooth, then grate in the garlic.) Add the sauce to the bowl with the pasta. Add in most of the grated cheese, reserving about 1/2 cup, and stir to coat.",
    "Transfer the pasta into the baking dish, then dollop the ricotta over top and sprinkle remaining grated cheese. Bake for 10 to 15 minutes, until brown and bubbly. If you want the pasta really browned, broil it for 3 to 5 minutes, watching carefully. Allow the dish to cool for 5 to 10 minutes, and garnish with additional chopped herbs before serving."
  ],
  "ingredients": [
    "0",
    "Butter, for greasing the pan",
    "1",
    "pound medium pasta shells or tubes, like conchiglie rigate or penne",
    "1",
    "bunch kale (about 1 pound), ribs removed, chopped into bite-size pieces",
    "½",
    "teaspoon red-pepper flakes",
    "1",
    "heaping tablespoon chopped fresh rosemary, plus more for garnish",
    "1",
    "heaping tablespoon chopped fresh thyme, plus more for garnish",
    "About 1 heaping cup coarsely grated Parmesan",
    "About 1 heaping cup coarsely grated Gruyère",
    "About 1 heaping cup coarsely grated Fontina or mozzarella",
    "1",
    "(15-ounce) can pumpkin purée",
    "2",
    "garlic cloves, peeled",
    "1",
    "teaspoon kosher salt, plus more for pasta water",
    "½",
    "teaspoon black pepper",
    "½",
    "cup heavy cream",
    "¼",
    "cup vegetable broth",
    "½",
    "cup whole-milk ricotta"
  ],
  "__v": 1
}