{
  "hash": "0ffc9eb3ec204e3afb8b5674f52e325d04a41c0f",
  "title": "Vegan Strawberry Cheesecake",
  "image": "http://ourfourforks.com/wp-content/uploads/2015/06/vegan-strawberry-cheesecake-gluten-free-recipe-final-ourfourforks.jpg",
  "href": "http://ourfourforks.com/vegan-strawberry-cheesecake/",
  "extension": "",
  "firstAdded": "2015-10-01T20:54:48.961000",
  "users": [
    null
  ],
  "keywords": [
    "oats",
    "raw",
    "almonds",
    "coconut",
    "oil",
    "dates",
    "salt",
    "cashews",
    "soaked",
    "overnight",
    "hours",
    "cauliflower",
    "virgin",
    "lemons",
    "juiced",
    "lemon",
    "zest",
    "vanilla",
    "maple",
    "syrup",
    "hulled",
    "strawberries"
  ],
  "directions": [
    "0",
    "Add all ingredients to a food process and process until the mixture begins to stick together.",
    "Line the bottom of a spring form pan with parchment paper and grease the sides with a little coconut oil.",
    "Press the crust mixture into the bottom of the pan and then up the sides to desired height.",
    "Put the grated cauliflower in a microwavable bowl and cover with plastic wrap. Microwave on high 4-6 minutes until the cauliflower is tender. Remove from the microwave and, when cool enough to handle, drain any excess liquid from the cauliflower. I placed the cauliflower in a strainer and pushed down with the back of a spoon to press out any liquid.",
    "In a food processor or high speed blender, add all ingredients except the strawberries and blend until extremely smooth. This may take a bit of time.",
    "When completely smooth, remove a little more than half of the mixture and set aside. Add the strawberries to the remaining mixture and blend until smooth again.",
    "Pour the strawberry mixture into the prepared pie crust and spread evenly. On top of the strawberry layer, pour the remaining cashew cauliflower mixture and carefully spread evenly being careful not to mix the two layers.",
    "Put the entire pie in the freezer and freeze until set, at least 4 hours. If completely frozen, allow to thaw for 30 minutes or more before serving. The pie can be stored in the freezer or the fridge. If stored in the freezer, allow to thaw a bit before serving. Top with sliced strawberries at time of serving."
  ],
  "ingredients": [
    "0",
    "1 cup oats",
    "1 cup raw almonds",
    "5 tablespoons coconut oil",
    "6 dates",
    "¼ teaspoon salt",
    "1",
    "2 cups cashews, soaked overnight or at least 8 hours",
    "4 cups grated cauliflower",
    "⅔ cups virgin coconut oil",
    "2 lemons, juiced",
    "1 teaspoon lemon zest",
    "1 tablespoon pure vanilla extract",
    "½ cup pure maple syrup",
    "½ teaspoon salt, plus more to taste",
    "1 cup hulled strawberries, plus more to garnish"
  ],
  "__v": 1
}