{
  "hash": "6c624794416f987e4726b5f79cd1dec36e35195e",
  "title": "Pimentón Roast Chickens with Crispy Potatoes",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/pimenton-roast-chickens-with-crispy-potatoes",
  "firstAdded": "2015-01-24T01:14:21.446000",
  "users": [
    null
  ],
  "keywords": [
    "garlic",
    "kosher",
    "salt",
    "olive",
    "oil",
    "smoked",
    "paprika",
    "hot",
    "spanish",
    "chickens",
    "bunches",
    "thyme",
    "marjoram",
    "yukon",
    "gold",
    "potatoes",
    "unpeeled",
    "black",
    "pepper",
    "flatleaf",
    "parsley",
    "scallions",
    "dusting"
  ],
  "directions": [
    "0",
    "Smoked paprika is sold at most supermarkets. Look for hot smoked paprika, sometimes labeled Pimentón Picante or Pimentón de La Vera Picante, at specialty foods stores.",
    "1",
    "Mix garlic, salt, oil, and both paprikas in a small bowl; mix to blend well. Using your hands, smear paste all over outside of chickens, rubbing to coat the skin. Place 1 bunch of thyme inside the cavity of each bird. Chill, uncovered, for at least 4 hours or overnight (for more flavor).",
    "2",
    "Let chickens stand at room temperature for 1 hour. If paste has clumped, rub to evenly distribute. Cut each potato in half lengthwise, then lengthwise into 4 thick wedges (steak-fry style). Place in a large bowl; season generously with salt and pepper. Drizzle in oil and, using your hands, toss well to coat. Spread potatoes in a single layer in a large roasting pan or on a large rimmed baking sheet.",
    "Preheat oven to 500°. Place chickens side by side atop potatoes in roasting pan. (Alternatively, chicken and potatoes can be roasted separately on 2 large rimmed baking sheets.)",
    "Roast chickens and potatoes for 30 minutes. Remove from oven; turn potatoes, rearranging chickens if needed. Reduce oven heat to 425°. Continue roasting chickens and potatoes until an instant-read thermometer inserted into thickest part of the thighs registers 165°, about 20 minutes longer. Let rest for 15 minutes.",
    "Transfer potatoes to 1–2 platters; sprinkle with parsley and scallions. Arrange chickens on top of potatoes. Dust lightly with smoked paprika."
  ],
  "ingredients": [
    "0",
    "8 garlic cloves, finely grated",
    "2 tablespoons plus 2 tsp. kosher salt",
    "2 tablespoons olive oil",
    "2 tablespoons smoked paprika",
    "1 tablespoon hot smoked Spanish paprika",
    "2 3½–4-lb. whole chickens",
    "2 large bunches fresh thyme or marjoram",
    "1",
    "3 lb large Yukon Gold potatoes, unpeeled",
    "Kosher salt and freshly ground black pepper",
    "3 tablespoons olive oil",
    "½ cup chopped flat-leaf parsley",
    "½ cup thinly sliced scallions",
    "Smoked paprika (for dusting)"
  ],
  "__v": 1
}