{
  "hash": "e7cbcb6c843f58d0f8850feea3c5c9d1050929d6",
  "title": "Holiday Swirled Sugar Cookies",
  "image": "",
  "href": "https://www.foodnetwork.com/recipes/food-network-kitchen/holiday-swirled-sugar-cookies-4480657",
  "extension": "Chrome",
  "firstAdded": "2018-12-05T01:00:47.031000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Special equipment: a 2-inch round cookie cutter",
    "For the cookies: Whisk together the flour, baking powder and salt in a medium bowl. Beat the butter and granulated sugar with an electric mixer on medium speed in a large bowl until light and fluffy, about 4 minutes. Increase the mixer speed to medium high, add the vanilla and egg and beat until incorporated. Reduce the speed to low, add the flour mixture in 2 batches and beat until just combined. Shape the dough into a disk. Wrap and refrigerate until firm, about 1 hour.",
    "Line 2 baking sheets with parchment paper. Generously dust a work surface with confectioners' sugar. Roll out the dough to a thickness of 1/2 inch, dusting with more confectioners' sugar as needed. (Return the dough to the refrigerator if it gets too soft.) Cut out shapes with a 2-inch round cookie cutter and arrange 2 inches apart on the prepared baking sheets. Reroll the scraps and cut out more cookies. Refrigerate the cookies until firm, about 1 hour.",
    "Position racks in the upper and lower thirds of the oven and preheat to 350 degrees F. Bake the cookies, rotating the pans halfway through, until lightly browned around the edges, 9 to 11 minutes. Let cool completely on the baking sheets.",
    "For the royal icing: Combine the confectioners' sugar and meringue powder in a large bowl. Add 7 tablespoons water and beat with an electric mixer on medium-high speed until soft glossy peaks form, adding up to 8 tablespoons water if necessary to make a smooth icing that thickly coats the back of a spoon.",
    "Line a baking sheet with parchment and set a cooling rack on top.",
    "Put 1/4 cup icing into each of 2 small bowls. Add 9 drops red food coloring to one bowl and stir until evenly combined. Add 2 drops green food coloring to the second bowl and stir until evenly combined. Pour the remaining white icing into a clean rimmed baking sheet and spread or shake to evenly coat it. Drizzle the red icing all over the white, then drizzle the green icing over both. One at a time, put the cookies face-side down in the baking sheet icing. Take the cookies out one at a time, shaking gently to let excess icing drip off, and place right-side up on the prepared cooling rack. Decorate with edible glitter or sprinkles if desired. Let the icing harden completely before serving, about 1 hour.",
    "Cook’s Note",
    "When measuring flour, we spoon it into a dry measuring cup and level off excess. (Scooping directly from the bag compacts the flour, resulting in dry baked goods.)"
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Cookies:",
    "2 3/4 cups all-purpose flour (see Cook's Note)",
    "1/2 teaspoon baking powder",
    "1/4 teaspoon fine salt",
    "2 sticks (1 cup) unsalted butter, at room temperature",
    "3/4 cup granulated sugar",
    "1 teaspoon vanilla extract",
    "1 large egg",
    "Confectioners' sugar, for dusting",
    "Royal Icing:",
    "One 1-pound box confectioners' sugar",
    "2 tablespoons meringue powder",
    "Red and green gel food coloring",
    "Edible glitter or sprinkles, for decorating, optional"
  ],
  "__v": 1
}