{
  "hash": "1374ad68988aae20f2d3561dbcc4becf755d4d8d",
  "title": "Spaghetti Squash Tacos",
  "image": "",
  "href": "https://cookpad.com/us/recipes/451377-smittenkitchen-spaghetti-squash-tacos",
  "extension": "Chrome",
  "firstAdded": "2016-10-16T08:09:49.320000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Add Photo",
    "Preheat your oven to 400°F and prep and cook up your spaghetti squash. Here’s the cliff note version on how to roast up spaghetti squash. Rinse your squash, cut it in half lengthwise, scoop out the seeds, throw about 1/2 tablespoon olive oil on each half and roast both halves face down on a rimmed baking sheet. Roast the squash halves in the pre-heated oven until tender and easily pierced with a fork, 45-60 minutes, or longer depending on the squash. Remove from the oven and set aside until they are cool enough to handle. I have more detailed step-by-step instructions on how to cook a spaghetti squash here. If you prep the squash via the step-by-step instructions, make sure you don’t add any salt or pepper to the squash halves for this recipe.",
    "While the squash is cooking away, prep your ingredients. Squeeze your 2 teaspoons fresh lime juice into a small bowl. In another small bowl mix together the 1 teaspoon chili powder, 1/2 teaspoon ground cumin, 1/2 teaspoon ground coriander, an",
    "Add Photo",
    "When the squash is finished cooking, let it cool for a few minutes so its easier to handle. Working over a large bowl, gently scrape out the flesh with a fork. Compost the skin. Add the 2 tablespoons of lime juice to the bowl with the chili spices and whisk to combine.",
    "Add Photo",
    "Pour the chili and lime mixture over the squash strands and toss well to combine. I used a pair of tongs here so that I could really get everything mixed well together. You will notice that the color of the squash will change from a golden-yellow to an orange color.",
    "Add Photo"
  ],
  "ingredients": [
    "0",
    "3 lb spaghetti squash",
    "2 tbsp (about 1 lime) freshly squeezed lime",
    "1 tsp chili powder",
    "1/2 tsp ground cumin",
    "1/2 tsp ground corriander",
    "1/2 tsp coarse salt",
    "1 15 oz can black beans, rinsed and drained",
    "1/4 cup diced red onion",
    "1 crumbled feta",
    "1 bunch cilantro",
    "10 6\" corn tortillas"
  ],
  "__v": 1
}