{
  "hash": "3e171f1eff188884677d8741435f34ea5d16a58b",
  "title": "CREAMY CARROT, TOMATO, AND RED LENTIL SOUP - VEGAN, OIL-FREE, GLUTEN-FREE",
  "image": "http://www.heathermcclees.com/wp-content/uploads/2018/01/Creamy-Carrot-Tomato-and-Red-Lentil-Soup-Vegan-Oil-Free-Heather-McClees-The-Soulful-Spoon.jpg",
  "href": "http://www.heathermcclees.com/creamy-carrot-tomato-red-lentil-soup-vegan-oil-free-gluten-free/",
  "extension": "Chrome",
  "firstAdded": "2018-02-20T03:13:48.920000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To cook this in the slow cooker, simply add all of the ingredients in the order listed except the optional garnishes. Cook on high for 6 hours until it starts to cook down. Then remove the bay leaf, kombu, and onion halves before proceeding to step 3.",
    "To cook this on the stove-top, simply add all the ingredients except the optional garnishes to a large stock-pot and bring to a boil. Once boiling, reduce the heat to medium-high heat and cook for 30 minutes, stirring occasionally. Then reduce the heat to medium heat and cook for one hour until the mixture cooks down. After cooking, turn off the heat and remove the bay leaf, kombu, and the two halves of the onion before proceeding to step 3.",
    "Puree the soup down with an immersion blender right in the pot until it becomes thick and creamy. Or, transfer the soup to a high powered blender and blend on a low speed until it becomes thick and creamy.",
    "Serve and stir in 1 tsp. miso per serving and add a sprinkle of parsley if you like. I like this soup as an appetizer, a small lunch, or a light dinner as it's really filling in very small servings."
  ],
  "ingredients": [
    "0",
    "12-16 ounces of baby carrots (I used a bag of organic baby carrots which is about 2 - 2.5 cups)",
    "1 15-ounce can of no-salt-added diced tomatoes",
    "1 cup of no-salt-added (or unsalted or low-sodium) vegetable broth - I used Pacific Foods brand",
    "¼ cup red split lentils - I like Arrowhead Mills organic brand",
    "¼ cup wild or brown basmati rice (or a blend) - I used Lundberg brand",
    "1 bay leaf",
    "1 whole onion, peeled and cut into halves but not sliced or chopped up",
    "1 small (2-3-inch) piece of kombu",
    "¼ tsp. oregano",
    "¼ tsp. thyme",
    "¼ tsp. marjoram",
    "¼ tsp. rubbed sage",
    "1 cup of filtered water",
    "optional: 1 tsp. of low-sodium (mellow/white) miso and a garnish of parsley before serving"
  ],
  "__v": 1
}