{
  "hash": "123af3b5600fe8eda84f97ee94cc9662715b6067",
  "title": "Shaved Fennel Salad With Green Olives And Provolone",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/shaved-fennel-salad-with-green-olives-and-provolone",
  "extension": "Chrome",
  "firstAdded": "2017-07-12T14:00:41.162000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation",
    "Slice fennel stems crosswise (not too thin) and place in a medium bowl. Coarsely chop fennel fronds (you want about ⅓ cup) and add to bowl. Crush olives with a flat-bottomed cup or side of a chef’s knife and remove pit. Coarsely chop olives (you want big, chunky pieces). Add olives, oil, vinegar, orange zest, and red pepper to bowl; season with kosher salt and black pepper, then toss to coat.",
    "Halve fennel bulbs lengthwise. Using a mandoline, shave fennel crosswise (you can use a knife, but you want the slices to be no thicker than ⅛\"). Transfer fennel to a large bowl. Zest one-quarter of lemon over. Halve lemon and squeeze in juice from both halves; season with kosher salt and toss to coat. Taste and adjust with more lemon juice, if needed.",
    "Divide olive mixture among plates. Top with cheese to just cover olives. Arrange shaved fennel over so olive mixture is covered, then season with flaky sea salt."
  ],
  "ingredients": [
    "0",
    "Shaved Fennel Salad With Green Olives And Provolone",
    "It’s all in the details with this fennel salad recipe. Taste after each step to reach the perfect balance between salt and acid. This recipe is from Café Altro Paradiso in NYC, read more about it here.",
    "Ingredients",
    "4 SERVINGS",
    "2 large fennel bulbs, tough outer leaves discarded, bulbs, stems, and fronds separated",
    "1 cup Castelvetrano olives",
    "¼ cup olive oil",
    "2 tablespoons Chardonnay or white wine vinegar",
    "1 teaspoon finely grated orange zest",
    "Pinch of crushed red pepper flakes",
    "Kosher salt, freshly ground black pepper",
    "1 lemon",
    "3 ounces thinly shaved aged provolone cheese (about 1 cup)",
    "Flaky sea salt"
  ],
  "__v": 1
}