{
  "hash": "93145eae255ecffebcb81257023a49114a0ba03b",
  "title": "Tempeh Shepherd’s Pie [Vegan]",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2014/11/Tempeh-Shepherd’s-Pie-Vegan-1200x800.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/tempeh-shepherds-pie/",
  "extension": "Chrome",
  "firstAdded": "2015-05-27T08:30:14.305000",
  "users": [
    null
  ],
  "keywords": [
    "tempeh",
    "pkgs",
    "tamari",
    "used",
    "braggs",
    "soy",
    "water",
    "olive",
    "oil",
    "onion",
    "garlic",
    "mushrooms",
    "thyme",
    "coriander",
    "black",
    "pepper",
    "frozen",
    "green",
    "peas",
    "corn",
    "medium",
    "carrots",
    "broth",
    "flour",
    "lbs",
    "yukon",
    "gold",
    "potatoes",
    "nondairy",
    "milk",
    "best",
    "coffee",
    "creamer",
    "earth",
    "balance",
    "salt"
  ],
  "directions": [
    "0",
    "Crumble the tempeh into bite-size pieces in a large skillet or dutch oven. Add the water, tamari/soy/Braggs, and a teaspoon of oil. Cover and bring to a boil and let boil for about 10 minutes.",
    "In the meantime, cover the potatoes with water and boil for about 20 minutes or until soft and mashable. Drain and return to the pot.",
    "After 10 minutes, uncover the tempeh and let simmer till most of the liquid has evaporated, about 5 minutes or so. Drain the tempeh and set aside. Return your pan to the stove top over medium high heat. Add the remaining olive oil to the pan and sauté onions for 5 minutes. Add garlic and cook for one minute. Add tempeh back to the pan, along with the mushrooms, spices and carrots. Cook for 10 minutes more until the mushrooms release their liquid and the tempeh starts to brown. While this cooks, you can mash your potatoes with the Earth Balance, creamer/nondairy milk and salt and pepper until nice and creamy. Preheat your oven to 375° F.",
    "Add the peas and corn to the tempeh mixture and cook just long enough for them to be warm. If things start to stick, add a little more olive oil.",
    "Combine the vegetable broth and flour. Mix well until there are almost no lumps. Add to the pan and stir for about 3 minutes until nice and thick. It will get thicker as it bakes.",
    "Scoop the tempeh into your 9 x 13 casserole dish. Cover the tempeh mixture with the potatoes. Make sure it’s not too hot, but it works best to use your fingers for this part.",
    "Bake for 20 minutes or until the potatoes are browned on top."
  ],
  "ingredients": [
    "0",
    "16 oz. tempeh, (2 pkgs.)",
    "1/3 cup tamari or soy sauce, I used Bragg’s in place of soy sauce",
    "2 cups water",
    "2 tbsp. olive oil",
    "1 onion, diced",
    "3 cloves garlic",
    "8 oz. mushrooms, sliced",
    "1 tsp. dried thyme",
    "1 tsp. ground coriander",
    "freshly ground black pepper",
    "1 cup frozen green peas",
    "1 cup corn (fresh or frozen)",
    "2 medium carrots, diced",
    "2 cups vegetable broth",
    "1/4 cup flour",
    "1",
    "3 lbs. Yukon gold potatoes",
    "1/3 cup nondairy milk, unsweetened is best or I just used soy coffee creamer",
    "1/4 cup Earth Balance",
    "salt and pepper to taste"
  ],
  "__v": 1
}