{
  "hash": "0ecc5db530a1c8e6c83a465ef99031eac5c62e0e",
  "title": "Cookie Dough Cheesecake",
  "image": "http://4.bp.blogspot.com/-8ykWb_Ws_wQ/VkYj4VH_N6I/AAAAAAAAIWE/UiZNSubv8Lo/s640/z.JPG",
  "href": "http://collectingmemoriess.blogspot.com/2015/11/cookie-dough-cheesecake.html",
  "extension": "",
  "firstAdded": "2017-07-14T01:22:02.831000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "To make the crust, mix together graham cracker crumbs and butter. Press into a 8 or 9 inch springform pan and bake in a 160C / 325F preheated oven for 5 minutes. Remove from oven and let cool. Do not turn off the oven.",
    "Make the cookie dough: In a large bowl, beat together butter, sugars, salt and vanilla. Beat until smooth. Add milk, mix until incorporated. Finally, stir in the flour and mix just until combined. Add chocolate chips. Place the cookie dough in the fridge while you prepare the filling. (You could also make this ahead of time and leave in the fridge for a few hours or overnight.) When the cookie dough is firm enough, remove from the fridge and form little balls. Set aside.",
    "To make the filling, beat together cream cheese, white sugar, eggs and vanilla until smooth.",
    "Pour the filling over the graham cracker crust and arrange cookie dough pieces on the top of the surface, slightly pressing them down. Bake for 45 minutes or until firm to the touch. Let cool completely before serving, preferably overnight."
  ],
  "ingredients": [
    "0",
    "Crust:",
    "190g / 1 1/2 cups graham crackers crumbs",
    "95g / 7 tbsp butter, melted",
    "Cookie Dough:",
    "113g / 8 tbsp unsalted butter, softened",
    "100g / 1/2 cup soft light brown sugar",
    "50g / 1/4 cup white sugar",
    "1/4 tsp salt",
    "1 tsp vanilla",
    "125g / 1 cup flour",
    "2 tbsp milk",
    "90g / 1/2 cup chocolate chips",
    "Cheesecake:",
    "750g / 26 oz cream cheese, room temperature",
    "150g / 3/4 cup white sugar",
    "2 large eggs, lightly beaten",
    "1 tsp vanilla"
  ],
  "__v": 1
}