{
  "hash": "2e0a460816262231d830ab5371a0e94e6d826e6f",
  "title": "chicken phở",
  "image": "https://i2.wp.com/farm3.staticflickr.com/2870/11931338566_fd1aab421c_z.jpg",
  "href": "https://smittenkitchen.com/2014/01/chicken-pho/",
  "extension": "Firefox",
  "firstAdded": "2019-07-14T23:25:56.202000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Char onions and ginger: Heat the oven to 400°F. Put the onions and ginger on a lightly oiled baking sheet and roast for 30 minutes, or until softened and lightly browned. [Alternate idea suggested in the comments: If you have a gas range, just char them a bit over a flame. It would save a lot of time.]",
    "Cook the chicken: Fill a large stockpot with the water and bring to a boil. Add the roasted onions and ginger, and the chicken bones or wings, quartered chicken, salt, sugar and any of the optional spices and bring to a boil. Lower the heat to moderate and simmer until the chicken is cooked, about 30 minutes.",
    "Remove the chicken and finish the broth: Using tongs, transfer the quartered chicken to a plate and let cool slightly. Remove the meat from the bones and refrigerate. Return the skin and bones to the stockpot and simmer for 2 hours longer. Strain the chicken broth into a large soup pot and cook over high heat until reduced to 12 cups, about 15 minutes. Stir in the fish sauce; adjust to taste.",
    "*Prepare noodles: In a large bowl of warm water, soak the noodles until pliable, about 20 minutes. You can also prepare the noodles according to the package instructions, if they differ. Bring a large saucepan of salted water to a boil. Drain the noodles, then add them to the saucepan and boil over high heat until tender, about 3 minutes. Drain well. Divide the noodles between 6 large bowls and sprinkle with the scallion.",
    "Finish and serve the soup: Add the reserved chicken to the broth and simmer until heated through. Ladle the broth and chicken over the noodles. Serve with the bean sprouts, basil, lime wedges, jalapeños, chili-garlic sauce, hoisin sauce and crispy shallots.",
    "* Note: Phan has you cook the noodles separately in water, so they can be drained and used as needed. I believe he’s concerned about them overcooking in the soup pot. Theoretically, you could of course save time by cooking the noodles in the broth pot while the chicken reheats, however, the noodles are likely to make the broth cloudy, when ideal pho usually has a pristinely clear broth. [Thanks to everyone who mentioned the clouding issue in the comments.]",
    "Do ahead: The broth can be made ahead and refrigerated for two days, a great way to divide up this recipe.",
    "Crispy Fried Shallots",
    "Why make so many? Phan says they’re an essential crispy, salty and sweet condiment in Vietnam, where they’re used in soups, on salads, in meatballs and even sprinkled on dumplings as garnish. Phan recommends that you twice-fry them, once at a low temp and a second at a higher one. I fudged this and just did it at higher one for less time, but they burned easily and I know his way is better, so am sharing this instead. I made about a quarter-recipe of this in a small skillet and wished we had more.",
    "2 cups thinly sliced shallots (about 4 large shallots)",
    "2 cups canola oil",
    "In a small saucepan or large heavy skillet, heat the oil over medium-high until it registers 275°F on a deep-fry or candy thermometer. Add the shallots and cook, stirring frequently as they’ll want to cook unevenly, until light golden brown, about 4 to 8 minutes, depending on their thickness. Transfer to a paper towel-lined plate to drain.",
    "Increase the heat to high and place a fine-mesh sieve over a heatproof bowl. When the oil registers 375°F on the deep-fry or candy thermometer, add return the fried shallots to the oil and cook just until they are crispy and well-browned, about 5 seconds, watching carefully so the shallots don’t burn.",
    "Pour the oil and shallots through the sieve to immediately stop the cooking, then transfer to shallots to a paper towel-lined plate to drain. Sprinkle with salt to season. Reserve the oil for another use. The shallots will keep, stored in an airtight container, for 1 day, but they’re best the day they are made."
  ],
  "ingredients": [
    "0",
    "Broth",
    "2 unpeeled yellow onions, quartered",
    "Three 1/2-inch-thick slices of unpeeled fresh ginger, smashed",
    "4 quarts cold water",
    "3 pounds chicken bones or chicken wings",
    "One fresh 3 1/2-pound chicken, quartered",
    "1 tablespoon kosher salt",
    "2 teaspoons sugar",
    "Additional spices (optional): Cinnamon, star anise, black cardamoms, coriander seeds, fennel seeds or cloves",
    "1/4 cup Asian fish sauce",
    "1 pound dried rice noodles, a linguine shape (bánh phở) if you can find them",
    "Garnishes",
    "1 large scallion, thinly sliced",
    "1 pound mung bean sprouts",
    "1/2 cup torn basil leaves, Thai basil if you can find it",
    "1/2 cup cilantro leaves",
    "2 limes, cut into wedges",
    "2 jalapeños, thinly sliced",
    "Asian chili-garlic sauce",
    "Hoisin sauce",
    "Crispy shallots, recipe follows"
  ],
  "__v": 1
}