{
  "hash": "ef127880f7d11f49e794dbf9672d1705a72732ac",
  "title": "Homemade Monkey Bread",
  "image": "https://31p86334w2bvkz0249eyr0cr-wpengine.netdna-ssl.com/wp-content/uploads/2014/06/Homemade-Monkey-Bread-aka-Cinnamon-Roll-Bites-12.jpg",
  "href": "https://sallysbakingaddiction.com/2014/06/30/homemade-monkey-bread-aka-cinnamon-roll-bites/",
  "extension": "Chrome",
  "firstAdded": "2018-09-15T22:30:57.630000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Make the dough: In a large mixing bowl, dissolve yeast in warm water. Stir it around a bit and let it sit for about 2 minutes. Add the milk, melted butter, sugar, eggs, salt, and 3 cups of flour. Beat on high speed for 3 minutes (using a dough hook if you have a stand mixer or using a hand mixer). By hand add enough remaining flour to form a firm dough. About 5 cups total.",
    "Turn the dough onto a floured surface. Knead until smooth and elastic, about 5 minutes. Do not over-knead, which will yield a tough, chewy bread. The dough is ready when it is smooth and when you can poke it with a finger and it springs back. Form dough into a smooth ball and place into a large greased bowl, turning once to grease the top. I greased the bowl with cooking spray. Cover tightly with plastic wrap or aluminum foil and refrigerate for 8 hours or overnight.",
    "Make the coating: melt 1/2 cup of butter in a small bowl. Mix granulated sugar and cinnamon together in another small bowl. Set aside. You will use the rest of the butter, brown sugar, and vanilla later.",
    "Spray a 10-12 cup bundt pan with cooking spray. Set aside. Punch the cold dough down very gently to allow the air bubbles to release. Pull apart pieces and roll into balls, about 1.25 inches in diameter. You will need 40-45 balls total, so be modest with their size. Dip each ball, one by one, in the melted butter and then generously roll in the cinnamon-sugar mixture to coat them. You may need more cinnamon-sugar depending how heavy you coat each ball. Arrange them in the bundt pan as you go. If you did not use Red Star Platinum yeast, cover the pan and allow dough balls to rise again for about 45 minutes at room temperature. If you did use Red Star Platinum yeast, move ahead to the next step and bake right away.",
    "Preheat oven to 350F. Melt the remaining 1/4 cup of butter and whisk in the brown sugar and vanilla until combined. Pour the buttery mixture over the dough balls in the bundt pan. Bake for 30-35 minutes or until golden brown on top. Cover loosely with foil if the top browns too quickly. Cool for 5-10 minutes and invert onto a large serving plate.",
    "Make the glaze: Simply whisk all of the glaze ingredients together and pour over the bread. You may either cut the bread into generous slices or let everyone pick off the gooey pieces themselves.",
    "Monkey bread tastes best served on the same day, but will stay fresh for 3 days if stored covered at room temperature or in the refrigerator.",
    "Make ahead tip: This recipe is designed to be made ahead! In step 2, you'll see that the dough needs to rise for at least 8 hours or overnight."
  ],
  "ingredients": [
    "0",
    "Dough",
    "1 package (2 and 1/4 teaspoons) active dry yeast (recommended: Red Star Platinum)",
    "1/4 cup warm water (110F-115F)",
    "1 and 1/4 cups warm 2% milk (110F-115F, 2% or higher milk fat, no lower)",
    "1/3 cup unsalted butter, melted",
    "1/4 cup granulated sugar",
    "2 large eggs",
    "1 teaspoon salt",
    "5 cups all-purpose flour (measured correctly)",
    "Coating",
    "3/4 cup unsalted butter",
    "1 and 1/4 cups granulated sugar",
    "1 Tablespoon ground cinnamon",
    "2/3 cup packed light or dark brown sugar",
    "1 teaspoon vanilla extract",
    "Vanilla Glaze",
    "1 cup (120g) confectioners' sugar",
    "3 Tablespoons (45ml) heavy cream (or milk for a less creamy texture)",
    "1/2 teaspoon vanilla extract"
  ],
  "__v": 1
}