{
  "hash": "13b358b277de633fc490257165e6e6d481180f5d",
  "title": "Whole30 Chilaquiles with Carnitas and Sweet Potatoes",
  "image": "http://40aprons.com/wp-content/uploads/2018/01/whole30-chilaquiles-mexican-recipes-1-500x500.jpg",
  "href": "http://40aprons.com/whole30-chilaquiles-whole30-mexican-recipes/",
  "extension": "Chrome",
  "firstAdded": "2018-05-27T18:39:43.107000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large cast-iron skillet, heat 1 Tbsp. avocado oil over medium heat. Add sweet potato rounds, working in batches if necessary, and fry on both sides until cooked through and crisped, about 10 minutes. Add more oil if necessary to prevent sticking or burning. Season with salt and pepper to taste.",
    "If you fried the sweet potatoes in batches, combine all sweet potato rounds in skillet. Pour salsa over and stir to coat. Stir carnitas or shredded Mexican chicken into sweet potato mixture. Heat through.",
    "In a small bowl, combine avocados, lime juice, and plenty of salt. Mash to desired consistency.",
    "In a small skillet, heat 1 Tbsp. avocado oil over medium heat. Crack eggs, one at a time, into skillet, then cook until whites are opaque and cooked through, with yolk still runny. Season with plenty of salt.",
    "Slide fried eggs onto sweet potato-carnitas mixture, then top with avocado mash. Garnish with sliced jalapeños, cilantro, red onion, and almond flour, as desired."
  ],
  "ingredients": [
    "0",
    "1 sweet potato peeled and sliced into thin rounds",
    "2 Tbsp. avocado oil divided",
    "Salt and pepper to taste",
    "1/2 cup salsa",
    "1 cup carnitas or shredded Mexican chicken",
    "2 avocados peeled and pitted",
    "1/2 lime juice of",
    "thinly sliced fresh jalapeños to serve",
    "fresh cilantro roughly chopped, to serve",
    "red onion chopped, to serve",
    "green onions sliced thin, for garnish",
    "red radishes sliced thin, for garnish, optional",
    "almond flour for garnish"
  ],
  "__v": 1
}