{
  "hash": "c69e9afcd8bc0ce4ad17645a7ef53bb70291f357",
  "title": "moroccan chicken recipe",
  "image": "https://www.themediterraneandish.com/wp-content/uploads/2019/02/Moroccan-Chicken-Recipe-7.jpg",
  "href": "https://www.themediterraneandish.com/moroccan-chicken-recipe/?fbclid=IwAR0KUuncLPLan0pWmcsJWd-vjAzUqBMcC7NSudDjDyQhQLX1QqQNlJzZvNE",
  "extension": "Chrome",
  "firstAdded": "2020-02-08T04:19:26.840000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "In a small bowl, combine Ras El Hanout and the remaining spices to make the rub.",
    "Pat chicken pieces dry and season lightly with kosher salt on both sides. Now, rub the chicken all over with the spice rub (if you kept the skins, make sure to apply the spice rub underneath the skins for best flavor.) Set aside in room temperature for 40 to 45 minutes or so (or, if you have the time, cover and refrigerate for 2 hours or overnight. If you do this, take chicken out of fridge and let it rest at room temperature for a few minutes before cooking.)",
    "In a 12″ deep ceramic pan or braiser like this one, heat 2 tbsp extra virgin olive oil over medium-high heat until shimmering but not smoking. Add chicken (skin side down, if you kept skin) and brown for 5 minutes. Turn over and brown on the other side for another 3 minutes or so.",
    "Lower heat to medium-low and add onions, garlic, and cilantro. Cover and cook for 3 minutes, then add lemon slices, olives, raisins, and dried apricots.",
    "In a small bowl, mix the tomato paste and chicken broth. Pour mixture on top of the chicken as it cooks.",
    "Bring to a simmer for 5 minutes, then, keeping heat on medium-low, cover and cook for 30-45 minutes until chicken is tender and cooked through registering an internal temperature of 165 degrees F or higher.",
    "Garnish with more fresh cilantro and toasted almonds, if you like. Serve over plain couscous."
  ],
  "ingredients": [
    "0",
    "For Spice Rub",
    "1 1/2 tbsp all-natural Ras El Hanout",
    "1 1/2 tsp ground cinnamon",
    "1 tsp sweet paprika",
    "1 tsp ground ginger",
    "1/2 to 1 tsp black pepper",
    "For Chicken",
    "3 1/2 lb/1587.57 g whole chicken cut into bone-in pieces (or 7 to 8 pieces of chicken with bone in. Leave skin on or remove it, up to you.)",
    "Kosher salt",
    "Private Reserve Greek extra virgin olive oil",
    "1 medium yellow on ion, chopped",
    "4 garlic cloves, peeled and minced",
    "1 oz/28.3 g chopped fresh cilantro",
    "1 lemon, thinly sliced (or rind of 1 preserved lemon)",
    "3/4 cup/ 58.5 g pitted green olives",
    "1/4 cup/37 g raisins (any kind)",
    "1/4 cup/ 47 g chopped dry apricots",
    "3 tbsp/49.14 g tomato paste",
    "1 1/2 cup 352.5 ml low-sodium chicken broth",
    "Toasted slivered almonds, to your liking, optional"
  ],
  "__v": 1
}