{
  "hash": "fb263bb7067ad8737ada7fa186af71412b94f9f0",
  "title": "Frozen Breakfast Burritos",
  "image": "https://img.buzzfeed.com/buzzfeed-static/static/2016-02/29/14/enhanced/webdr13/enhanced-3788-1456773408-1.jpg",
  "href": "http://www.buzzfeed.com/scottloitsch/heres-what-you-should-eat-for-breakfast-for-the-rest-of-the",
  "extension": "Chrome",
  "firstAdded": "2016-02-29T21:43:31.900000",
  "users": [
    null
  ],
  "keywords": [
    "heres",
    "need",
    "bacon",
    "sausage",
    "baby",
    "red",
    "potatoes",
    "pepper",
    "yellow",
    "onion",
    "salt",
    "eggs",
    "cheese",
    "bunch",
    "green",
    "onions",
    "flour",
    "tortillas",
    "parchment",
    "paper"
  ],
  "directions": [
    "0",
    "Directions:",
    "In a large skillet over medium heat, cook bacon (in batches if necessary) until crispy. Remove the bacon to a paper towel lined plate - leave to cool. In the same skillet - using leftover bacon grease (drain some if necessary) add the potatoes and season with salt and pepper. Once lightly browned add in peppers and onion. Cook until potatoes have browned and the peppers and onions have softened. Remove from pan and place in bowl to cool. In the same saucepan, cook sausage until browned and cooked through. Remove to a paper towel lined bowl. Finally, reduce heat to medium/low and pour beaten eggs into the skillet. Fold and stir eggs occasionally until cooked but still soft and moist. Remove from pan.",
    "Gather cooked ingredients - having let them all cool slightly. Additionally gather flour tortillas, shredded cheese and sliced green onions (optional) and set them out on your table/workspace. To assemble the burritos, lay out a tortilla and start with a base of eggs followed by desired toppings and finish with cheese. To wrap, fold in both sides and then fold the bottom up and over all the ingredients. Roll up tightly. (If you find the tortillas are tearing, heat them up - a few at a time - for 20 seconds in the microwave before assembling). Wrap up in parchment paper and repeat with remaining tortillas and ingredients, customizing the burritos to your liking. Place the parchment-wrapped burritos in a 1 gallon freezer bag and place in the freezer to store for up to one month.",
    "To reheat:",
    "Remove the frozen burrito from the freezer. Unwrap from parchment paper and wrap the frozen burrito up in a damp paper towel. Place on a microwave safe plate and microwave for 3 minutes. Remove from microwave and rest for one minute before unwrapping. Remove the paper towel, serve with hot sauce, salsa, or sour cream! Enjoy!"
  ],
  "ingredients": [
    "0",
    "Here’s what you will need:",
    "Bacon",
    "Sausage",
    "Baby Red Potatoes /quartered",
    "1 Red Pepper /chopped",
    "1 Yellow Onion /chopped",
    "Salt and Pepper",
    "10 Eggs - beaten",
    "1 Bag Shredded Cheese",
    "1 Bunch Green Onions /sliced",
    "Flour Tortillas",
    "Parchment Paper"
  ],
  "__v": 1
}