{
  "hash": "d8b0ce3bf9a65f6aea1dc25d38b1d08c68ebbb3d",
  "title": "Easy Slow Cooker Barbecue Ribs",
  "image": "http://www.carlsbadcravings.com/wp-content/uploads/2016/02/Slow-Cooker-Barbecue-Ribs-13.jpg",
  "href": "http://www.carlsbadcravings.com/slow-cooker-barbecue-ribs-recipe/",
  "extension": "",
  "firstAdded": "2016-05-24T11:56:33.177000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 400 degrees F Line a baking sheet with sides with parchment paper. Set aside.",
    "Cut ribs into 6 sections then rinse and pat dry.",
    "In a medium bowl, whisk together Spice Rub ingredients. Remove 1 tablespoon Spice Rub to use in your barbecue sauce. Rub all remaining Spice Rub evenly all over the meat then place ribs on prepared baking sheet. Bake ribs for 15 minutes ON EACH SIDE (30 minutes total) to sear meat.",
    "Meanwhile, add all of the Barbecue Sauce ingredients to a medium saucepan and gently simmer for 15 minutes, stirring occasionally. Remove 1 1/2 cups barbecue sauce and refrigerate to use after ribs are cooked.",
    "Spray slow cooker with nonstick cooking spray then add a thin layer of remaining barbecue sauce, followed by ribs. Layer sauce then ribs until complete, tossing to coat as needed to ensure ribs are evenly coated in barbecue sauce.",
    "Cover and cook on HIGH for 4-5 hours or on LOW for 7-9 hours OR cook until ribs are fall apart tender. Rotate ribs once during cooking so they cook evenly. Cooking time may vary between slow cookers.",
    "When ribs are tender, remove from slow cooker and brush with some Reserved Barbecue Sauce if desired or use sauce for dipping. Enjoy!"
  ],
  "ingredients": [
    "0",
    "4 pounds baby back pork ribs",
    "Spice Rub",
    "1 1/2 Tablespoons paprika",
    "1 1/2 Tablespoons packed brown sugar",
    "2 teaspoons salt",
    "2 teaspoons chili powder",
    "2 teaspoons garlic powder",
    "1 teaspoon ground chipotle pepper",
    "1 teaspoon black pepper",
    "1 teaspoons onion powder",
    "1/2 teaspoon dried thyme",
    "1/4 teaspoon cayenne pepper (optional for more heat)",
    "Barbecue Sauce",
    "2 cups ketchup",
    "1/2 cup molasses",
    "1/2 cup brown sugar, packed",
    "1/4 cup seedless blackberry preserves",
    "1/3 cup apple cider vinegar",
    "1 tablespoons reserved Spice Rub (from above)",
    "1 tablespoon liquid smoke (optional)*"
  ],
  "__v": 1
}