{
  "hash": "34cfd5495668f906f77cf7c32d76d0f940b41da6",
  "title": "Spring Minestrone Soup",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2011/05/spring-minestrone-vertical-b-1600.jpg",
  "href": "http://www.simplyrecipes.com/recipes/spring_minestrone_soup/",
  "extension": "",
  "firstAdded": "2017-07-13T22:28:06.518000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "1 Prep green onions, green garlic, potatoes, artichoke hearts: Chop the green onions and green garlic and separate the white and light green parts from the green tops. If you are using regular garlic cloves, put them with the white parts of the green onions.",
    "Scrub potatoes and cut them into 1-inch chunks. Either trim fresh artichokes down to their hearts and chop the hearts (see How to Trim Artichokes) or chop up defrosted frozen artichoke hearts.",
    "2 Sauté white parts of green onions and garlic, add potatoes: In a large pot set over medium-high heat, warm the olive oil for 1 minute. Add the white parts of the green onions as well as the garlic and sauté for 1 minute.",
    "Add the potatoes, and cook 1 minute more.",
    "3 Add tomatoes, stock, salt, then simmer: Add the diced tomatoes with their liquid and the quart of vegetable or chicken stock.",
    "Bring to a simmer, add salt to taste, then cover and cook over medium-low heat for 10 minutes.",
    "4 Add artichoke hearts (if using fresh) and cook another 5 minutes",
    "5 Add the chickpeas and green peas and cook another 5 minutes.",
    "6 Add the asparagus and artichoke hearts (if using frozen), then the greens: Add the asparagus and artichoke hearts (if using frozen artichoke hearts). Cook 2 minutes.",
    "Add the greens and the green parts from the green onions and green garlic, if using. Stir well to combine and cook 1 minute.",
    "7 Add pesto, salt, pepper: Turn off the heat and stir in the pesto. Add black pepper and more salt to taste (depending on how salty your stock is, you may need to add 1 to 2 teaspoons of salt).",
    "Serve topped with grated cheese."
  ],
  "ingredients": [
    "0",
    "2 Tbsp olive oil",
    "6 green onions",
    "2 green garlic stalks, or 2 large garlic cloves",
    "1 pound baby potatoes, or Yukon gold potatoes cut into 1-inch chunks",
    "1 15-ounce can of diced tomatoes",
    "4 cups vegetable stock or chicken stock (use vegetable stock if cooking vegetarian or vegan)",
    "Salt",
    "1/2 pound artichoke hearts (fresh or frozen), chopped roughly",
    "1 15-ounce can of chickpeas (garbanzo beans), rinsed and drained",
    "1 cup peas (fresh or frozen)",
    "1/2 pound asparagus, cut into 1-inch chunks",
    "2 cups greens (dandelion, chard, spinach, kale, arugula, etc), sliced into thin ribbons",
    "Up to 1/4 cup pesto",
    "Grated parmesan or pecorino cheese for garnish (omit for vegan version)",
    "1 teaspoon black pepper"
  ],
  "__v": 1
}