{
  "hash": "459a8bfeaeb4b902c43023e1c51f6d5529c2d856",
  "title": "cream of celery soup with walnut-currant salsa",
  "image": "https://alexandracooks.com/wp-content/uploads/2018/11/celerysoupgarnishbowl-1.jpg",
  "href": "https://alexandracooks.com/2018/11/03/cream-of-celery-soup-with-walnut-currant-salsa/",
  "extension": "Chrome",
  "firstAdded": "2019-01-02T23:47:51.331000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "INSTRUCTIONS",
    "Put the butter, celery and onion in a large pot over medium heat. Season lightly with salt and pepper and cook the vegetables slowly until they have begun to soften and release their juices, about 8 minutes. Don’t let the vegetables brown at all.",
    "Add the stock or water, adjust the heat to a simmer, and cook until the celery and onion are completely tender, about 30 minutes. Let the soup cool a bit, then process in a blender or food processor to make a smooth puree. You might need to do this in batches. Alternatively, use an immersion blender.",
    "Meanwhile, place the currants in a small bowl and cover with the 1/4 cup white balsamic vinegar and 1/4 cup hot tap water. Let stand 15 minutes. Drain.",
    "Toss together the reserved chopped celery leaves, the toasted walnuts, plumped raisins or currants and celery seed in a bowl and moisten with a few tablespoons of olive oil. Season with salt to taste. Toss. Taste. Adjust seasoning as necessary.",
    "Return the puree to the pot, add the cream, starting with 1/2 cup, and bring everything to a low simmer. Cook for about 5 minutes to soften the raw cream flavor. Taste and adjust with salt and pepper as desired. Add the remaining 1/2 cup cream if you wish, and simmer further. Divide into serving bowls and top with the walnut-raisin mixture."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "2 tablespoons unsalted butter",
    "1 head celery (about 1.5 lbs.), cut into 1-inch pieces, leafy tops and centers chopped and reserved",
    "1 to 2 small onions, diced",
    "Kosher salt and freshly ground black pepper",
    "6 cups vegetable stock or water",
    "1 /2 to 1 cup heavy cream",
    "For the garnish:",
    "1/2 cup raisins or dried currants",
    "1/4 cup white balsamic vinegar",
    "1/2 cup roughly chopped, lightly toasted walnuts, see notes above",
    "1 teaspoon celery seed",
    "Extra-virgin olive oil",
    "flaky sea salt such as Maldon, if you have it, or kosher salt"
  ],
  "__v": 1
}