{
  "hash": "4dd8733b7ba0738ea5add0bfba6b8c7e2bd0b72f",
  "title": "Sweet Corn and Jalapeno Enchiladas",
  "image": "https://farm6.staticflickr.com/5528/14453061475_ea54136714_c.jpg",
  "href": "http://www.girlversusdough.com/2014/06/19/sweet-corn-and-jalapeno-enchiladas/",
  "extension": "Chrome",
  "firstAdded": "2017-07-03T22:59:52.927000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350 degrees F.",
    "Combine corn and water in a blender. Puree until smooth. Reserve ¼ cup of the puree for the enchilada sauce.",
    "Heat olive oil in a large skillet over a medium flame for a minute or two. Add onion and jalapeno. Stir and sauté until translucent and tender, about five minutes. Add the garlic, stir, and sauté for one minute. Pour in the corn puree and stir to combine.",
    "Stir in the seasonings, cornmeal, and ¼ cup of shredded cheese. Stir to combine. Reduce heat to low and cook for 5 to 10 minutes, until mixture is thickened and heated enough to melt the cheese. Once hot, turn off flame and leave skillet on the burner while you assemble the enchiladas.",
    "To make the enchilada sauce, whisk together the corn puree, sour cream, stock, and chili powder in a small bowl. Place a few tablespoons in the bottom of a large rectangular baking dish.",
    "Wrap the tortillas in a damp paper towel and then microwave for a minute to make them easier to work with. Place about 3 to 4 tablespoons of corn and jalapeno mixture in a row in the center of a tortilla then roll and place in a large baking dish. Continue that process until all six enchiladas are filled and rolled.",
    "Cover the enchiladas with the remaining sauce and cheese. Cover the baking dish with foil and bake for twenty minutes. Remove foil and bake for 5 to 10 more minutes, until golden and a bit crusty. Let enchiladas sit for 7 to 10 minutes before serving."
  ],
  "ingredients": [
    "0",
    "1 lb frozen and thawed sweet corn kernels",
    "1 cup water",
    "2 tablespoons olive oil",
    "½ small Vidalia onion, diced",
    "1 jalapeno, seeded and diced",
    "1 garlic clove, grated",
    "Pinch of crushed red pepper flakes",
    "1 teaspoon salt",
    "½ teaspoon black pepper",
    "⅓ cup + 1 tablespoon fine cornmeal",
    "¾ cup shredded Mexican cheese blend",
    "6 flour tortillas",
    "Fresh chopped cilantro",
    "1",
    "¼ cup corn puree",
    "2 tablespoons sour cream/Greek yogurt",
    "¼ cup vegetable stock/chicken stock/ light beer",
    "1 tablespoon chili powder"
  ],
  "__v": 1
}