{
  "__v": 1,
  "directions": [
    "0",
    "Copri il fondo di una pentola con olio extravergine di oliva.",
    "Sbuccia la cipolla e tritala finemente con un coltello o con la mezzaluna, poi aggiungi la cipolla nella pentola e lasciala cuocere, mescolando spesso, per circa 5 minuti, in modo che si ammorbidisca ma non diventi troppo dorata o bruciata.",
    "Aggiungi le carote e il sedano tritati finemente e fai cuocere per altri 10 minuti, sempre a fuoco basso, mescolando spesso con un cucchiaio di legno.",
    "Nel frattempo, pulisci i pomodori togliendo le parti bianche nel centro e i semini. Dividili in quattro parti e aggiungili al battuto di cipolla, sedano e carote.",
    "Per finire, aggiungi anche il sale e il basilico e cuoci il tutto a fuoco medio per 20 - 25 minuti, mescolando spesso.",
    "Quando i pomodori sono morbidi e si disfanno bene con un cucchiaio di legno, spegni il fuoco e versa tutto in uno scolapasta, raccogliendo l'acqua di cottura rimasta in una ciotolina.",
    "Passa i pomodori con un passaverdura, usando il setaccio più fine, e raccogli la salsa in una pentola. Se a volte diventa difficoltoso girare il passaverdura, puoi aggiungere qualche cucchiaio dell'acqua di cottura messa da parte per aiutarti.",
    "Controlla la consistenza della pomarola: se è ancora un po' troppo liquida - dipende dai pomodori usati - puoi farla cuocere per circa 5 minuti a fuoco vivace.",
    "La pomarola è pronta adesso... buttate la pasta!"
  ],
  "firstAdded": "2014-10-07T13:18:09.292000",
  "hash": "13d83771900ce6cec0ea9111bbf0060f4f7b4d26",
  "href": "http://it.julskitchen.com/toscana/pomarola-sugo-pomodor",
  "image": "http://farm7.static.flickr.com/6209/6108638676_5757c92a2a_b.jpg",
  "ingredients": [
    "0",
    "2,5 kg di pomodori ben maturi, circa 2 kg di pomodori puliti",
    "1 cipolla rossa, tritata finemente",
    "4 carote, tritate finemente",
    "2 coste di sedano, tritate finemente",
    "olio extravergine di oliva",
    "circa 2 cucchiai abbondanti di sale grosso",
    "2 rametti di basilico fresco"
  ],
  "keywords": [
    "ben",
    "maturi",
    "circa",
    "pomodori",
    "puliti",
    "cipolla",
    "rossa",
    "tritata",
    "finemente",
    "carote",
    "tritate",
    "coste",
    "sedano",
    "olio",
    "extravergine",
    "oliva",
    "cucchiai",
    "abbondanti",
    "sale",
    "grosso",
    "rametti",
    "basilico",
    "fresco"
  ],
  "title": "La pomarola",
  "users": [
    null
  ]
}