{
  "hash": "67b68a9aac44783ca8b47a4fefc6e47aca9ea159",
  "title": "NO-BAKE BLUEBERRY GOAT CHEESE CHEESECAKE WITH GINGERSNAP CRUST",
  "image": "http://i1.wp.com/portandfin.com/wp-content/uploads/2015/07/GoatCheeseCheesecake1.jpg?resize=680%2C861",
  "href": "http://portandfin.com/no-bake-blueberry-goat-cheese-cheesecake-with-gingersnap-crust/",
  "extension": "Chrome",
  "firstAdded": "2016-06-22T21:15:31.429000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Lightly grease a 9-inch springform pan; set aside.",
    "In a food processor, pulse the gingersnap cookies until broken down into a course mixture. Add in brown sugar and butter and mix until moist crumbs form. Transfer to baking pan, spread to the edges and press down firmly to make the crust. Place the pan in the freezer to chill while you make the filling.",
    "In the bowl of a stand mixer fitted with the whisk attachment, whip together the cream and vanilla for 2-3 minutes until thick peaks form. Add the honey and goat cheese and whisk until incorporated. Scoop the mixture unto baking pan, spread evenly, and flatten out the top (It doesn't need to be perfectly flat as you'll cover the top with the blueberries anyway). Cover with plastic wrap and place in the refrigerator overnight (or for at least 8 hours).",
    "In a small saucepan, combine 1 cup of the blueberries, sugar, and water and bring to a low boil over medium heat. Cook for about 8 minutes, stirring often, until blueberries have broken down. Add in the remaining blueberries and toss until combined.",
    "Remove cheesecake from the fridge and unmold from the pan. Place blueberry compote on top. Run a knife under hot water for 10 seconds, then slice, rewetting the knife before each slice to ensure a smooth slice. Serve."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Crust:",
    "2 cups finely ground ginger snap cookies",
    "1 Tbsp brown sugar",
    "1 stick unsalted butter, melted",
    ".",
    "Filling:",
    "1.5 cups chilled heavy whipping cream",
    "1 tsp vanilla extract",
    "2 Tbsp honey",
    "11 ounces goats cheese (chevre), softened",
    ".",
    "Blueberry Compote:",
    "2 cups fresh blueberries",
    "½ Tbsp sugar",
    "⅛ cup water"
  ],
  "__v": 1
}