{
  "hash": "cdc8dbd8cc7d85117861098b2026d707df92e0c1",
  "title": "Green Lamb Curry",
  "image": "http://cdn.hairybikers.com/uploads/images/_recipeImage/LAMB_CURRY.jpg",
  "href": "http://www.hairybikers.com/recipes/view/green-lamb-curry",
  "extension": "Chrome",
  "firstAdded": "2018-10-30T18:56:33.867000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Put the lamb meat in a bowl. Mix the curry powder with the salt and plenty of black pepper. Sprinkle it over the lamb and mix thoroughly until all the meat is well coated.",
    "Heat the vegetable oil in a large flameproof casserole dish. Add the onions and cook them over a medium to low heat until they are soft and very lightly coloured. Turn up the heat and add the lamb and garlic to the casserole dish. Cook, stirring regularly, until the lamb has browned, then add the garlic and tomato purée. Stir for another couple of minutes.",
    "Add up to 400ml of water to the dish – just enough to barely cover the lamb – then bring it to the boil. Turn down the heat to a simmer, then cover and leave the curry to cook for 1ó–2 hours until the lamb is tender. Remove the lid and continue to cook for 20 minutes, uncovered, to reduce the liquid.",
    "When the lamb has almost finished cooking, prepare the spinach. If using fresh spinach, wash it well and cook it in a large saucepan. You shouldn’t need to add any additional water, just press the spinach down until it wilts. When the spinach has completely wilted down, strain off most of the liquid, then purée or finely chop it. If using frozen spinach, defrost it thoroughly and purée or finely chop it as for the fresh.",
    "Add the spinach to the curry and stir it in thoroughly. Cook, uncovered, until the liquid has reduced down to a thick, green-flecked sauce. Serve the curry garnished with coriander and with flatbread or a portion of cauliflower rice (see p.180 in Make It Easy)."
  ],
  "ingredients": [
    "0",
    "800g lean lamb (leg is best), trimmed of fat and diced",
    "2½ tbsp curry powder",
    "½ tsp salt",
    "1 tbsp vegetable oil",
    "2 onions, finely sliced",
    "4 garlic cloves, finely chopped",
    "1 tbsp tomato purée",
    "500g fresh spinach or 1kg frozen",
    "small bunch of coriander leaves, to serve",
    "black pepper"
  ],
  "__v": 1
}