{
  "hash": "957e94fab4ef8c633bc6c78d6367eb30c0fc2754",
  "title": "Baked Eggs in Avocado with Bacon, on Toast",
  "image": "//whiteonricecouple.com/recipe/images/baked-eggs-thumb-200.jpg",
  "href": "http://whiteonricecouple.com/recipes/baked-eggs-avocado/",
  "extension": "Chrome",
  "firstAdded": "2015-03-08T14:26:36.517000",
  "users": [
    null
  ],
  "keywords": [
    "medium",
    "avocado",
    "eggs",
    "bacon",
    "crumbled",
    "slices",
    "toast",
    "salt",
    "cracked",
    "black",
    "pepper",
    "hot",
    "tomatoes"
  ],
  "directions": [
    "0",
    "Pre-heat oven to 425 degrees.",
    "Crack the eggs in a medium bowl, careful to not puncture the yolks. Set aside.",
    "Cut avocado in half and carefully remove seed. Depending on how big the seed is, the hole in the avocado should be big enough for one small egg. But if the hole looks too small, scoop out a little at a time till it matches the amount of egg.",
    "In a medium baking dish, try to rest the avocado half inside the edge of the dish so that the avocado doesn't tilt over. You need to keep the avocado from tilting so that the raw egg does not spill out. Look at the photo above to see how I did it.",
    "You can crack the egg directly in the avocado, but it might overflow and make a mess. So this technique will be useful: With a medium spoon, gently scoop out one of the yolks and place it into the hole of the avocado. Then continue spooning the egg whites into the avocado hole till it's full. Repeat for both avocado halves.",
    "Add salt and fresh cracked black pepper on top of the eggs, to taste.",
    "Gently place the baking dish in oven and bake for about 15 minutes. Baking time will vary depending on how much egg you have and how big your avocado is. So keep checking the egg to see if it's cooked to your desired consistency.",
    "Sprinkle crumbled bacon on top. Spread the avocado/egg onto toast. Add addition salt and pepper to taste, chopped tomatoes, hot sauce, if needed. Enjoy!"
  ],
  "ingredients": [
    "0",
    "1 medium or large avocado",
    "2 small eggs",
    "2 sliced of bacon, cooked then crumbled",
    "2 slices of toast",
    "sea salt, to taste",
    "fresh cracked black pepper, to taste",
    "hot sauce, optional",
    "fresh chopped tomatoes, optional"
  ],
  "__v": 1
}