{
  "hash": "e542007fd22d295a614ad9270a7da9860664149e",
  "title": "Mocha Almond Fudge - Paleo & Vegan",
  "image": "http://i2.wp.com/www.paleorunningmomma.com/wp-content/uploads/2015/07/Mocha-almond-Fudge-8.jpg?resize=900%2C1083",
  "href": "http://www.paleorunningmomma.com/mocha-almond-fudge-paleo-vegan/",
  "extension": "Chrome",
  "firstAdded": "2016-03-13T17:37:21.313000",
  "users": [
    null
  ],
  "keywords": [
    "smooth",
    "almond",
    "butter",
    "tbsps",
    "coconut",
    "oil",
    "cooled",
    "organic",
    "sugar",
    "use",
    "vanilla",
    "change",
    "flavor",
    "cupenjoy",
    "life",
    "dark",
    "chocolate",
    "chips",
    "preferred",
    "brand",
    "fat",
    "canned",
    "milk",
    "instant",
    "coffee",
    "crystals",
    "raw",
    "almonds",
    "salt"
  ],
  "directions": [
    "0",
    "In a medium bowl, combine all ingredients for the Almond Butter Mixture and stir until smooth. Set aside.",
    "In a small saucepan over low heat, combine all ingredients for the Chocolate Candy Mixture while stirring continuously.",
    "Once melted, thick, and shiny, remove from heat and allow to cool a few minutes.",
    "Transfer all of the almond butter mixture into the chocolate candy mixture and stir well with a soft spatula, scraping the sides to fully incorporate all the ingredients.",
    "When the entire mixture is well combined and smooth, spread it evenly into a parchment paper lined 8 x 8 baking dish. Scrape the sides of the saucepan to get every last drop! If adding the chopped almonds, sprinkle them over the top and gently swirl them in with a knife or spatula, then sprinkle the pinch of sea salt over the top.",
    "Cover with plastic wrap and let chill in the refrigerator for 3 hours or in the freezer for an hour until firm. Cut into squares and enjoy!"
  ],
  "ingredients": [
    "0",
    "½ cup smooth almond butter",
    "2 tbsps coconut oil, melted and cooled",
    "2 tbsp organic coconut sugar",
    "1 tsp organic almond extract - you can also use vanilla, though it will change the flavor",
    "1",
    "1 cupEnjoy Life dark chocolate chips - or preferred brand",
    "¼ cup organic coconut oil",
    "¼ cup organic full fat canned coconut milk",
    "¼ cup organic coconut sugar",
    "2 tbsp instant coffee crystals",
    "⅓ cup finely chopped raw almonds*",
    "pinch of fine grain sea salt*"
  ],
  "__v": 1
}