{
  "hash": "0bef7017dc2427148cfebd13c1f9e9cd3ff04824",
  "title": "Butternut Squash Chili with Beef and Beans",
  "image": "",
  "href": "http://juliasalbum.com/2014/10/butternut-squash-and-bean-chili-recipe/",
  "extension": "Chrome",
  "firstAdded": "2016-09-27T19:50:29.720000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat olive oil in a large skillet. Add ground beef and cook until no longer pink. Drain the ground beef of any fat.",
    "To the same pan, add cubed butternut squash, chopped green bell pepper, minced garlic, kidney beans, corn, and canned tomatoes. Use a spoon to break all tomatoes into small bites. Add 2 cups of water. Season with 1 tablespoon chili powder, 1 tablespoon cumin, 1 teaspoon of sugar, and salt to taste (at least 1/2 teaspoon of salt). Mix everything well, and bring to boil. Reduce to simmer. Cook on low simmer for about 20-25 minutes until squash is tender. Remove from heat. Add extra chili powder, if you want more heat. Season with more salt, if necessary.",
    "Serve topped with grated cheddar cheese, chopped green onions, and a dollop of Greek yogurt.",
    "The chili only gets better the longer it sits. If you let it sit for 2 hours, covered, after cooking, it absorbs all the flavors and tastes much better than if you eat it right after it's cooked. It tastes even better the next day, after being refrigerated overnight."
  ],
  "ingredients": [
    "0",
    "1 tablespoon olive oil",
    "1 pound ground beef",
    "1/2 or 1/4 pound butternut squash (1/4 of whole squash), cut into 3/4 inch cubes, or 2 cups chopped squash",
    "1 green bell pepper chopped Coupons",
    "4 garlic cloves, minced",
    "1 can (15 oz) red kidney beans, rinsed",
    "1/2 can (7.5 oz) corn, rinsed",
    "1 can (28 oz) tomatoes (I used peeled tomatoes Cento San Marzano brand)",
    "2 cups water",
    "1 tablespoon chili powder",
    "1 tablespoon cumin",
    "1 teaspoon sugar",
    "salt to taste (at least 1/2 teaspoon)",
    "grated cheddar cheese",
    "chopped green onions",
    "Greek yogurt or sour cream"
  ],
  "__v": 1
}