{
  "hash": "a666af0c860ddb18c9a5f03266b9a2d97cbe89a4",
  "title": "Whole Chicken Soup With Avgolemono & Orzo",
  "image": "http://a.abcnews.com/assets/images/font-sm_off2.gif",
  "href": "http://abcnews.go.com/GMA/recipe?id=10211639&nwltr=GMAR_featureChef_pos1",
  "extension": "Chrome",
  "firstAdded": "2015-04-03T21:29:31.524000",
  "users": [
    null
  ],
  "keywords": [
    "chickens",
    "kosher",
    "salt",
    "cracked",
    "black",
    "pepper",
    "blended",
    "oil",
    "canola",
    "percent",
    "extravirgin",
    "olive",
    "carrot",
    "garlic",
    "smashed",
    "stalks",
    "celery",
    "spanish",
    "onion",
    "bay",
    "leaves",
    "sprigs",
    "thyme",
    "white",
    "wine",
    "water",
    "needed",
    "orzo",
    "avgolemono",
    "eggs",
    "room",
    "separated",
    "lemon",
    "juice",
    "picked",
    "dill"
  ],
  "directions": [
    "0",
    "Preheat the oven to 325 degrees F. Remove the breasts from both chickens and double-wrap in plastic wrap. Place inside a zipper-lock bag, label, and freeze for the next time you make souvlaki. Remove the leg-thigh joints from the chicken, pull off the skin, and discard. Set aside.",
    "Place the chickens in a large roasting pan, season with kosher salt and pepper, and roast for 1 hour, until golden.",
    "In a large, heavy pot, warm the blended oil over medium-high heat. Add all the vegetables and cook until softened but not browned, about 3 to 5 minutes. Add the bay leaves and thyme, then deglaze the pot with the white wine and cook until it completely evaporates. Add the roasted chicken carcasses. Season liberally with kosher salt and pepper. Cover with water by about 2 inches. Bring to a boil, then reduce the heat, cover, and simmer gently for 1 hour. Add 4 leg-thigh pieces and continue to simmer for another 40 to 45 minutes, until the chicken is tender. Skim off the scum that rises at the beginning. Lift out the leg-thigh joints and, when cool enough to handle, pull off and reserve the meat. Discard the carcasses and any stray bones, and skim a little fat from the soup if you like. Bring soup to a boil, add the orzo, and cook for another 8 to 10 minutes.",
    "While the orzo is cooking, make the Avgolemono. Get everything together so you can work quickly. Draw off 2 cups of the chicken broth, without any of the vegetables (or orzo), and return the picked chicken meat to the soup. Slowly drizzle the warm chicken broth into the egg yolks, whisking all the time. Place the egg whites in a food processor and turn it on. When the whites begin to froth, after about 30 seconds, add the lemon juice, keeping the motor running all the time. When the whites are very frothy and thick, another 45 to 60 seconds, add the dill, and process for 10 to 15 seconds more while you season liberally with salt and pepper. Pour in the egg yolk mixture and immediately turn the machine off. Pour the Avgolemono over the soup and serve at once, as it will quickly start to deflate.",
    "*If you will not be serving the soup right away, cook the orzo separately, cool down, and then add, and warm through, just before topping with the Avgolemono.",
    "*For a lighter soup, skip the roasting of the chickens and simply simmer the chicken until tender.",
    "-Courtesy Michael Psilakis, \"How to Roast a Lamb\"",
    "-Food Styled by Karen Pickus"
  ],
  "ingredients": [
    "0",
    "2 (3 1/2-pound) chickens",
    "Kosher salt and cracked black pepper",
    "2 tablespoons blended oil (90 percent canola, 10 percent extra-virgin olive)",
    "1 carrot, finely chopped",
    "4 cloves garlic, smashed and chopped",
    "1 1/2 stalks celery, finely chopped",
    "1/2 Spanish or sweet onion, finely chopped",
    "2 fresh bay leaves or 3 dried leaves",
    "3 large sprigs thyme",
    "1 cup white wine",
    "Water as needed",
    "1 cup orzo",
    "FOR THE AVGOLEMONO",
    "3 large eggs, at room temperature, separated",
    "4 tablespoons lemon juice",
    "1/2 cup small, picked sprigs dill",
    "Kosher salt and cracked black pepper"
  ],
  "__v": 1
}