{
  "hash": "3bdd169fde3b7f82dafbd95ca866dc3c877904bf",
  "title": "Slow-Cooker Chicken and Dumplings",
  "image": "//d3cizcpymoenau.cloudfront.net/images/legacy/36973/detail_SFS_SlowcookerChickenandDumplings-17.jpg",
  "href": "https://www.cookscountry.com/recipes/7246-slow-cooker-chicken-and-dumplings?incode=MKSKZ00L0&ref=search_results_7",
  "extension": "Chrome",
  "firstAdded": "2016-09-30T00:48:55.098000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "FOR THE STEW: Pat chicken dry with paper towels and season with salt and pepper. Heat 1 tablespoon oil in 12-inch nonstick skillet over medium-high heat until just smoking. Brown half of chicken all over, 5 to 8 minutes; transfer to slow cooker. Repeat with 1 tablespoon oil and remaining chicken.",
    "Heat remaining 1 tablespoon oil in now-empty skillet over medium-high heat until shimmering. Add onions, celery, and carrots and cook until soft, 8 to 10 minutes. Stir in garlic, tomato paste, bay leaves, and thyme and cook until fragrant and tomato paste is starting to brown, about 2 minutes.",
    "Stir in flour and cook for 1 minute. Slowly whisk in wine, scraping up any browned bits. Whisk in 1 cup broth and bring to simmer; transfer to slow cooker. Stir remaining 3 cups broth into slow cooker. Cover and cook until chicken is tender, 4 to 6 hours on low. Stir in peas.",
    "FOR THE DUMPLINGS: Whisk flour, baking powder, and salt together in large bowl. Stir in milk and melted butter until just incorporated. Using greased ¼-cup measure, drop 8 dumplings around perimeter of stew. Cover and cook until dumplings have doubled in size, 30 to 35 minutes. Remove bay leaves and serve."
  ],
  "ingredients": [
    "0",
    "STEW",
    "3",
    "pounds boneless, skinless chicken thighs, trimmed and cut into 1-inch pieces",
    "Salt and pepper",
    "3",
    "tablespoons vegetable oil",
    "2",
    "onions, chopped",
    "2",
    "celery ribs, sliced 1/4 inch thick",
    "2",
    "carrots, peeled, quartered lengthwise, and cut into 1/4-inch-thick pieces",
    "4",
    "garlic cloves, minced",
    "1",
    "tablespoon tomato paste",
    "2",
    "bay leaves",
    "1",
    "teaspoon dried thyme",
    "1/4",
    "cup all-purpose flour",
    "1/2",
    "cup dry white wine",
    "4",
    "cups low-sodium chicken broth",
    "1",
    "cup frozen peas",
    "DUMPLINGS",
    "1 3/4",
    "cups all-purpose flour",
    "1",
    "tablespoon baking powder",
    "1",
    "teaspoon salt",
    "1",
    "cup whole milk",
    "4",
    "tablespoons unsalted butter, melted and cooled"
  ],
  "__v": 1
}