{
  "hash": "03ec9c1c4d0eb2d9f258cd6321d88b039c50dc5d",
  "title": "Pizza Swirl Bread",
  "image": "https://images.food52.com/qfVgcAJD8-GBvA9hWWw-9zgreOQ=/753x502/eb1e35c1-3e67-498e-b8ac-a92058080db5--2016-0419_pizza-swirl-bread_james-ransom-019.jpg",
  "href": "https://food52.com/recipes/51577-pizza-swirl-bread",
  "extension": "Chrome",
  "firstAdded": "2018-03-01T01:30:44.189000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Grease a 9- by 5-inch loaf pans with nonstick spray. On a lightly-floured surface, roll out the dough to 1/2-inch-thick rectangle (about 12 by 18 inches in size).",
    "Use a bench knife or offset spatula to help square off the edges of the dough. Dollop the tomato sauce all over the surface of the dough, and spread into an even layer, all the way to the edges.",
    "Sprinkle the oregano and pepper flakes evenly over the sauce. Do the same with the Parmesan, then the mozzarella.",
    "Starting from one of the long sides, begin to roll the dough into a tight spiral. Use your thumbs to prop the dough off the work surface and use your fingers to keep the roll tight while you work.",
    "Use a bench knife or a sharp chef’s knife to cut the roll in half lengthwise (as if you were cutting a tube in half), exposing layers of dough and sauce swirled together (if the dough feels too soft, you can refrigerate it until it's firmed up again before you cut).",
    "Make a large X with the two cut pieces of dough. First, work above where the X is formed, twisting the two pieces of dough together. Try to keep the cut sides facing upwards to expose the layers of dough and sauce. Try to twist tightly, as this will shorten the length of the roll quite a bit!",
    "Continue to twist the pieces below where the X is formed in the same way. Tuck both ends under a bit, and transfer the shaped loaf to the prepared pan (you may have to smush it a bit to make it fit—that’s okay). [Alternatively, you can fold the log in half at the middle, then twist the two legs around themselves—if this makes a loaf that's two long, you can cut it in half and use two loaf pans.]",
    "Cover the surface of the dough with greased plastic wrap, and let rise until nearly double in size, 30 to 45 minutes. Towards the end of rise time, preheat the oven to 350° F.",
    "Brush the surface of the loaf with olive oil, and bake until evenly golden brown, about 35 to 45 minutes (the loaf should have an internal temperature of around 185° F). Cool for 15 minutes in the pan, then invert the loaf onto a cooling rack and cool completely."
  ],
  "ingredients": [
    "0",
    "2 pounds pizza dough",
    "1 heaping cup tomato sauce (such as https://food52.com/recipes/13722-marcella-hazan-s-tomato-sauce-with-onion-and-butter)",
    "1 teaspoon dried oregano",
    "1/2 teaspoon crushed red pepper flakes (or more to taste)",
    "3/4 cup finely grated Parmesan cheese",
    "1 1/2 cups shredded mozzarella cheese",
    "olive oil, as needed"
  ],
  "__v": 1
}