{
  "hash": "81be8485a1a67bc63ae2afec923666cd4dc24098",
  "title": "Braised Pork Ragu Over Pappardelle",
  "image": "",
  "href": "http://www.spoonforkbacon.com/2018/10/braised-pork-ragu-over-pappardelle/",
  "extension": "Chrome",
  "firstAdded": "2018-10-01T22:16:27.371000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 325˚F.",
    "Place a Dutch oven over medium-high heat. Cut pork shoulder into four equal pieces and season all over with salt and pepper. Pour 1 tablespoon oil into Dutch oven and sear pork for 3 to 4 minutes on each side. Remove pork from pan and set aside.",
    "Drain all fat from pot and add remaining oil. Add onion, carrot and celery and sauté for 4 to 5 minutes or until the onions begin to sweat and become slightly translucent. Add garlic and season with salt and pepper. Stir together.",
    "Add herbs and continue to sauté for 3 to 4 minutes.",
    "Add tomato paste and stir together. Lightly season with salt and pepper.",
    "Deglaze pot with wine, making sure to scrape up all the brown bits from the bottom.",
    "Reduce heat to medium and simmer until about 1/2 wine has evaporated.",
    "Add the whole tomatoes, including juices, and stir together, slightly breaking up the tomatoes with the back of a wooden spoon.",
    "Once mixture is simmering again, add pork back into the pot and bring to a boil. Cover pot and place on the lowest shelf in your oven.",
    "Braise pork for about 2 hours or until the pork is fork tender.",
    "Remove pot from oven and finely shred pork with two forks. Adjust seasonings if needed. Cover until ready to use.",
    "Fill a large pot with water and place over high heat.",
    "Once water is boiling, add a small handful of salt followed by pasta. Boil pasta, stirring frequently, until al dente, 5 to 7 minutes. Drain.",
    "Divide pasta into individual bowls and top with a large ladle of ragu. Top with freshly grated Parmesan and serve."
  ],
  "ingredients": [
    "0",
    "Ingredients:",
    "2 1/2 tablespoons vegetable or grapeseed oil, divided",
    "2 pounds boneless pork shoulder, fat trimmed",
    "1/2 yellow onion, diced",
    "2 carrots, peeled and diced",
    "2 celery stalks, trimmed and diced",
    "2 garlic cloves, minced",
    "1 tablespoon minced thyme leaves",
    "2 teaspoons minced sage leaves",
    "1 teaspoon minced rosemary",
    "2 tablespoons tomato paste",
    "1 cup dry red wine",
    "1 (28 ounce) can whole tomatoes",
    "salt and pepper to taste",
    "24 to 30 ounces dry pappardelle"
  ],
  "__v": 1
}