{
  "hash": "76f88dbe54da8b3628a9b822073aa4678ecd77a3",
  "title": "MARGARITA CAKE",
  "image": "http://honestlyyum.com/wp-content/uploads/2016/09/margarita.cake_.6.1.jpg",
  "href": "http://honestlyyum.com/17302/margarita-cake/",
  "extension": "",
  "firstAdded": "2017-07-14T01:40:40.416000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "For the cake",
    "Preheat the oven to 350 degrees F. Line two 9-by-2 inch round cake pans with parchment paper, lightly oil or grease with non-stick spray.",
    "Whisk the flour, baking powder, and salt together, and set aside.",
    "Beat the sugar and eggs on medium speed in the bowl of a stand mixer fitted with the whisk attachment, until the mixture is thickened (about 3 minutes). Beat in the milk, oil, lime zest, and vanilla. Reduce the speed to low and add the flour, baking powder, and salt mixture, mixing until just incorporated. Remove the bowl from the stand mixer and use a spatula to a give a few last good stirs to make sure no flour pockets remain.",
    "Evenly divide the batter between the two prepared pans. Bake in the oven until a cake tester comes out clean, and the top is golden brown. In our oven, two cakes together took about 1 hour. In order to bake evenly, turn the cakes about halfway through the process, approximately 30 minutes into baking.",
    "Meanwhile, while cakes are baking, prepare the tequila-lime syrup. In a small bowl, stir the sugar into the lime juice until the sugar dissolves, then add the tequila. Divide the tequila-lime syrup into two portions (one for each cake).",
    "As soon as the cakes are out of the oven, transfer to a wire rack (keep in pan). Use a skewer to immediately poke holes in each cake, about 1/2 inch to 1 inch apart, and through the depth of the cake. Slowly pour the tequila-lime syrup over the cake, slowing as needed to allow the syrup to soak in. Allow cakes to cool in their pans to room temperature. Make the frosting and the lime curd while the cakes are cooling.",
    "For the frosting",
    "Add the butter and sugar to the bowl of stand mixer. Start the mixer on low to incorporate the ingredients, then turn speed up to medium and mix until light and fluffy (3-4 minutes). Add the Cointreau, and mix again until incorporated.",
    "For the lime curd",
    "In a heavy saucepan whisk together lime juice, sugar, and eggs. Put the pan on medium heat, and whisk in the butter. Whisk constantly until curd is thick and bubbles appear on the surface (about 15 minutes). Strain through a fine mesh strainer and let cool to room temperature.",
    "To assemble",
    "Remove both cakes from pans, and cut each cake evenly into two layers (here’s a good tutorial if you need). I refrigerated both cakes for a couple hours just to firm them up a bit for the layering processes. This isn’t necessary, so if you’re short on time you can skip the fridge, but I’ve found it makes the layers a bit less fragile to handle. Once divided, take the bottom layer of one cake and place it onto your cake stand or serving platter. Using a piping bag, make a border around the edge of the cake with the frosting (see photo above). Fill the space inside the frosting by spreading out ~1/3 of the lime curd evenly across the layer of the cake. Place the next layer of cake on top and repeat this process twice more. Don’t worry if frosting squeezes out the side. In fact, that helps for the naked cake look. Once you reach the top layer of cake, do not put any lime curd (you shouldn’t have any left anyway). Instead, cover the top with frosting and use an icing spatula to spread evenly across the top of the cake, and smooth down the sides with a bit of frosting as well. Don’t feel like you need to use all the frosting. I had some left over. Top with fresh lime wheels (optional) and serve immediately. If not serving immediately, refrigerate for up to 3 days, but make sure to bring to room temperature before serving."
  ],
  "ingredients": [
    "0",
    "For the cake",
    "4 cups flour",
    "3 1/2 teaspoons baking powder",
    "2 teaspoons salt",
    "3 1/4 cups sugar",
    "4 eggs",
    "2 cups milk",
    "1 1/2 cups canola oil",
    "2 tablespoons lime zest",
    "2 teaspoons vanilla",
    "1 cup tequila",
    "1/4 cup fresh lime juice",
    "2 tablespoons sugar",
    "thin lime wheels for garnish",
    "For the lime curd",
    "1 cup lime juice",
    "1 cup sugar",
    "6 eggs",
    "12 tablespoons butter (cut into small pieces)",
    "For the frosting",
    "2 cups butter (room temperature)",
    "3 cups confectioners sugar",
    "1/4 cup Cointreau"
  ],
  "__v": 1
}