{
  "hash": "ab62fa36a25324cd2cff9da08dedc30399293f91",
  "title": "Vegan Swedish Meatballs over Mashed Potatoes + Gravy",
  "image": "",
  "href": "http://www.spoonforkbacon.com/vegan-swedish-meatballs-over-mashed-potatoes-and-gravy/",
  "extension": "Chrome",
  "firstAdded": "2019-02-07T22:08:46.071000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "1. Meatballs: Place a large skillet over high heat. Once skillet is hot add oil. Add mushrooms and saute for 3 to 4 minutes. Add garlic and shallot and continue to saute for an additional 2 to 3 minutes. Lightly season with salt and pepper.",
    "2. Stir in basil and oregano and remove mixture from heat. Set aside and allow mixture to cool, about 10 minutes.",
    "3. Pour mushroom mixture and remaining meatball ingredients into a food processor and pulse until mixture comes together (8 to 12 pulses).",
    "4. Form 1 to 1 1/2 tablespoon sized balls with the mixture and set onto a parchment lined baking sheet. Refrigerate meatballs for about 30 minutes.",
    "5. Remove meatball from refrigerator. Place large skillet over medium heat and add remaining oil. Add meatballs to skillet and sear on each side for 2 to 3 minutes. Remove from heat and lightly season, if needed.",
    "6. Mashed Potatoes: Place potatoes in a large pot and fill with water until potatoes are completely submerged.",
    "7. Place over high heat and boil until potatoes are fork tender, 15 to 20 minutes. Drain and return potatoes back to the pot. Add butter and nut milk and mash until smooth. Season with salt and pepper.",
    "8. Gravy: Place a small pot over medium heat and melt butter. Add garlic and saute for 1 minute. Add flour and onion powder and whisk together. Slowly add stock, while whisking until fully incorporated and no lumps remain. Add soy sauce and season with salt and pepper. Boil gravy for 5 to 7 minutes or until thick enough to coat the back of a wooden spoon.",
    "9. Assemble: Scoop mashed potatoes into a large bowl and top with meatballs. Drizzle gravy over entire dish. Top with fresh thyme leaves, if using. Serve."
  ],
  "ingredients": [
    "0",
    "ngredients:",
    "meatless meatballs:",
    "2 1/2 teaspoons extra virgin olive oil, divided",
    "8 ounces sliced cremini mushrooms",
    "2 garlic cloves, minced",
    "1/2 shallot, minced",
    "1 cup cooked and cooled brown rice",
    "1/4 cup panko breadcrumbs",
    "1/4 cup flour",
    "2 teaspoons minced basil",
    "1 teaspoon minced oregano",
    "1 teaspoon salt",
    "1/2 teaspoon cracked black pepper",
    "mashed potatoes:",
    "2 large russet potatoes, peeled and chopped",
    "3 tablespoons vegan butter of choice",
    "1/4 cup almond or cashew milk",
    "salt and pepper to taste",
    "gravy:",
    "2 tablespoons vegan butter or choice",
    "2 garlic cloves, minced",
    "2 tablespoons flour",
    "1 teaspoon onion powder",
    "1 cup flavorful vegetable stock",
    "1 tablespoon tamari or soy sauce",
    "salt and pepper to taste",
    "fresh thyme leaves, optional garnish"
  ],
  "__v": 1
}