{
  "hash": "9e93207465a5f1cb3f3cdbcfd92ee6874b09d829",
  "title": "Zucchini Corn Chowder",
  "image": "http://alanroettinger.com/vegan/wp-content/uploads/2015/05/Zucchini-Corn-Chowder-header-610x300.jpg",
  "href": "http://alanroettinger.com/2015/05/16/zucchini-corn-chowder/",
  "extension": "Chrome",
  "firstAdded": "2015-05-16T13:47:02.307000",
  "users": [
    null
  ],
  "keywords": [
    "extravirgin",
    "olive",
    "oil",
    "onion",
    "medium",
    "zucchini",
    "potatoes",
    "garlic",
    "unrefined",
    "salt",
    "water",
    "broth",
    "frozen",
    "white",
    "corn",
    "kernels",
    "almond",
    "milk",
    "hot",
    "spanish",
    "smoked",
    "paprika",
    "ears",
    "shucked",
    "cornsilk",
    "roasted",
    "red",
    "pepper",
    "scallions"
  ],
  "directions": [
    "0",
    "Put the oil in a large pot over medium-high heat and add the onion. Cook, stirring often, until the onion softens, about 5 minutes. Add the potato, zucchini, garlic, and salt, and continue stirring until the vegetables begin to stick, about 5 minutes. Add the broth and stir well. Increase the heat to high, bring to a boil, and add the corn kernels. Return to a boil, adjust the heat to maintain a simmer, and cook until the liquid is absorbed and the vegetables are tender, about 20 minutes. Scoop out about half the vegetables and put them in a blender. Add the almond milk and smoked paprika, and process until smooth. Return to the pot.",
    "While the vegetables are cooking, preheat an outdoor grill.* Put the ears of corn on the grill and cook, turning as needed to char evenly on all sides. Remove and wrap in aluminum foil. When cool enough to handle, cut off the kernels. Reserve 2 tablespoons of the kernels and add the rest to the soup, stirring well.",
    "Reserve 2 tablespoons of the diced roasted peppers, and add the rest to the soup, stirring thoroughly. Reheat the soup over medium heat, stirring often. Reserve 2 tablespoons of the scallions and stir the rest into the hot soup, just before serving.",
    "Ladle the soup into bowls. Garnish with the reserved grilled corn, roasted peppers, sliced scallions, and a few pinches of smoked paprika. Serve at once."
  ],
  "ingredients": [
    "0",
    "3 tablespoons extra-virgin olive oil",
    "1 large onion, diced",
    "3 medium zucchini, diced",
    "2 small potatoes, diced",
    "2 cloves garlic, minced",
    "1/2 teaspoon unrefined sea salt",
    "2 cups water or vegetable broth",
    "3 cups fresh or frozen white corn kernels",
    "3 cups almond milk",
    "½ teaspoon hot Spanish smoked paprika, plus more for garnish",
    "2 ears white corn, shucked and cornsilk removed",
    "1 roasted red pepper, diced",
    "8 scallions, thinly sliced"
  ],
  "__v": 1
}