{
  "hash": "ce329a4df9c513dc165cd33580831d9ef8a2f192",
  "title": "Roasted Tomato, Kale, and Sausage Soup",
  "image": "http://saltandwind.com/media/_versions/recipes/150206_kale-sausge-stew-recipe_v__medium.jpg",
  "href": "http://saltandwind.com/recipes/124-roasted-tomato-kale-sausage-and-potato-soup-recipe",
  "extension": "Chrome",
  "firstAdded": "2016-11-18T15:30:14.050000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Heat the oil in a large, heavy-bottomed Dutch oven or pot over medium heat. When it shimmers, add the sausage and cook, turning occasionally, until well browned all over, about 8 minutes. Remove to a plate and set aside.",
    "Return the pan to medium-low heat, add the onion, season with salt and pepper, and cook, stirring occasionally, until golden brown, about 3 minutes. Stir in the celery, garlic, and red pepper flakes and cook until the celery just starts to soften, another 3 minutes. Add the wine and stir with a wooden spoon, scraping up any browned bits on the bottom of the pan and cook until the alcohol smell is gone, about 2 minutes.",
    "Add the broth, tomatoes and their liquid, water, potatoes, and cheese rind (if using) and bring to a boil over high heat. the potatoes, the tomatoes, their juices, and broth and bring to a boil. When the soup boils, reduce the heat to low, partially cover and cook until the potatoes are knife tender, about 15 minutes.",
    "TIP",
    "I always buy Parmigiano-Reggiano cheese with the rind on so that 1) I know it's the authentic stuff 2) I can save the bit of rind and throw it in broths or sauces to add more flavor.",
    "Slice the reserved sausage into 1/2-inch rounds then add it and the kale to the pot. Cook until the sausage is heated through and the kale is wilted, about 5 minutes. Taste, adjust seasoning, grate cheese over the top, as desired, and serve."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "2 tablespoons neutral oil (like grapeseed)",
    "20 ounces fresh (uncooked) Italian-style turkey or pork sausage",
    "2 medium yellow onions small dice",
    "kosher salt and Freshly ground black pepper",
    "4 celery stalks small dice",
    "8 garlic cloves thinly slided",
    "1 teaspoon crushed red pepper flakes",
    "1 cup dry white wine such as a Sauvignon Blanc",
    "4 cups low-sodium vegetable broth, chicken broth, or water",
    "1 (14 ounce) can diced fire-roasted tomatoes",
    "2 cups water",
    "12 ounces small red or buttercream potatoes cut into 1-inch pieces",
    "Piece of Parmigiano-Reggiano cheese rind plus cheese for garnish (optional)",
    "4 ounces kale stemmed and thinly sliced"
  ],
  "__v": 1
}