{
  "hash": "fa7e9ee69384959ccd003f8d551965da173f614b",
  "title": "Zucchini Noodle Chicken Pesto Bowl",
  "image": "http://www.simplyrecipes.com/wp-content/uploads/2016/07/zucchini-noodle-chicken-pesto-bowl-vertical-a-1600.jpg",
  "href": "http://www.simplyrecipes.com/recipes/zucchini_noodle_chicken_pesto_bowl/",
  "extension": "Chrome",
  "firstAdded": "2018-01-15T04:54:20.289000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Cook the chicken breast(s): Sprinkle both sides of the chicken breast(s) with a little salt and the paprika. Heat 1 Tbsp of olive oil on high heat in a large sauté pan. Place the chicken breast(s) in the pan and cook for a minute or two on each side, until well browned.",
    "Lower the heat to low and cover the pan, cook for 2 to 5 more minutes (depending on the thickness of the breast) until the chicken is just cooked through.",
    "Remove the chicken from the pan and let it rest while you make the zucchini noodles.",
    "2 Make zucchini noodles: Use a spiralizer to make zucchini noodles with the zucchini.",
    "3 Sauté the zucchini noodles, garlic: Add another 1 Tbsp of olive oil to the pan you used to cook the chicken and heat it on high heat.",
    "Add the zucchini noodles and the sliced garlic and sauté, stirring often, until the noodles begin to wilt. Sprinkle with 1/4 teaspoon of salt while you cook the zoodles.",
    "When they are just barely cooked and if they are releasing moisture, remove them to a colander placed over a bowl to drain.",
    "4 Slice or cut the chicken into bite-sized pieces.",
    "5 Toss zucchini noodles with pesto: Place the zucchini noodles in a serving bowl and toss with basil pesto.",
    "Serve the zucchini noodles in bowls topped with chicken, tomatoes, and sliced fresh basil leaves."
  ],
  "ingredients": [
    "0",
    "2 Tbsp olive oil",
    "1/2 pound boneless skinless chicken breast(s)",
    "Salt",
    "1/4 teaspoon paprika",
    "2 medium large zucchini (a little more than a pound)",
    "2 garlic cloves, sliced",
    "1/4 cup prepared basil pesto",
    "Handful of cherry tomatoes, cut in half",
    "Several fresh basil leaves, thinly sliced, for garnish"
  ],
  "__v": 1
}