{
  "hash": "7a261999c4a54ac3b3ce52cadff2d16579d1d3af",
  "title": "Chicken Tamales Verdes",
  "image": "",
  "href": "http://www.bonappetit.com/recipe/chicken-tamales-verdes",
  "extension": "Chrome",
  "firstAdded": "2017-06-12T14:47:12.728000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preparation",
    "Chicken Filling",
    "Preheat oven to 425°. Toss tomatillos, peppers, chiles, jalapeños, onion, scallions, garlic, schmaltz, and oregano in a large bowl; season with salt. Spread on a rimmed baking sheet and roast until vegetables are soft and browned, 35–40 minutes. Let cool slightly. Remove garlic clove from peel. Strip oregano leaves from sprigs; discard sprigs.",
    "Transfer tomatillo mixture along with any accumulated juices on baking sheet, garlic, oregano leaves, vinegar, coriander, and cumin to a blender and purée until smooth; season with salt. Transfer 1¾ cups tomatillo purée to a large bowl. Add chicken and toss to coat; season with salt. It should resemble a slightly overdressed chicken salad; add more tomatillo purée if needed (reserve ¼ cup purée for masa). Transfer to an airtight container and chill until chicken is cold and firm, at least 3 hours.",
    "Do Ahead: Filling can be made 3 days ahead. Keep chilled.",
    "For Instant Dry Masa",
    "Mix corn masa flour, stock, schmaltz, salt, baking powder, and ¼ cup reserved tomatillo purée in a large bowl with your hands until dough comes together. Continue to knead until mixture looks smooth and shiny, about 4 minutes.",
    "Slap top of masa with the palm of your hand, immediately pulling your hand back; if dough sticks to your hand, add 2 Tbsp. more lard and knead to incorporate. Repeat slap test. If masa doesn’t stick and your hand looks shiny, dough is ready. If masa sticks, continue adding lard 2 Tbsp. at a time and repeat slap test. Let dough sit 30 minutes, uncovered, until the consistency of peanut butter; it will thicken as it sits.",
    "For Fresh Masa",
    "Mix corn masa, schmaltz, stock, salt, and ¼ cup reserved tomatillo mixture in a large bowl with your hands until incorporated and mixture looks smooth and shiny, about 4 minutes.",
    "Slap top of masa with the palm of your hand, immediately pulling your hand back; if dough sticks to your hand, add 2 Tbsp. more lard and knead to incorporate. Repeat slap test. If masa doesn’t stick and your hand looks shiny, dough is ready. If masa sticks, continue adding lard 2 Tbsp. at a time and repeat slap test.",
    "Assembly",
    "Soak husks in a large bowl of hot water until soft and pliable, about 15 minutes. Using your hands, swirl husks in water to loosen any silk and dirt clinging to surface. Drain, rinse, and shake off excess water.",
    "Working one at a time, place husk on a clean work surface and gently stretch out wide end. Measure 5\" wide, then tear off any excess (hold onto the scraps; you’ll use them later). The width doesn’t have to be exactly 5\", but if you go narrower than that, your tamale might be too small to cover the filling. This recipe makes about 30 tamales, but you may want to have extra husks prepared in case a few tear.",
    "Arrange husk so wide end is closet to you. Spoon 2 heaping Tbsp. masa (or use a 1⅓-oz. ice cream scoop) about 4\" from the bottom. Using a butter knife, small offset spatula, or putty knife, spread masa in a thin, even layer, covering width of husk and going about 5\" up the sides, leaving narrow end uncovered. If you mess up, just scrape masa off husk and start over (no one will ever know!). Repeat with remaining masa and husks.",
    "Keeping wide end closest to you, place 2 Tbsp. cold chicken filling in the center of masa, forming a log that runs down the center. Fold 1 side of husk over filling, then fold other side over to cover. Holding tamale seam side up, fold narrow, pointed end of husk away from you and tuck under tamale. Transfer to a rimmed baking sheet. Repeat with remaining tamales.",
    "Line bottom of a large heavy pot with husk scraps. Crumple a large sheet of foil to form a 3\"-diameter ball. Place ball in pot. Using ball as support, prop tamales upright, with folded end down and seam side facing out, until ball is surrounded (this will take 4–6 tamales). Continue stacking tamales around the center, leaning them against one another. Pour 3 cups broth into pot, being careful not to get any inside tamales (broth will come about ¾\" up sides of tamales).",
    "Bring liquid to a boil over high heat, then reduce heat to medium-low. Cover pot and simmer tamales, undisturbed, adding more broth as needed to keep some liquid in the pot, 40 minutes. Remove 1 tamale and let cool about 3 minutes. (If you don’t let the tamale rest before checking, the masa is guaranteed to stick to the husk and appear gummy, so you really have to wait.) Remove husk; if masa sticks to husk, it’s not ready. Carefully re-fold and return to pot. Cook 5 minutes, then check again. If husk is easily removed, your tamales are fully cooked! Remove from heat and let sit, uncovered, 10 minutes. Serve with salsa and a squeeze of lime."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "MAKES ABOUT 30",
    "Chicken Filling",
    "4 large tomatillos (or 6 medium), husks removed, rinsed",
    "3 cubanelle or banana peppers, halved, seeded, stemmed",
    "3 poblano chiles, halved, seeded, stemmed",
    "3 jalapeños, halved, seeded, stemmed",
    "¼ medium onion",
    "4 scallions, trimmed",
    "3 garlic cloves, unpeeled",
    "⅓ cup schmaltz or lard, melted, cooled",
    "3 sprigs oregano",
    "Kosher salt",
    "2 teaspoons white wine vinegar",
    "1 teaspoon ground coriander",
    "1 teaspoon ground cumin",
    "1 rotisserie chicken, skin removed, meat coarsely chopped",
    "If Using Instant Dry Masa",
    "3¾ cups instant corn masa flour (such as Maseca Tamal Instant Corn Masa Mix)",
    "2 cups homemade chicken stock or low-sodium chicken broth",
    "1¼ cups plus 2 tablespoons lard, melted, plus more if needed",
    "1 tablespoon kosher salt",
    "1½ teaspoons baking powder",
    "If Using Fresh Masa",
    "3 pounds “unprepared” fresh corn masa for tamales",
    "1¼ cups plus 2 tablespoons lard, melted, plus more if needed",
    "¼ cup homemade chicken stock or low-sodium chicken broth",
    "1 tablespoon kosher salt",
    "Assembly",
    "30 corn husks (from a 1-pound bag)",
    "3 cups omemade chicken stock or low-sodium chicken broth, plus more",
    "Fresh salsa and lime wedges (for serving)"
  ],
  "__v": 1
}