{
  "hash": "a59b37c94e71c9519fe1bba3f5cc7f223af635a2",
  "title": "Creole Dirty Rice - Clean Eating",
  "image": "http://www.food.com/recipe/",
  "href": "http://www.food.com/recipe/creole-dirty-rice-clean-eating-453711",
  "keywords": [
    "brown",
    "rice",
    "lean",
    "turkey",
    "sausage",
    "smoked",
    "deli",
    "olive",
    "oil",
    "flavored",
    "cooking",
    "spray",
    "medium",
    "yellow",
    "onion",
    "green",
    "bell",
    "pepper",
    "cored",
    "seeded",
    "garlic",
    "mined",
    "red",
    "beans",
    "soaked",
    "overnight",
    "water",
    "covered",
    "pot",
    "bay",
    "leaf",
    "tomatoes",
    "preferably",
    "roma",
    "cajun",
    "seasoning",
    "salt",
    "cilantro"
  ],
  "directions": [
    "0",
    "Cook brown rice according to package directions. Remove from heat and set aside.",
    "In a medium-size pot, cover sausage with about 3 inches of water. Bring to a boil, then allow to boil for 10 minutes. Remove from heat, drain and let cool for 5 minutes before slicing sausage.",
    "Heat a large pot over medium-high heat. Mist with cooking spray and add onion, green pepper and garlic. Saute for about 5 minutes or until vegetables are cooked through. Drain soaked beans and rinse with cold water. Add beans, bay leaf and 3 cups water to pot with vegetables. Bring to a boil, then let boil for 20 minutes before reducing heat to medium-low. Cook until beans are soft, stirring occasionally and adding more water as it evaporates, about 2 hours. When beans are cooked through and water has reduced to less than 1 cup, add tomatoes and cook for at least 15 more minutes.",
    "Remove bay leaf. Stir in Cajun seasoning, (and cayenne pepper if using), cooked rice and sausage and cook for about 10 minutes. Season with salt and pepper and garnish with cilantro before serving.",
    "Tip: Since red beans can give your Creole Dirty Rice a dark hue, you can keep your soaked beans and rice mixture separate and mixing them together just before serving.",
    "Note: If using canned beans make sure to rinse and drain them well before using. You will only need to warm them up for about 5 to 10 minutes instead of cooking them for 2 hours. And , you can reduce the water from 3 cups to 1/2 cup."
  ],
  "ingredients": [
    "0",
    "1 cup brown rice",
    "1 cup brown rice",
    "7 ounces lean turkey sausage, smoked, deli fresh",
    "7 ounces lean turkey sausage, smoked, deli fresh",
    "olive oil flavored cooking spray",
    "1 medium yellow onion, diced",
    "1 medium yellow onion, diced",
    "1 green bell pepper, cored, seeded and diced",
    "1 green bell pepper, cored, seeded and diced",
    "3 garlic cloves, mined",
    "3 garlic cloves, mined",
    "8 ounces dried red beans, soaked overnight in water in a covered pot",
    "8 ounces dried red beans, soaked overnight in water in a covered pot",
    "1 bay leaf",
    "1 bay leaf",
    "2 tomatoes, preferably Roma, cored, seeded and finely chopped",
    "2 tomatoes, preferably Roma, cored, seeded and finely chopped",
    "1 1/2 teaspoons cajun seasoning",
    "1 1/2 teaspoons cajun seasoning",
    "sea salt, to taste",
    "pepper, to taste",
    "4 tablespoons fresh cilantro, minced",
    "4 tablespoons fresh cilantro, minced"
  ],
  "__v": 0
}