{
  "hash": "6ae951cb66441d6a16f2cb123411ad437c0be4a4",
  "title": "Bacon Blue Potato Salad with Soft Boiled Eggs",
  "image": "http://www.howsweeteats.com/wp-content/uploads/2015/06/potato-salad-4.jpg",
  "href": "http://www.howsweeteats.com/2015/06/bacon-blue-potato-salad-with-soft-boiled-eggs/",
  "extension": "Chrome",
  "firstAdded": "2015-07-03T03:53:52.894000",
  "users": [
    null
  ],
  "keywords": [
    "baby",
    "red",
    "potatoes",
    "cherry",
    "tomatoes",
    "scallions",
    "slices",
    "bacon",
    "crumbled",
    "blue",
    "cheese",
    "fave",
    "variety",
    "chives",
    "eggs",
    "herb",
    "vinaigrette",
    "wine",
    "vinegar",
    "honey",
    "basil",
    "oregano",
    "rosemary",
    "parsley",
    "salt",
    "pepper",
    "garlic",
    "pressed",
    "olive",
    "oil"
  ],
  "directions": [
    "0",
    "Place the potatoes in a pot and fill it with cold water. Bring it to a boil and cook for about 15 minutes - just until the potatoes are fork tender. This will differ based on the side of your potatoes, but you don't want them mushy or falling apart. You want them slightly firm so they hold up in the salad. Slice the potatoes in half or in quarters - depending on their size and how you'd like them. Place them in a large bowl to cool.",
    "Heat about 3 inches of water in a small saucepan pver medium heat until boiling. Once boiling, reduce the heat until it's barely at a simmer, add the eggs gently and cook for 6 minutes. Remove the eggs with a slotted spoon and place in an ice bath. Let cool completely before peeling.",
    "Add the tomatoes and scallions to the potatoes. Toss the potatoes, tomatoes and scallions with a few tablespoons of the vinaigrette - enough to thoroughly coat the potatoes. Add the crumbled bacon in along with the blue cheese. You can add a little more vinaigrette here if desired. Top with the soft boiled eggs - whole or cut in half, however you wish to serve. Drizzle a bit more vinaigrette on top and add the chives (and any other herbs you'd like). Serve immediately.",
    "herb vinaigrette",
    "In a bowl, whisk together the vinegar, honey, herbs, salt, pepper and garlic. While whisking constantly, stream in the olive oil. Your vinaigrette is done! If you don't use it all, it holds up in the fridge for a few days (just watch the fresh herbs)."
  ],
  "ingredients": [
    "0",
    "3 pounds baby red potatoes",
    "1 1/2 cups cherry tomatoes, quartered",
    "4 scallions, thinly sliced",
    "8 slices cooked bacon, crumbled",
    "6 ounces blue cheese (your fave variety!), crumbled",
    "3 tablespoons freshly sliced chives",
    "3 or 4 large eggs",
    "herb vinaigrette",
    "3 tablespoons red wine vinegar",
    "1 1/2 tablespoons honey",
    "2 tablespoons chopped fresh basil",
    "1 tablespoon chopped fresh oregano",
    "1 tablespoon chopped fresh rosemary",
    "1 tablespoon chopped fresh parsley",
    "1/4 teaspoon salt",
    "1/4 teaspoon pepper",
    "2 garlic cloves, minced or pressed",
    "1/3 cup olive oil"
  ],
  "__v": 1
}