{
  "__v": 1,
  "directions": [
    "0",
    "Per le tagliatelle: Su una spianatoia versate la farina a fontana e fate un buco al centro, rompete le uova all'interno e insaporite con un pizzichino di sale.Iniziate ad impastare le uova con una forchetta prendendo piano piano la farina intorno.",
    "Appena il composto risulterà bello compatto cominciate a lavorarlo con le mani fino ad ottenere un panetto sodo che farete riposare per una ventina di minuti coperto da una ciotola.",
    "Riprendete il panetto stendetelo con il matterello in una sfoglia sottile, cercando di ottenere una sfoglia tonda che piegherete su se stessa.",
    "Con un coltello liscio tagliate perpendicolarmente alla lunghezza della sfoglia le vostre tagliatelle con tagli decisi a distanza di 6/7mm.",
    "Allargate le tagliatelle sulla tavola da lavoro infarinata e lasciatele asciugare.",
    "Per il ragù:",
    "Sbriciolate la salsiccia fresca e la carne macinata; in una padella mettete un paio di cucchiai di olio con la carota tagliata a quadratini molto piccoli e aggiungete la carne di maiale e di bovino ( eviatate a questo punto di salarla perchè già la salsiccia è condita).",
    "In un altra padella fate leggermente soffriggere un aglio pulito, aggiungete un po' di prezzemolo sminuzzato e infine il porcino tagliato a cubetti, salate e fate cuocere per 6/8 minuti.",
    "Quando il fungo sarà cotto aggiungetelo nella padella con la carne e mescolate per bene facendo amalgamare gli ingredienti.",
    "Cuocete le tagliatelle in una pentola molto larga in acqua salata; quando l'acqua bolle buttate le tagliatelle e toglietele appena le vedete tornare a galla. Scolate le tagliatelle e versatele direttamente nella padella del condimento,date una bella girata e impiattate.",
    "Aggiungete su ogni piatto il prezzemolo sminuzzato fresco."
  ],
  "firstAdded": "2014-10-10T11:57:39.328000",
  "hash": "e8df6bc3bed264d72c6552296072187cf3136bf4",
  "href": "http://www.cappuccinoecornetto.com/2012/01/tagliatelle-con-ragu-bianco-e-porcini.html",
  "image": "http://www.cappuccinoecornetto.com/blog/wp-content/uploads/2012/01/Tagliatelle_ragu_porcini3.jpg",
  "ingredients": [
    "0",
    "Per la pasta:",
    "220 g di farina ( 100 g di farina 0, 120 g di Semola rimacinata di Grano duro)",
    "2 uova",
    "1 pizzico di sale",
    "Per il ragù:",
    "1 salsiccia macinata",
    "100 g di macinato di bovino",
    "1 fungo porcino di piccole dimensioni",
    "aglio,olio,carota",
    "prezzemolo",
    "sale"
  ],
  "keywords": [
    "pasta",
    "farina",
    "semola",
    "rimacinata",
    "grano",
    "duro",
    "uova",
    "pizzico",
    "sale",
    "rag",
    "salsiccia",
    "macinata",
    "macinato",
    "bovino",
    "fungo",
    "porcino",
    "piccole",
    "dimensioni",
    "agliooliocarota",
    "prezzemolo"
  ],
  "title": "Tagliatelle con ragù bianco e porcini",
  "users": [
    null
  ]
}