{
  "hash": "dec1056ca90eee618d147c74d3fc14cdcfde2cea",
  "title": "Baked Stuffed Flank Steak",
  "image": "http://homemadehooplah.com/wp-content/uploads/2015/04/baked-flank-steak-1.jpg",
  "href": "http://homemadehooplah.com/recipes/baked-stuffed-flank-steak/",
  "extension": "Chrome",
  "firstAdded": "2015-06-20T07:04:15.915000",
  "users": [
    null
  ],
  "keywords": [
    "flank",
    "steak",
    "butterflied",
    "panko",
    "bread",
    "crumbs",
    "egg",
    "yolk",
    "mozzarella",
    "cheese",
    "spinach",
    "frozen",
    "pkg",
    "thawed",
    "rinsed",
    "sun",
    "tomatoes",
    "roughly",
    "garlic",
    "salt",
    "divided",
    "pepper",
    "olive",
    "oil"
  ],
  "directions": [
    "0",
    "Preheat oven to 425F.",
    "If you have not already done so, butterfly your steak by lining your knife up parallel with a cutting board and slicing through the center of the steak, stopping just short of cutting all the way through. This will make it so that you can open up the steak like sandwich bread, doubling the original length of the steak. Need a visual guide? Check out this video. Tip: If picking up a steak from a deli, ask if they will butterfly it for you. Also, some grocery stores might sell flank steaks that have already been butterflied. Check the prepared meats - butterflied steaks are typically rolled up (will look like a log) with a tight seal.",
    "Using a meat mallet, even out the thickness of the steak, aiming for 1/4 to 1/2 inch thick.",
    "In a large bowl, add egg yolk and lightly whisk with a fork. Add spinach and panko bread crumbs, mixing with the egg. Finish off by tossing in the mozzarella and sun dried tomatoes until all ingredients are thoroughly mixed.",
    "Top butterflied steak with cheese stuffing, spreading it out evenly. Leave a 1 inch border along the edges of the steak clear of stuffing. Sprinkle top of stuffing with 1/4 teaspoon garlic salt and pepper to taste.",
    "Roll the steak along the \"grain\" (the ripples in the meat), starting with the smallest end first. Roll the steak tightly and tuck in any stray pieces.",
    "Using cooking twine (100% cotton string), snugly loop & tie the twine along the steak in 2 inch intervals. String should be snug enough to slightly compress meat but not so tight it begins to cut into the steak.",
    "Place stuffed & tied flank steak on a baking sheet of your choice (I used a 9x13 baking dish). Drizzle the steak with olive oil and use your fingers to thoroughly rub it into the meat. Sprinkle remaining 1/4 teaspoon garlic on top of the steak.",
    "Bake in the oven for 35 minutes, then set oven to broil and cook for another 5-10 minutes, to taste. Caution: Depending on how much juice the steak released while cooking, there may be a little smoke while broiling.",
    "Remove stuffed flank from oven and let rest for 15 minutes, exposed to air and undisturbed, before serving."
  ],
  "ingredients": [
    "0",
    "1-2 lb flank steak butterflied",
    "2 tbsp panko bread crumbs",
    "1 egg yolk",
    "1 and 1/2 cup mozzarella cheese grated or shredded",
    "1 cup spinach frozen pkg - thawed, rinsed, and well drained",
    "1/2 cup sun dried tomatoes roughly chopped",
    "1/2 tsp garlic salt divided",
    "1 pinch pepper to taste",
    "2 tbsp olive oil"
  ],
  "__v": 1
}