{
  "hash": "cdb05d6f5cd26d87c86eebdb5ece2dd334392672",
  "title": "Rhubarb cobbler",
  "image": "http://fiveandspice.com/wp-content/uploads/2014/07/rhubarb-cobbler-1.jpg",
  "href": "http://fiveandspice.com/2014/07/11/rhubarb-cobbler/",
  "extension": "Chrome",
  "firstAdded": "2015-06-09T22:30:12.101000",
  "users": [
    null
  ],
  "keywords": [
    "filling",
    "rhubarb",
    "stalk",
    "pieces",
    "sugar",
    "dark",
    "brown",
    "salt",
    "vanilla",
    "tbs",
    "cornstarch",
    "purpose",
    "flour",
    "baking",
    "cold",
    "butter",
    "chunks",
    "cream",
    "couple",
    "necessary",
    "milk",
    "use",
    "whipped",
    "ice"
  ],
  "directions": [
    "0",
    "Heat your oven to 35oF.",
    "For the filling, toss together the rhubarb, white and brown sugar, pinch of salt, vanilla, and cornstarch and dump it into a baking pan large enough to hold it in about a 2-inch deep layer.",
    "To make the topping, combine the flour, salt, baking powder, and sugar in a bowl. Rub the butter in with your fingertips until only pea-sized chunks remain. Add the cream and ¼ cup of milk, and stir everything together. Add enough extra milk for everything to come together into a shaggy, fairly sticky dough. Drop the dough in large spoonfuls over the top of the filling.",
    "Bake in the oven until the topping is browned and cooked through and the rhubarb is bubbling, about 40-45 minutes. Remove from the oven and allow to cool for at least 30 minutes (mainly so you don't scald the inside of your mouth!). Serve with whipped cream or vanilla ice cream."
  ],
  "ingredients": [
    "0",
    "Filling:",
    "about 6 cups of chopped rhubarb stalk, in 1 inch pieces",
    "1 cups sugar",
    "½ cup packed dark brown sugar",
    "pinch of salt",
    "1 tsp. vanilla",
    "1 Tbs. cornstarch",
    "Topping:",
    "1¾ cups all purpose flour",
    "½ tsp. salt",
    "3 tsp. baking powder",
    "2 Tbs. sugar",
    "5 Tbs. cold butter, cut into small chunks",
    "½ cup cold heavy cream",
    "¼ cup, plus a couple Tbs. as necessary, cold milk (or you can use all cream)",
    "whipped cream or ice cream for serving"
  ],
  "__v": 1
}