{
  "hash": "a802c89b68fb503c354c8a9be091f2745080e0a3",
  "title": "Soft and Light as Air Japanese Cheesecake",
  "image": "http://sugarywinzy.com/wp-content/uploads/2015/12/SugaryWinzy-Soft-and-Light-as-Air-Japanese-Cheesecake10.jpg",
  "href": "http://sugarywinzy.com/soft-and-light-as-air-japanese-cheesecake/",
  "extension": "Chrome",
  "firstAdded": "2017-01-09T19:44:36.753000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Separate the eggs. Place the egg whites in the bowl of a stand mixer. Make sure the bowl is clean, dry and devoid of any trace of fat. Set aside to bring to room temperature. If you have only one mixer bowl place the egg whites in any other clean bowl and set aside.",
    "Spray with non-stick cooking spray an 8-inch x 3-inch round cake pan. A 9-inch x 3-inch round cake pan will also work. Pre heat the oven to 325° F.",
    "Melt together the cream cheese, butter and milk in the microwave. Stir every 60 seconds and repeat 2 or 3 times until the butter and cream cheese are melted. Transfer the cream cheese mixture into a bowl of a stand mixer and beat with the flat beater attachment to smooth out any small remaining lumps of cream cheese. Mix until completely smooth.",
    "Sift the flour, corn starch and salt together.",
    "Stop the mixer. Add the following ingredients to the cream cheese mixture: sifted dry ingredients, ¼ cup sugar (55 g), egg yolks and lemon juice. Start the mixer and, all at the same time, blend the added ingredients well with the cream cheese mixture. Beat until smooth and free of lumps and the batter falls in a ribbon. Set aside. If you have only one stand mixer bowl, transfer the batter to another large bowl and wash the mixer bowl very well in hot sudsy water making sure no trace of fat remains, in preparation for whipping the egg whites.",
    "Whip the egg whites with the wire whip of a stand mixer on medium speed. When the meringue starts to take shape add the cream of tartar. Gradually add ½ cup sugar (110 g). Whip until meringue turns glossy, has increased in volume and holds medium peaks.",
    "Take a dollop of meringue and fold it in by hand with a spatula into the cream cheese batter to slacken the mixture. Take a third of the meringue and add it to the batter. Cut and fold the meringue swiftly but gently to minimize deflating the meringue. In one motion, cut the center all the way down to the bottom of the bowl and fold the batter over the meringue. Scrape the bottom and sides of the bowl as you fold up. Repeat with several strokes until the meringue is blended. Fold in the next ⅓ of meringue, mixing until blended. Fold in the last ⅓ of meringue making sure all the meringue is completely blended. The resulting batter at this point should be light and airy.",
    "Pour the cheesecake batter into the cake pan. Place the cake pan in the larger dish, then place both in the oven. Pour hot water into the water bath until about half way up the sides of the cake pan. Be careful not to splash water into the batter.",
    "Bake for 60 minutes at 325°F. Decrease the temperature to 320°F and bake for an additional 10 minutes. Turn off oven and leave the cheesecake in the oven with the door closed for 30 – 45 minutes.",
    "Turn out the cheesecake from the pan onto a cake plate and serve. Store in the fridge in an airtight container."
  ],
  "ingredients": [
    "0",
    "6 large eggs",
    "1",
    "1 cup + 2 tablespoons cream cheese (260 g)",
    "4 tablespoons unsalted butter (57 g)",
    "7 tablespoons milk (96 g)",
    "2",
    "¾ cup cake flour (88 g)",
    "2 ½ tablespoons + 1 teaspoon corn starch (28 g)",
    "¼ teaspoon salt",
    "3",
    "1 ½ tablespoons + 1 teaspoon lemon juice (23 g)",
    "¼ teaspoon cream of tartar",
    "¾ cup granulated sugar (165 g)",
    "4",
    "One 8-inch x 3-inch OR 9-inch x 3-inch round cake pan",
    "Water bath (bain marie) - baking dish or pan large enough to hold the cake pan (I used a roasting / lasagna pan) to be filled with hot water"
  ],
  "__v": 1
}