{
  "hash": "f9092ed22af0fb9aa118c775cd64592be00281be",
  "title": "VEGAN MALAI KOFTA (POTATO DUMPLINGS IN SPICED TOMATO SAUCE) [VEGAN, GLUTEN-FREE]\nTHIS RECIPE IS :\nDairy FreeVeganWheat Free",
  "image": "http://cdn.onegreenplanet.org/wp-content/uploads/2010/10//2014/12/malai-kofta-575x262.jpg",
  "href": "http://www.onegreenplanet.org/vegan-recipe/vegan-malai-kofta-potato-dumplings-in-spiced-tomato-sauce/",
  "firstAdded": "2015-01-05T12:52:56.466000",
  "users": [
    null
  ],
  "keywords": [
    "russet",
    "potato",
    "unpeeled",
    "carrot",
    "peas",
    "frozen",
    "cashews",
    "cilantro",
    "salt",
    "turmeric",
    "black",
    "pepper",
    "cumin",
    "chickpea",
    "flour"
  ],
  "directions": [
    "0",
    "PREPARATION",
    "Preheat oven to 450 degrees. Bring a medium pot of water to boil and add potatoes and carrots, cook for 10-15 minutes until easily mashable with a fork. Add peas and cook 1-2 minutes more, then drain water and transfer to a large mixing bowl to cool.",
    "Meanwhile start sauce in a deep skillet, sauté pan or wok. Heat 1 Tbsp of medium-high heat oil over medium heat. Add cumin seeds and cook until they begin to sizzle. Add onion, ginger, and serrano pepper if using. Cook for 3-4 minutes, stirring occasionally until onion begins to brown. Add tomatoes and cook for 3-4 minutes more. Transfer mixture to a blender (or food processor) and carefully blend until smooth. Return to pan and add remaining ingredients, saving water for the end and adding as much as you need to make a nice gravy consistency (it will continue to thicken as it cooks). Combine ingredients and stir well, let it bubble gently over low heat while you prepare koftas. If too watery, you can add additional cashew powder to thicken it.",
    "Add remaining ingredients to koftas, stir and a thick dough will form. Oil a metal baking sheet and form koftas into golf ball sized balls, placing a few inches apart on sheet. Bake at 450 degrees for 10-12 minutes until crispy on the bottom and flip over. Bake an additional 10-15 minutes until crispy on all sides.",
    "When koftas are done, drop them in the heated gravy and serve immediately with rice or bread of your choice"
  ],
  "ingredients": [
    "0",
    "2 cups russet potato, unpeeled and chopped",
    "1/2 cup carrot, chopped",
    "1/2 cup peas, frozen",
    "2 Tbsp toasted cashews, finely chopped",
    "1/4 cup fresh cilantro, chopped",
    "1/2 tsp salt, or to taste",
    "1/4 tsp turmeric",
    "1/4 tsp black pepper",
    "1/4 tsp ground cumin",
    "1/2 cup chickpea flour"
  ],
  "__v": 1
}