{
  "hash": "1551cb56411b926928664bc3c5e7c59380a4bf37",
  "title": "Vanilla butter biscuits",
  "image": "http://img.taste.com.au/-t81rykj/w720-h480-cfill-q80/taste/2016/11/vanilla-butter-biscuits-21007-1.jpeg",
  "href": "http://www.taste.com.au/recipes/vanilla-butter-biscuits-2/811a10b1-6a4d-46b5-9f38-5f1df79619ca",
  "extension": "",
  "firstAdded": "2017-02-28T08:15:38.007000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "METHOD",
    "Step 1",
    "Line 2 baking trays with non-stick baking paper or use non-stick trays. Use an electric beater to beat the butter, sugar and vanilla essence in a medium bowl, scraping down the side of the bowl when necessary, until just combined.",
    "Step 2",
    "Sift the self-raising and plain flours together into a bowl. Add half the sifted flours to the butter mixture and use a wooden spoon to mix until combined. Add the milk and mix well.",
    "Step 3",
    "Add the remaining sifted flours and, when the mixture becomes difficult to mix with the wooden spoon, use your hand. Mix with your hand until the mixture forms a soft dough that leaves the side of the bowl and doesn't stick to your hand. If the mixture is a little dry, add an extra 1 tablespoon of milk. (There should be no dry bits of dough in the bottom of the bowl.)",
    "Step 4",
    "Roll tablespoonfuls of the dough into balls and then place the balls about 4cm apart on the lined trays.",
    "Step 5",
    "Use a floured fork to flatten the biscuits slightly. Dip the fork in a little flour every second or third ball. (You can also flatten the balls with a lightly floured hand or fingers, the base of a glass or the side of a grater. Any decorative edge can be used to press a pattern into the top of them.) Place the trays in the fridge for 20 minutes to chill."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "125g unsalted butter, cubed, at room temperature",
    "80g (1/3 cup) caster sugar",
    "1 teaspoon vanilla essence",
    "115g (3/4 cup) self-raising flour",
    "100g (2/3 cup) plain flour",
    "2 tablespoons milk"
  ],
  "__v": 1
}