{
  "hash": "24b58510b12f43e9cad8e54f591a64d5f35ba0d6",
  "title": "Baked Rigatoni With Tomatoes, Olives and Pepper",
  "image": "http://graphics8.nytimes.com/images/2015/11/25/dining/25MARTHA/25MARTHA-articleLarge.jpg",
  "href": "http://cooking.nytimes.com/recipes/1017830-baked-rigatoni-with-tomatoes-olives-and-pepper",
  "extension": "Chrome",
  "firstAdded": "2016-04-22T14:18:30.146000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "PREPARATION",
    "Pulse tomatoes with juice in a food processor to a coarse purée. Put a large pot of water on to boil.",
    "In a large heavy skillet, heat 2 tablespoons olive oil over medium heat and add yellow pepper. Cook, stirring often, until tender, 5 to 8 minutes. Add garlic, thyme and red pepper flakes. Cook, stirring, until fragrant, 30 seconds to a minute.",
    "Add tomatoes, sugar and salt to taste, and turn up heat to medium-high. When tomatoes begin to bubble briskly and sputter, turn heat to medium. Cook, stirring often, until tomatoes have cooked down to a fragrant, thick sauce, about 15 minutes. Add olives, black pepper and basil, stir together, taste and adjust seasoning.",
    "Heat oven to 350 degrees. Oil a 2 1/2- to 3-quart baking dish or gratin with olive oil.",
    "When water in pot comes to a boil, salt generously and add rigatoni. Cook al dente, removing from the water 1 minute sooner than indicated in the package instructions. (Reserve some of the cooking water.) Transfer pasta to a large bowl.",
    "If the tomato sauce seems very thick, thin out as desired with 2 to 4 tablespoons pasta cooking water. Scrape into bowl with pasta, add cheeses and toss well. Scrape into prepared baking dish. Drizzle remaining 1 tablespoon olive oil over the top. Cover with foil.",
    "Bake 25 minutes. Uncover and continue to bake another 5 to 10 minutes, until bubbly and beginning to brown in spots. Serve hot.",
    "Tip",
    "Dish can be assembled (through Step 6) a day in advance and refrigerated. Add 5 to 10 minutes baking time if transferring directly from refrigerator to oven."
  ],
  "ingredients": [
    "0",
    "INGREDIENTS",
    "1 (28-ounce) can tomatoes, whole or diced, with juice",
    "3 tablespoons extra-virgin olive oil, more for oiling baking dish",
    "1 large sweet yellow pepper, cut in 1/2-inch dice",
    "2 garlic cloves, minced",
    "1 teaspoon fresh thyme leaves or 1/2 teaspoon dried thyme",
    "½ teaspoon red pepper flakes",
    "⅛ teaspoon sugar",
    "Salt",
    "⅓ cup kalamata olives, pitted and halved",
    "Black pepper",
    "2 tablespoons slivered fresh basil (optional)",
    "1 pound rigatoni",
    "3 ounces Gruyère, grated (3/4 cup)",
    "1 ounce Parmesan (optional), grated (1/4 cup)"
  ],
  "__v": 1
}