{
  "hash": "2fdc2a2169ef3c6166c5ac10b1cf3e48807f3f6d",
  "title": "CHINESE STEAMED MEAT BUNS (BAOZI) 包子",
  "image": "http://cdn3.yireservation.com/wp-content/uploads/2015/09/IMG_8735.jpg?x48477",
  "href": "http://yireservation.com/recipes/chinese-steamed-meat-buns/",
  "extension": "Chrome",
  "firstAdded": "2017-04-18T21:29:20.428000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "DIRECTIONS:",
    "Follow my basic steamed bun (Mantou) recipe to make the basic dough. You’ll need about 2 – 3 hours to prepare the dough",
    "While waiting for the dough to rise, start making the stuffing by chopping the scallions and ginger",
    "Chop the cabbage to the size of ½ of your pinky nail. Move the chopped cabbage to a mixing bowl",
    "Mix 1 tbsp of salt into the cabbage. Let sit for about 20 minutes or until cabbage has released some moisture",
    "Remove the cabbage liquid. Combine with the ground pork (or your meat of choice) in the same bowl. Add the chopped scallions and ginger to the pork and cabbage",
    "Mix in all the stuffing marinade ingredients to the pork except the cooking oil. Whisk the stuffing using a spoon until all the ingredients are well incorporated. Add additional salt to taste if needed",
    "Drip the cooking oil in the meat mixture and whisk to mix. Seal the stuffing with plastic wrapper and chill in the fridge for at least 30 minutes. This can be done in advance",
    "Once the dough is ready, transfer the dough to a flour-dusted workstation. Divide into 4 portions. Roll each portion into a log that’s about 1.5 inch in diameter",
    "Cut the log into 6 parts and shape each port into a ball. Make sure you coat the dough balls with a layer of flour. Press down the ball with your palm. Using a rolling pin, roll the dough into a round thin wrapper with 4 inch diameter. When rolling, make sure the center of the wrapper is thicker than the edge of the wrapper. Repeat this step to make a batch of 6 wrappers at a time",
    "To fold the bun. Place 1 to 2 tbsp of the filling in the center of the wrapper. Try to stack up the filling so it’s at least 1 inch from the edge of the wrapper. Wrap the bun by folding the edge counterclockwise until the bun is completely sealed. Repeat these two steps to assemble the rest of the buns",
    "Place the buns on a bamboo steamer with parchment in between to prevent sticking. Don’t steam your buns right away but instead let them sit for another 30 – 45 minutes. This is an important step in making the buns soft and fluffy. The buns will increase in size",
    "Steam the buns for 15 minutes over high heat. Turn off the heat but do not open the steamer cover. Let them sit in the steamer for another 5 minutes before you take them out. Let them cool a little and serve hot as breakfast, snack, or appetizers"
  ],
  "ingredients": [
    "0",
    "FOR THE DOUGH",
    "500g all-purpose flour, more as needed",
    "1.5tsp instant yeast",
    "50ml lukewarm water",
    "230ml milk or water +/- 10ml, at room temperature",
    "1tsp baking powder",
    "50g sugar",
    "3g salt",
    "2tbsp cooking oil",
    "1/10tsp baking soda (optional)",
    "FOR STUFFING",
    "1.5lb ground pork (can use chicken, beef, or lamb)",
    "¼ cabbage",
    "5 scallions",
    "2inch fresh ginger root",
    "Get Ingredients Powered by Chicory",
    "STUFFING MARINADE",
    "2tbsp soy sauce",
    "2tbsp cooking oil",
    "1tbsp sugar",
    "1.5tbsp Chinese rice wine",
    "1tsp five-spice powder",
    "1 egg",
    "1tsp sesame oil",
    "2tsp ground white pepper",
    "Additional salt to taste"
  ],
  "__v": 1
}