{
  "__v": 1,
  "directions": [
    "0",
    "Directions:",
    "Preheat oven to 350F degrees. Line two 12-count muffin pans with 18 cupcake liners. Set aside.",
    "Make the cupcakes. Using a handheld or stand mixer fitted with a paddle attachment, beat the butter, brown sugar, and granulated sugar together in a large bowl on medium speed until creamed. About 2-3 minutes. With the mixer running on low speed, add the eggs, one at a time, beating well after each addition. Add the mashed bananas and vanilla, beating on low speed for about 1 minute.",
    "Whisk the flour, baking soda, cinnamon, and salt together in a medium bowl. Slowly add the dry ingredients to the wet ingredients in 3 additions, stirring by hand after each addition. Add the milk and stir until combined. The batter will be lumpy. Fold in the chocolate chips.",
    "Spoon the batter evenly into 18 cupcake liners. Fill the unused cups one-third full with water to prevent warping. Bake each batch for 17-19 minutes or until a toothpick inserted in the middle of a cupcake comes out clean. Allow to cool completely before frosting.",
    "For the chocolate frosting: sift together the confectioners' sugar and cocoa powder to assure there are no lumps. Set aside. With a handheld or stand mixer fitted with a paddle attachment, beat the butter on medium speed until creamy - about 2 minutes. Gradually add the sifted sugar/cocoa powder alternately with the heavy cream and vanilla. Beat on low speed after each addition. Once all added, beat on high speed until creamy and combined for at least 2 minutes. Add a pinch of salt if frosting is too sweet.",
    "For the peanut butter frosting: With a handheld or stand mixer fitted with a paddle attachment, beat the peanut butter and butter on medium speed until creamy and completely smooth - about 3 minutes. Add the confectioners' sugar and vanilla. Mix on medium until combined. Add the cream and mix on high until creamy, at least 2 minutes. Add a pinch of salt if frosting is too sweet.",
    "Frost cooled cupcakes with a knife or with a piping bag/tip. If you'd like to just make 1 kind of frosting and not both, make sure you double the frosting recipe of your choice to make sure there is enough for all cupcakes. To swirl the two frostings like I did, here is how I made the swirl frosting. There may be leftover frosting depending how much you use on each cupcake. Decorate with banana slices and/or more chocolate chips if desired.",
    "Store cupcakes in an airtight container at room temperature for up to 2 days and in the refrigerator up to 5.",
    "*For the cupcakes, you must use buttermilk. You can sour your own milk at home to make DIY buttermilk. For this particular recipe, simply measure 1/2 Tablespoon of fresh lemon juice in a measuring cup/glass. Then fill the rest up with milk until you reach 1/2 cup. Stir it around, let sit for 5 minutes, and it will be ready to use in your cupcakes. (Alternatively, you could also use 1/2 Tablespoon of white vinegar.)",
    "*For the frosting, heavy cream or half-and-half will give your frostings the creamiest texture. You may use milk instead, keeping in mind the frostings won't be as creamy.",
    "© SALLY’S BAKING ADDICTION. All images & content are copyright protected. Please do not use my images without prior permission. If you want to republish this recipe, please re-write the recipe in your own words, or link back to this post for the recipe."
  ],
  "firstAdded": "2014-09-12T13:08:01.956000",
  "hash": "548f4167eb946b582cc9371566d5fcbf157c36c1",
  "href": "http://sallysbakingaddiction.com/2014/03/09/banana-cupcakes-chocolate-peanut-butter-frosting/",
  "image": "http://sallysbakingaddiction.com/wp-content/uploads/2014/03/Banana-Cupcakes-with-Chocolate-Peanut-Butter-Swirl-Frosting.-Super-moist-and-all-your-favorite-flavors-in-one_-180x180.jpg",
  "ingredients": [
    "0",
    "Ingredients:",
    "CUPCAKES",
    "½ cup (115g) unsalted butter, softened to room temperature",
    "½ cup (100g) light or dark brown sugar",
    "¾ cup (150g) granulated sugar",
    "3 large eggs, room temperature",
    "1 and ½ cups mashed banana (about 3 large very ripe bananas)",
    "2 teaspoons vanilla extract",
    "2 cups (250g) all-purpose flour (careful not to overmeasure)",
    "1 teaspoon baking soda",
    "½ teaspoon ground cinnamon",
    "1 teaspoon salt",
    "½ cup (120ml) buttermilk*",
    "1 cup (180g) mini or regular semi-sweet chocolate chips",
    "MILK CHOCOLATE FROSTING",
    "1 and 3/4 cups (210g) confectioners' sugar",
    "1/4 cup (21g) unsweetened cocoa powder",
    "1/2 cup (115g) unsalted butter, softened to room temperature",
    "2 Tablespoons (30ml) heavy cream or half-and-half*",
    "1 teaspoon vanilla extract",
    "salt, to taste",
    "PEANUT BUTTER FROSTING",
    "3/4 cup (185g) creamy peanut butter",
    "4 Tablespoons (60g) unsalted butter, softened to room temperature",
    "3/4 cup (90g) confectioners' sugar",
    "1 teaspoon vanilla extract",
    "3 Tablespoons (45ml) heavy cream or half-and-half*"
  ],
  "keywords": [
    "cupcakes",
    "unsalted",
    "butter",
    "softened",
    "room",
    "light",
    "dark",
    "brown",
    "sugar",
    "granulated",
    "eggs",
    "mashed",
    "banana",
    "bananas",
    "vanilla",
    "allpurpose",
    "flour",
    "careful",
    "overmeasure",
    "baking",
    "soda",
    "cinnamon",
    "salt",
    "buttermilk",
    "mini",
    "regular",
    "semisweet",
    "chocolate",
    "chips",
    "milk",
    "frosting",
    "confectioners",
    "cocoa",
    "cream",
    "halfandhalf",
    "peanut",
    "creamy"
  ],
  "title": "Banana Cupcakes with Chocolate Peanut Butter Frosting",
  "users": [
    null
  ]
}