{
  "hash": "037791bd400efbcdff2b12771b15bb8f4cabb6da",
  "title": "kale salad with sautéed apples",
  "image": "http://www.brooklynsupper.net/http://brooklynsupper.net/wp-content/uploads/2014/10/kale-salad-with-sauteed-apples07.jpg",
  "href": "http://www.brooklynsupper.net/2014/10/kale-salad-with-sauteed-apples/",
  "extension": "Chrome",
  "firstAdded": "2015-06-21T20:27:15.494000",
  "users": [
    null
  ],
  "keywords": [
    "bunch",
    "kale",
    "kind",
    "ribbons",
    "zest",
    "lemon",
    "juice",
    "clove",
    "garlic",
    "smashed",
    "salt",
    "extra",
    "virgin",
    "olive",
    "oil",
    "cooking",
    "shallot",
    "crisp",
    "apples",
    "cored",
    "slices",
    "raw",
    "hulled",
    "pepitas"
  ],
  "directions": [
    "0",
    "Prep the kale, set in a large bowl, and toss with lemon zest. To make the vinaigrette, use a fork to whisk the garlic into the lemon juice. Add a generous pinch of sea salt. Drizzle in 3 tablespoons olive oil, whisking until emulsified.",
    "Drizzle half the dressing over the kale leaves and massage with fingers. Rough the kale up a bit –– don’t be shy. Set aside while you prep the toppings.",
    "Set a large cast iron skillet over medium/medium-high heat. Add a drizzle of olive oil and the shallots. Sauté, stirring occasionally, until shallots have browned, about 10 minutes. Meanwhile, slice apples, toss in the skillet, and cook just until apples are warm and have lost their bite, 5 – 7 minutes. Remove shallots and apples from heat, add another drizzle of oil, and toast the pepitas, cooking just until they pop, about 1 – 2 minutes. Toss warm pepitas with sea salt.",
    "Fold the warm apples, shallots, and pepitas into the prepared kale leaves. Taste for salt levels and adjust if needed. Serve immediately, or cover and refrigerate for up to a day."
  ],
  "ingredients": [
    "0",
    "1 large bunch kale, any kind, cut into thin ribbons",
    "zest of 1 lemon",
    "2 tablespoons lemon juice",
    "1 clove garlic, smashed and minced",
    "sea salt to taste",
    "3 tablespoons extra virgin olive oil, plus more for cooking",
    "1 shallot, peeled and sliced",
    "4 crisp apples, cored and cut into 1/2 inch slices",
    "1/2 cup raw, hulled pepitas"
  ],
  "__v": 1
}