{
  "hash": "0ab4d583dd3f33a5cb8ae67685e41f30618f1a8b",
  "title": "Baked Panko-Crusted Chicken Tenders with Honey-BBQ Dipping Sauce",
  "image": "http://www.gimmesomeoven.com/wp-content/uploads/2009/10/panko-crusted-chicken-tenders-with-bbq-dipping-saue.jpg",
  "href": "http://www.gimmesomeoven.com/baked-panko-crusted-chicken-tenders-with-honey-bbq-dipping-sauce/",
  "extension": "Chrome",
  "firstAdded": "2016-08-28T22:31:36.902000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat oven to 350F. Prepare a baking sheet by covering it with foil and lightly spraying with cooking spray. Set aside.",
    "In a small bowl or shallow dish, season the flour with salt and black pepper, and lightly beat the eggs in another shallow dish. In a third shallow dish, combine panko breadcrumbs with oregano, garlic, paprika, cayenne, salt, and pepper.",
    "If using chicken breasts, prepare by putting one breast in between two layers of plastic wrap. Pound to an even thickness of approximately 1/2\". Remove plastic and slice into strips.",
    "Dredge tenders in the flour to coat, shaking off any excess flour. Dip the floured chicken tenders into the egg and then coat the chicken tenders with the breadcrumb mixture. Arrange on baking sheet. Repeat with remaining strips.",
    "Bake chicken tenders for 12-15 minutes, or until golden brown, flipping once part way through the cook time.\nTo prepare sauce, whisk together honey and barbeque sauce in a small bowl until combined. Season to taste with salt and pepper."
  ],
  "ingredients": [
    "0",
    "1 1/2 lbs boneless skinless chicken breasts or breast tenders",
    "1 1/2 cups panko breadcrumbs",
    "1 tsp. oregano",
    "2 tsp. garlic powder",
    "1 tsp. smoked paprika",
    "1/2 tsp. cayenne",
    "1/2 tsp. kosher salt",
    "1",
    "1/2 cup favorite barbecue sauce",
    "3 Tbsp. honey",
    "1/2 teaspoon freshly ground black pepper",
    "2 eggs",
    "1/2 cup flour"
  ],
  "__v": 1
}