{
  "hash": "01c26694bfe47fa9ffe66281a250af53d9b6944d",
  "title": "Homemade Red Sauerkraut",
  "image": "http://i1.wp.com/whatjewwannaeat.com/wp-content/uploads/homemade-red-saurkraut-2.jpg?resize=640%2C427",
  "href": "http://whatjewwannaeat.com/homemade-red-cabbage-sauerkraut/",
  "extension": "Chrome",
  "firstAdded": "2015-06-20T12:41:38.763000",
  "users": [
    null
  ],
  "keywords": [
    "glass",
    "jar",
    "airtight",
    "lid",
    "red",
    "cabbage",
    "pickling",
    "salt",
    "ginger",
    "jalapeo",
    "apples",
    "carrots"
  ],
  "directions": [
    "0",
    "To prep cabbage, wash the cabbage and peel away any ugly pieces and reserve a few of the nicer layers. Then cut in half, and cut each of those pieces in half so you have quarters. Remove the hard core from each piece. Then slice thin.",
    "Put the shredded cabbage (and other items if using) in a large bowl with salt and massage the cabbage to extract the juices until it begins to soften and shrink in size.",
    "Pack the cabbage and juices in the jar a little at a time and squish down as much as you can, extracting more juices and blocking out any air. If the cabbage isn’t submerged under water, boil some salted water and let cool and pour over the cabbage to cover it. Then top with extra cabbage leaves to block out remaining air.",
    "Tightly seal lid and leave in a dark place at room temperature for 1-3 weeks. I covered mine in a towel to protect it. Check it every day to make sure the cabbage is still submerged and skim any gunk. Start tasting after 7 days. In the cool winter, fermentation will take longer than in the hotter summer. In my opinion the longer it sits the better! Once it tastes the way you like, store in the refrigerator. It should keep for a few months once refrigerated.",
    "Add to anything! Brisket, Reuben sandwiches, latkes. Yum!"
  ],
  "ingredients": [
    "0",
    "1 glass jar with a air-tight lid",
    "3 pounds red cabbage",
    "2 Tablespoons pickling salt",
    "Fresh ginger, jalapeño, apples, carrots, etc (optional)"
  ],
  "__v": 1
}