{
  "hash": "2ea38aecc539b0398948295797b7992d045b498c",
  "title": "Carrot Cake (America's Test Kitchen) Recipe",
  "image": "https://www.familycookbookproject.com/images/fcb_big_logo.gif",
  "href": "https://www.familycookbookproject.com/recipe/3634005/carrot-cake-americas-test-kitchen.html",
  "extension": "Firefox",
  "firstAdded": "2020-04-30T00:19:52.039000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Adjust oven rack to middle position. Heat oven to 350 F. Grease 13 x 9 inch baking pan (I use pyrex), then line the bottom with parchment paper if planning on removing cake from pan to serve.",
    "Whisk flour, cinnamon, baking powder, baking soda, salt, nutmeg, and cloves together in medium bowl. Set aside.",
    "In a large bowl (or GENTLY using a stand mixer), whisk eggs and sugars together until the sugars are mostly dissolved and the mixture is frothy. Continue to whisk and slowly drizzle in oil until thoroughly combined and emulsified. Whisk in the flour mixture until JUST incorporated (don't over mix!). Stir in carrots.",
    "Give batter a final stir with a rubber spatula to make sure it is thoroughly combined. Scrape batter into pan. Smooth the top. Lightly tap the pan on the counter top a few times to settle the batter.",
    "Bake the cake until a toothpick inserted in the center of the cake comes out with a few moist crumbs attached (35 to 40 minutes, but use your judgement). Rotate pan in oven halfway into the baking time.",
    "Cool cake completely. Remove from pan and frost, or frost in pan. Serve. Enjoy."
  ],
  "ingredients": [
    "0",
    "2 1/2 cups (12.5 ounces) unbleached all-purpose flour",
    "1 1/4 tsp ground cinnamon",
    "1 1/4 tsp baking powder",
    "1 tsp baking soda",
    "1/2 tsp table salt",
    "1/2 tsp ground nutmeg",
    "1/8 tsp ground cloves",
    "4 large eggs (or 5 medium eggs), room temperature",
    "1 1/2 cups (10.5 ounces) granulated sugar",
    "1/2 cup packed (3.5 ounces) light brown sugar",
    "1 1/2 cups vegetable oil",
    "1 lb carrots (about 6 medium), washed and grated on large holes (peeling optional) (use a food processor or similar electric grater-- by hand is torture)",
    "Cream cheese frosting (4 cups if frosting out of pan. 3 cups if frosting in pan."
  ],
  "__v": 1
}