{
  "hash": "9699d1bd0fd728402d4c0d42cf9e2500bb8ad888",
  "title": "Fruit Slab Pie",
  "image": "https://img.washingtonpost.com/rf/image_982w/2010-2019/WashingtonPost/2016/07/25/Food/Images/ApricotSlabPie-37691465348635.jpg",
  "href": "https://www.washingtonpost.com/pb/recipes/apricot-pie-crowd/15408/?tid=a_inl",
  "extension": "Chrome",
  "firstAdded": "2016-08-01T21:41:01.664000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "For the filling: Cut each apricot in half, remove and discard the pit, then cut each half into three or four slices. Combine the apricot slices, sugar, lemon juice and lemon verbena, if using, in a glass or ceramic bowl. Stir well to begin to dissolve the sugar. Cover and refrigerate for at least 2 hours and preferably overnight.",
    "For the crust: Lightly flour a work surface.",
    "Combine half of the flour and half of the butter in a food processor; pulse about 10 times or until the butter is reduced to small pieces. Add 1/2 cup of the ice water and a pinch of salt. Run the processor just until a dough just comes together in a ball. Transfer to the work surface and shape into a block that's about 6 inches by 4 inches by 2 inches. Wrap in plastic wrap and refrigerate for at least 2 hours and preferably overnight. Repeat with the remaining flour, butter, ice water and salt.",
    "Preheat the oven to 450 degrees. Make room in the freezer (or the refrigerator) for the baking sheets. Flour a rolling pin and re-flour the work surface; then mark off a space about 20 inches by 15 inches (use tape or place salt and pepper shakers at the four corners). This is your guide.",
    "Roll out one brick of dough out to a final size as close to the guide as possible. Don’t worry if the dough splits or tears; it will patch easily. Roll the dough up around the pin and then drape it over one of the baking sheets, letting it fall into the corners and edges. Working quickly, lightly press the dough into the baking sheet, trimming (with kitchen scissors) as needed to leave a 1-inch overhang of dough; transfer the baking sheet to cold storage. Repeat with the second brick of dough.",
    "When you're ready to bake, use the first chilled bottom slab pie shell. Discard the lemon verbena, if using, from the fruit mixture and add the cornstarch, stirring until well incorporated. Pour the fruit and every bit of the sugary syrup into the bottom crust and push it around until evenly distributed. Sprinkle the almond paste over the fruit, if using.",
    "Invert the second chilled slab pie dough over the filling; you no longer need that second baking sheet. Fold and tuck in the dough overhang on both bottom and top moving all the way around the pan, then go back around to decoratively crimp the edges. Cut slits in the top crust (to allow steam to escape). Brush with the milk or cream, then sprinkle with the remaining 2 tablespoons of sugar.",
    "Place the pie on the middle rack of the oven; immediately reduce the temperature to 375 degrees. Bake for 55 minutes or until the fruit juices are bubbling and the crust is toasty brown. Transfer to a wire rack to cool for at least 3 hours before serving.",
    "VARIATION: If apricots are unavailable, peaches or plums work beautifully in this slab pie. While apricots and plums have a tender, edible skin, the peel on a peach is tough and fuzzy. To remove the peach skins, score a shallow \"X\" in the bottom of each piece of fruit. Carefully drop in batches into a pot of boiling water; blanch for 30 seconds, then use a slotted spoon to transfer them to a bowl of ice water to cool. The peels will then slide right off. Cut the fruit into chunky wedges: about 8 or 10 pieces per peach and 6 or 8 per plum."
  ],
  "ingredients": [
    "0",
    "4 pounds apricots, slightly firm (see headnote)",
    "1 cup sugar",
    "Juice of 2 lemons",
    "Three 3-inch sprigs of lemon verbena (optional)",
    "1/4 cup cornstarch",
    "12 ounces almond paste, crumbled (not marzipan; optional)"
  ],
  "__v": 1
}