{
  "hash": "4bb3d02ac66de83e5f5ee0a6752b961f7497e421",
  "title": "Speedy Spanish Omelette",
  "image": "http://recipe-folder.com/img/recipe-images/047/923/563808947.jpg",
  "href": "http://www.lidl.co.uk/en/2255.htm",
  "extension": "Chrome",
  "firstAdded": "2015-12-24T14:05:16.217000",
  "users": [
    null
  ],
  "keywords": [
    "serves",
    "medium",
    "onion",
    "cubed",
    "new",
    "potatoes",
    "red",
    "green",
    "peppers",
    "seeded",
    "courgettes",
    "frozen",
    "peas",
    "chorizo",
    "sausage",
    "olive",
    "oil",
    "eggs",
    "cheddar",
    "cheese",
    "salt",
    "black",
    "pepper"
  ],
  "directions": [
    "0",
    "Heat 2 tablespoons of olive oil in a medium, non-stick frying pan and when it’s smoking hot, add the potatoes and onions. Toss them around in the oil to get a good coating, then turn the heat right down, cover with a lid and cook gently for 15 minutes.",
    "Check occasionally and give them a stir to stop them browning. Add the peppers, courgettes, peas and chorizo and mix well then cover and cook for another 5-8 minutes or until the veggies are beginning to soften. Meanwhile, whisk the eggs lightly and season with salt and freshly ground black pepper.",
    "Tip the cooked vegetables into the eggs and mix well. Put the frying pan back on the heat, add the remaining 2 tablespoons of oil and heat until medium-hot. Pour the whole lot into the pan, cook for one minute then turn the heat right down to low and cook for about 20 minutes uncovered.",
    "Once almost cooked through and set, heat the grill. Throw the cheese on top of the omelette and stick under the grill for 5 minutes until golden and bubbling.",
    "This is great served in thick wedges with a chunky tomato and onion salad – and even better taken on a picnic, wrapped in greaseproof and eaten with quartered tomatoes."
  ],
  "ingredients": [
    "0",
    "(Serves 4)",
    "1 medium onion, sliced",
    "100g potatoes, peeled and diced (or even cubed new potatoes)",
    "2 red or red and green peppers, seeded and diced",
    "2 courgettes, diced",
    "50g frozen peas",
    "100g chorizo sausage, diced",
    "4 tablespoons olive oil",
    "5 large eggs",
    "75g cheddar cheese, grated",
    "Salt and freshly ground black pepper"
  ],
  "__v": 3
}