{
  "hash": "5bd13c707ad1ea6e08d7920d39a392178802a279",
  "title": "Roll-Out Sugar Cookies",
  "image": "https://images.food52.com/4-vqjSok5Ea9mC_d0BSzdsy7itY=/753x502/017d68a7-eb35-4a06-ade9-4341b29c9233--2017-1130_making-magic_cookies_julia-gartland-243.jpg",
  "href": "https://food52.com/recipes/32498-roll-out-sugar-cookies",
  "extension": "Chrome",
  "firstAdded": "2018-01-02T17:12:33.786000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "In a large bowl, whisk the flour, baking powder, salt, and cinnamon to combine.",
    "In the bowl of an electric mixer fitted with the paddle attachment, cream the butter and sugar until light and fluffy, 4 to 5 minutes. Add the egg and vanilla and mix to combine, scraping well after everything is incorporated.",
    "Add the flour mixture all at once (unless your mixer physically can’t handle that), and pulse the mixer a few times to avoid a floury cloud from poofing up out of the mixing bowl. Mix on low speed just until the flour is incorporated, scraping down the bowl as necessary. Form the dough into a disc and wrap in plastic wrap. Chill for 1 hour.",
    "Preheat the oven to 350° F. Roll out the dough on a lightly floured surface to 1/2-inch thick. Cut the dough using your favorite cookie cutter and transfer to a parchment-lined baking sheet.",
    "Bake until the cookies are lightly golden around the edges, 10 to 12 minutes. For even baking, rotate the pan halfway through baking. Transfer the baked cookies to a cooling rack and cool completely before decorating or serving.",
    "If you're dipping the cookies in chocolate, melt your chocolate of choice over a double boiler or in the microwave in increments of 10-20 seconds until melted. Dip the cookies half in the chocolate, sprinkle with desired toppings, and lay on wax paper until cool.",
    "NOTE: To make chocolate sugar cookies, reduce the flour to 2 3/4 cups and add 1/2 cup cocoa powder. To make marbled cookies, make one batch of vanilla dough and one batch of chocolate dough and mix to desired ratio."
  ],
  "ingredients": [
    "0",
    "3 1/4 cups (15 ounces) all-purpose flour (or 2 3/4 cups all-purpose flour and 1/2 cup cocoa powder, for chocolate cookies)",
    "1 1/2 teaspoons baking powder",
    "1/2 teaspoon salt",
    "1 pinch ground cinnamon",
    "2 sticks (8 ounces) unsalted butter, at room temperature",
    "1 cup (6 ounces) granulated sugar",
    "1 egg",
    "1 teaspoon vanilla extract",
    "1 cup (8 ounces) dark chocolate, milk chocolate, or white chocolate chips (or the equivalent in bars, roughly chopped), optional",
    "sprinkles, crushed candy canes, flaky sea salt, crushed nuts, chili pepper, shredded coconut, optional"
  ],
  "__v": 1
}