{
  "hash": "f149d1cdc0b7a6bf90a1ac7c82db24044ca52a9a",
  "title": "OLD FASHIONED DIVINITY CANDY RECIPE",
  "image": "https://houseofnasheats.com/wp-content/uploads/2017/11/Old-Fashioned-Divinity-Candy-Recipe-7-200x200.jpg",
  "href": "https://houseofnasheats.com/old-fashioned-divinity-candy-recipe/",
  "extension": "Chrome",
  "firstAdded": "2019-05-24T21:44:54.906000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Line a cookie sheet with parchment paper or a silpat mat and set aside.",
    "In a large saucepan over medium heat, combine the sugar, water, corn syrup and salt and cook, stirring occasionally, just until the mixture starts to boil. Then clip a candy thermometer to the side of the pan and continue to cook without stirring until the temperature reaches 260 degrees F, about 8-10 minutes.",
    "While the sugar mixture is cooking, beat the egg whites on high speed using an electric mixer or stand mixer until stiff peaks form.",
    "Once the sugar mixture reaches 260 degrees, remove from heat and very slowly pour it in a thin, steady stream, over the egg whites while mixing on high speed. It should take about 2 minutes to pour the hot liquid over the egg whites, so go slow and don't rush this step.",
    "Continue to beat on high speed for another 5-8 minutes until the candy loses some of its glossiness and starts to hold its shape. You can stop mixing and test a small amount of candy by dropping a small spoonful of it onto the parchment paper to see if it holds its shape in a nice mound with nice swirls on top or if it melts down into a puddle. Continue to beat a minute or two longer if the divinity doesn't hold its shape yet, test again, then mix in the chopped pecans and vanilla when the candy stays in a mound instead of melting into itself.",
    "Using two spoons sprayed lightly with cooking spray, drop tablespoon size scoops of divinity onto the prepared baking sheet, using one spoon to scrape the hot candy off the other spoon. You will want to work quickly while the candy is still hot.",
    "Let the candy set, then store for up to 5 days in an airtight container."
  ],
  "ingredients": [
    "0",
    "2 1/2 cups granulated sugar",
    "1/2 cup water",
    "1/2 cup light corn syrup",
    "1/8 teaspoon salt",
    "2 egg whites, at room temperature",
    "1 cup chopped pecans",
    "1 teaspoon vanilla"
  ],
  "__v": 1
}