{
  "hash": "ff80784d7d2d853f6087e9cb4e431af22a106a13",
  "title": "Spanish Mac & Cheese with Chorizo",
  "image": "//media.foodnetwork.ca/recipetracker/175afeb5-9b36-4c71-96bb-463a56b64d19_spanish-mac-cheese_webready.jpg",
  "href": "https://www.foodnetwork.ca/shows/food-network-canada-chef-school/recipe/spanish-mac-and-cheese-with-chorizo/21280/",
  "extension": "Chrome",
  "firstAdded": "2019-05-22T03:44:05.495000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Heat your oven to 350°F (180°C). Lightly butter a 2-quart (2 L) baking dish.",
    "Cook the macaroni in boiling salted water until tender. Drain and rinse.",
    "In a large saucepan, heat the oil over medium heat. Add the sausages and cook until lightly browned, about 5 minutes. Transfer to a plate and set aside.",
    "To make the sauce, make a cut in half the onion about 1 inch (2.5 cm) deep, and slide a bay leaf into the slit. Stick the garlic cloves into the onion.",
    "In a large saucepan, combine the milk and onion, heat over medium heat. Meanwhile, in a second saucepan, melt the butter over low heat. Add the flour and cook the roux, stirring, for 3 minutes. Do not let it colour. Remove from heat. Pour some hot milk into the roux, stirring until the milk is thoroughly blended in. Stir the mixture into the remaining milk and simmer, stirring frequently for 15 minutes. Season with salt and pepper.",
    "Remove the onions. Add the cheese, paprika and the mustard. Continue cooking over low heat, stirring until the cheese is melted. Add the macaroni and sausage; stir together well. Season well with salt and pepper. Transfer to the prepared baking dish.",
    "1. To make the topping, combine bread crumbs, Parmesan, parsley, and paprika. Sprinkle over the casserole and drizzle with olive oil. Bake until browned and bubbly, 25 to 30 minutes.",
    "2. Remove from oven and serve immediately."
  ],
  "ingredients": [
    "0",
    "5 cups elbow macaroni",
    "2 tsp olive oil",
    "2 large chorizo sausages, casings removed, crumbled",
    "½ large onion, peeled and cut in half lengthwise",
    "1 bay leaf",
    "2 cloves garlic",
    "2 cups milk",
    "3 Tbsp unsalted butter",
    "3 Tbsp all-purpose flour",
    "Salt and black pepper, to taste",
    "2 ½ cups grated aged Cheddar cheese",
    "1 tsp sweet smoked paprika",
    "2 Tbsp Dijon mustard",
    "2 Tbsp olive oil",
    "1 cup panko breadcrumbs",
    "¼ cup grated Parmesan cheese",
    "2 Tbsp chopped parsley",
    "1 tsp sweet smoked paprika"
  ],
  "__v": 1
}