{
  "hash": "c39a238d2268f6ce1d550d9b5528d77f205065a9",
  "title": "Low & slow rebarca",
  "image": "http://cdn.coolinarika.net/image/617d47f8992099f9fc900d20e756bcef_header.jpg?v=9",
  "href": "http://www.coolinarika.com/recept/low-slow-rebarca/",
  "firstAdded": "2015-01-15T14:27:15.771000",
  "users": [
    null
  ],
  "keywords": [
    "svinjska",
    "rebra",
    "dry",
    "rub",
    "suhi",
    "pac",
    "liice",
    "slatka",
    "paprika",
    "liica",
    "ljuta",
    "stavim",
    "kajenski",
    "papar",
    "sueni",
    "umbir",
    "sol",
    "kim",
    "origano",
    "bosiljak",
    "wet",
    "tekui",
    "alice",
    "soja",
    "sos",
    "ljute",
    "paprike",
    "ili",
    "kajenskog",
    "papra",
    "smei",
    "eer",
    "med",
    "senf",
    "keap",
    "barbecue",
    "nije",
    "obavezno"
  ],
  "directions": [
    "0",
    "Prvo i jedino pravilo - NE KUPOVATI CARSKO MESO :)Idealan komad rebara ne bi smio imati puno masnoće te svakako izbjegavajte komade koji imaju više od 2-3cm mesa na sebi. Ja rebarca kupujem u Kauflandu jer ih uvijek imaju na lageru...",
    "S donje strane rebara obavezno skinite opnu. Ako ne možete onda ju zarežite na par mjesta.",
    "U jednoj zdjelici pomiješajte sve sastojke za dry rub.",
    "Dry rub dobro utrljajte u meso. Nemojte štedjeti na količini. Meso mora biti dobro, sa svih strana, pokriveno smjesom začina.",
    "Nakon toga meso zamotajte u aluminijsku foliju. Ja kupujem extra strong foliju.JAKO JE BITNO da se meso dobro omota folijom sa svih strana da nigdje ne bude rupa i da nigdje ne pušta jer će se u protivnom sokovi iscijediti i meso osušiti, a začini će zagorjeti. Ja omotam u 2 sloja folije.Nakon što ste to odradili meso staviti na pleh za pečenje u pećnicu na 180 stupnjeva prvih sat vremena, a tada treba smanjiti temperaturu na 150 stupnjeva i ostaviti da se na 150 stupnjeva peče minimalno 3 do 4 sata a može i dulje. U biti što dulje to bolje. Ja ostavim 4 sata.",
    "Kad je meso pri kraju s pečenjem pripremite sastojke za wet rub. Sve sastojke jednostavno pomiješajte zajedno.",
    "Izvadite meso iz pećnice i pojačajte temperaturu pećnice na 200 stupnjeva.Meso izvadite iz alu folije i vratite ga na pleh za pečenje. Sokove koji su se skupili u alu foliji tokom pečenja pažljivo odlijte u posudu za kuhanje - od njih ćemo kasnije napraviti umak tj. gravy :)Premažite meso sa svih strana umakom za wet rub te ga vratite u pećnicu na 10-15 minuta.",
    "Meso je gotovo kad se po površini počnu stvarati mjehurići jer se šećer počeo karamelizirati te kada se uhvati lagana korica. Budite jako oprezni i nemojte predugo držati meso u ovom stadiju u pećnici jer ako šećer pregori dati će nepopravljivo gorak okus mesu. Budite uz meso u ovom stadiju pečenja.",
    "Kad je gotovo izvadite meso iz pećnice i pustite ga da se odmori 5 minuta. Za to vrijeme dovršite gravy tako da u sok od pečenja dodate malo gustina te sve skupa zgusnete na vatri cca 2-3 minuta.Na ovaj način pripremljeno meso topi se u ustima te ima neusporediv okus. Slobodno kombinirajte začine za dry rub i wet rub po svom ukusu i želim Vam dobar tek :)"
  ],
  "ingredients": [
    "0",
    "2-2,5kg svinjska rebra",
    "Za dry rub tj. suhi pac",
    "2 žlićice slatka paprika",
    "1 žlićica ljuta paprika (ja stavim kajenski papar)",
    "1 žlićica sušeni đumbir",
    "1-2 žlićice sol",
    "1 žlićica kim",
    "1/2 žlićice origano",
    "1/2 žlićice sušeni bosiljak",
    "Za wet rub tj. tekući pac",
    "1/2 šalice soja sos",
    "1-2 žlićice ljute paprike (ili kajenskog papra)",
    "1 žlićica smeđi šećer",
    "1 žlićica med",
    "1 žlićica senf kečap",
    "1-2 žlićice barbecue sos (nije obavezno)"
  ],
  "__v": 5
}