{
  "hash": "7100c1fd9a68102ce18be22c968e3c3db485da0a",
  "title": "NO SUGAR ADDED BANANA NUT GRANOLA",
  "image": "https://www.budgetbytes.com/wp-content/uploads/2015/02/Banana-Nut-Granola-close-1-380x380.jpg",
  "href": "https://www.budgetbytes.com/2015/02/no-sugar-added-banana-nut-granola/",
  "extension": "",
  "firstAdded": "2018-05-02T13:05:26.575000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Preheat the oven to 300 degrees. Mash the bananas with a fork until they're mostly smooth (a few chunks are okay). Measure the banana mash, then add enough unsweetened apple sauce to make 2 cups total (about one cup of each).",
    "Place the bananas and apple sauce in a small sauce pan with the peanut butter, cinnamon, vanilla extract, and salt. Stir and cook over low heat for about five minutes, or until the mixture is evenly mixed and warmed through (this makes it more runny and easier to mix with the oats).",
    "Add the dry oats and shredded coconut to a very large bowl. Pour the banana, apple sauce, and peanut butter mixture over the oats and coconut, then stir well until all of the ingredients are incorporated. There should be no clumps of dry oats left.",
    "Line a large baking sheet with parchment paper, then spread the oat mixture in an even layer over the parchment, no more than one inch thick. If there is too much for one baking sheet, divide the mixture between two sheets.",
    "Bake the granola in the 300 degree oven for one to one and a half hours, stirring once after 30 minutes, then every 15 minutes after that**. Baking time will vary depending on whether you use one or two baking sheets. Keep an eye on the granola and stir every 15 minutes towards the end. The granola is finished when it is crisp and golden brown. Allow the granola to cool completely. Crush the banana chips into small pieces, then stir into the granola. Store the cooled granola in an air-tight container."
  ],
  "ingredients": [
    "0",
    "2 bananas, mashed (about 1 cup) $0.51",
    "1 cup unsweetened apple sauce $0.79",
    "1/2 cup natural peanut butter $0.93",
    "1 tsp cinnamon $0.10",
    "1 tsp vanilla extract $0.28",
    "1/4 tsp salt $0.02",
    "6 cups old fashioned rolled oats $0.99",
    "1 cup unsweetened shredded coconut* $0.91",
    "1 cup banana chips* $0.92"
  ],
  "__v": 1
}