{
  "hash": "79802d6dd5982313cb7ff6ef006ca05b584d6e6f",
  "title": "True Texas Chili",
  "image": "http://www.epicurious.com/images/recipesmenus/2009/2009_september/355049.jpg",
  "href": "http://www.epicurious.com/recipes/food/views/true-texas-chili-355049",
  "extension": "Firefox",
  "firstAdded": "2015-10-07T17:32:56.052000",
  "users": [
    null
  ],
  "keywords": [
    "new",
    "mexico",
    "california",
    "guajillo",
    "pasilla",
    "combination",
    "chiles",
    "cumin",
    "seed",
    "black",
    "pepper",
    "kosher",
    "salt",
    "lard",
    "oil",
    "rendered",
    "beef",
    "suet",
    "boneless",
    "chuck",
    "trimmed",
    "cubes",
    "yield",
    "trimming",
    "onion",
    "garlic",
    "stock",
    "canned",
    "lowsodium",
    "broth",
    "needed",
    "masa",
    "harina",
    "corn",
    "tortilla",
    "flour",
    "firmly",
    "dark",
    "brown",
    "sugar",
    "distilled",
    "white",
    "vinegar",
    "sour",
    "cream",
    "lime",
    "wedges"
  ],
  "directions": [
    "0",
    "Place the chiles in a straight-sided large skillet over medium-low heat and gently toast the chiles until fragrant, 2 to 3 minutes per side. Don't let them burn or they'll turn bitter. Place the chiles in a bowl and cover them with very hot water and soak until soft, 15 to 45 minutes, turning once or twice.",
    "Drain the chiles; split them and remove stems and seeds (a brief rinse helps remove seeds, but don't wash away the flesh). Place the chiles in the bowl of a blender and add the cumin, black pepper, 1 tablespoon salt and 1/4 cup water. Purée the mixture, adding more water as needed (and occasionally scraping down the sides of the blender jar), until a smooth, slightly fluid paste forms (you want to eliminate all but the tiniest bits of skin.) Set the chile paste aside.",
    "Return skillet to medium-high heat and melt 2 tablespoons of the lard. When it begins to smoke, swirl skillet to coat and add half of the beef. Lightly brown on at least two sides, about 3 minutes per side, reducing the heat if the meat threatens to burn. Transfer to a bowl and repeat with 2 more tablespoons of lard and the remaining beef. Reserve.",
    "Let the skillet cool slightly, and place it over medium-low heat. Melt the remaining 1 tablespoon of lard in the skillet; add the onion and garlic and cook gently for 3 to 4 minutes, stirring occasionally. Add the stock, the remaining 2 cups water and gradually whisk in the masa harina to avoid lumps. Stir in the reserved chile paste, scraping the bottom of the skillet with a spatula to loosen any browned bits. Add the reserved beef (and any juices in the bowl) and bring to a simmer over high heat. Reduce heat to maintain the barest possible simmer (just a few bubbles breaking the surface) and cook, stirring occasionally, until the meat is tender but still somewhat firm and 1 1/2 to 2 cups of thickened but still liquid sauce surrounds the cubes of meat, about 2 hours.",
    "Stir in the brown sugar and vinegar thoroughly and add more salt to taste; gently simmer 10 minutes more. At this point, it may look like there is excess sauce. Turn off the heat and let the chili stand for at least 30 minutes, during which time the meat will absorb about half of the remaining sauce in the skillet, leaving the meat bathed in a thick, somewhat fluid sauce. Stir in additional broth or water if the mixture seems too dry. If the mixture seems a bit loose and wet, allow it to simmer a bit more (sometimes we like to partially crush the cubes of beef with the back of a spoon to let them absorb more sauce). Adjust the balance of flavors with a bit of additional salt, sugar, or vinegar, if you like.",
    "Reheat gently and serve in individual bowls with a dollop of sour cream on top and a lime wedge on the side.",
    "From Lobel's Meat Bible: All You Need to Know About Meat and Poultry from America's Master Butchers by Stanley, Evan, Mark, and David Lobel, with Mary Goodbody and David Whiteman. Text copyright © 2009 by Morris Lobel & Sons, Inc.; photographs © 2009 by Lucy Schaeffer. Published by Chronicle Books LLC."
  ],
  "ingredients": [
    "0",
    "2 ounces dried, whole New Mexico (California), guajillo, or pasilla chiles, or a combination (6 to 8 chiles)",
    "1 1/2 teaspoons ground cumin seed",
    "1/2 teaspoon freshly ground black pepper",
    "Kosher salt",
    "5 tablespoons lard, vegetable oil, or rendered beef suet",
    "2 1/2 pounds boneless beef chuck, well trimmed and cut into 3/4-inch cubes (to yield 2 pounds after trimming)",
    "1/3 cup finely chopped onion",
    "3 large cloves garlic, minced",
    "2 cups beef stock\n, or canned low-sodium beef broth, plus more as needed",
    "2 tablespoons masa harina (corn tortilla flour)",
    "1 tablespoon firmly packed dark brown sugar, plus more as needed",
    "1 1/2 tablespoons distilled white vinegar, plus more as needed",
    "Sour cream",
    "Lime wedges"
  ],
  "__v": 1
}