{
  "hash": "b83e8181be779410398928777c8a5d010681474d",
  "title": "Indian Pilau",
  "image": "https://twosleevers.com/wp-content/uploads/2019/08/Instant-Pot-Peas-and-Carrots-Pilau-overhead-680x900-200x200.jpg",
  "href": "https://twosleevers.com/instant-pot-indian-pilau/?utm_source=pushengage&utm_medium=pushnotification&utm_campaign=pushengage",
  "extension": "Chrome",
  "firstAdded": "2019-09-23T15:40:40.441000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Instructions",
    "Turn the instant pot to sauté. When it’s hot add ghee, cumin, cloves, cinnamon, peppercorns and stir to flavor the ghee. Allow them to sizzle for 30 seconds. Then add the green onions and stir.",
    "If you’re using ground garam masala, add it to the pot along with the onions.",
    "Add in the rice water and salt and mix well.",
    "Then add the frozen onion peas and carrots on top. Do not stir.",
    "Close the lid and cook on high pressure for four minutes. When the cooking time is over allow the pot to rest undisturbed for 10 minutes. Then release all remaining pressure.",
    "Using a very light, hand mix the peas carrots and rice together and tip into a large serving dish to serve.",
    "Notes",
    "Make sure you don't bite directly into any of the whole spices! If you weren't raised eating traditional Indian food, we are trained from a young age to eat around the whole spices. So do yourself a favor and try not to chomp on any of the whole spices while you're inhaling this delicious goodness.",
    "You can use Garam Masala if you'd like, and in doing so you'll save yourself the extra effort of having to eat around the whole spices, but it really is that much better when you use whole spices. The spices flavor the rice around it and the water in a gentle fashion, with different tastes in different bites.",
    "If you decide to use Garam Masala instead of the whole spices, I highly recommend you make it yourself. Here is a great Garam Masala recipe for you to use!",
    "You can sub any other frozen veggie that you'd like.",
    "You can add paneer for protein if you'd like.",
    "Typically for 2 cups of rice, you’d only use 1.75 cups of water. But in this case, we’re using two cups of water to account for steaming the additional vegetables. My Perfect Pressure Cooker Rice post has some great tips on cooking rice in the Instant Pot."
  ],
  "ingredients": [
    "0",
    "Ingredients",
    "Whole Garam Masala Ingredients",
    "4 green cardamom pods",
    "4 cloves",
    "8 Whole Black Peppercorns",
    "2-3 inch Indian Cinnamon Cassia Bark",
    "1-2 black cardamom pods {optional)",
    "(or 1 tablespoon Garam Masala instead of all the spices)",
    "For The Rice",
    "2 tablespoons Ghee",
    "1 teaspoon cumin seeds",
    "1 cup green onions chopped",
    "1 bag frozen peas and carrots",
    "2 cups Basmati Rice long grain, rinsed and drained",
    "2 cups water"
  ],
  "__v": 1
}