{
  "hash": "b90dbba29efea71b3e9e53730e95e9d90b13d55e",
  "title": "Blackened Zucchini Tacos",
  "image": "http://cdn2.wellplated.com/wp-content/uploads/2016/07/Easy-Zucchini-Tacos.jpg",
  "href": "http://www.wellplated.com/zucchini-tacos/",
  "extension": "Chrome",
  "firstAdded": "2017-07-31T06:20:13.392000",
  "users": [
    null
  ],
  "ratings": [],
  "keywords": [],
  "directions": [
    "0",
    "Directions:",
    "In a large skillet, heat 1 1/2 tablespoons of the olive oil over medium high. While the oil heats, combine the chili powder, cumin, kosher salt, and cayenne pepper in a small bowl. Once the oil is hot and shiny, add the zucchini rounds in a single layer, then sprinkle with half the spice mixture. Let cook until the first side is golden, about 4 minutes, then flip, sprinkle with the remaining spice mixture, and cook on the other side until it is golden as well, 3-4 additional minutes. Remove to a plate and cover to keep warm.",
    "Reduce the skillet heat to medium low. Add the onion and corn and let cook until beginning to soften, about 5 minutes. Add the garlic and beans, then cook until the garlic is fragrant and the beans are heated through, about 2-3 minutes.",
    "If desired, toast the tortillas over a gas burner or cover with a lightly damp paper or kitchen towel and warm in the microwave. Fill tortillas with the bean mixture and reserved zucchini slices, then add any desired toppings. Enjoy immediately."
  ],
  "ingredients": [
    "0",
    "2 tablespoons extra virgin olive oil, divided",
    "2 teaspoons chili powder",
    "1 teaspoon ground cumin",
    "1/2 teaspoon kosher salt",
    "1/4 teaspoon ground cayenne pepper",
    "2 medium zucchini, cut into 1/2-inch round disks",
    "1 medium red onion, diced",
    "3/4 cup corn, cut from the cob (about 1 ear—or substitute frozen, thawed corn)",
    "2 teaspoons minced garlic",
    "1 can low sodium black beans, rinsed and drained",
    "8 Old El Paso Flour Tortillas (Fajita/Taco Size) (to make gluten free, swap corn tortillas)",
    "Toppings: Sliced radishes, cilantro, sour cream, feta, lime wedges"
  ],
  "__v": 2
}